///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// @strict-types

#Область ПрограммныйИнтерфейс

// Возвращает значение константы МаксимальноеКоличествоЧастичныхВыгрузокПодряд.
Функция МаксимальноеКоличествоЧастичныхВыгрузокПодряд() Экспорт
	Возврат Константы.МаксимальноеКоличествоЧастичныхВыгрузокПодряд.Получить();
КонецФункции

// Возвращает информацию о пользователе - email и имя в git.
Функция ИнформацияОПользователе(Хранилище, Пользователь) Экспорт
	Результат = Новый Структура("EMail, ИмяGit", "", ""); // Значения по умолчанию.
	Если ПустаяСтрока(Пользователь) Тогда
		Возврат Результат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Хранилище", Хранилище);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Регистр.Хранилище = &Хранилище КАК ЭтоХранилище,
	|	Регистр.Email КАК Email,
	|	Регистр.Имя КАК Имя
	|ИЗ
	|	РегистрСведений.ИнформацияПользователей КАК Регистр
	|ГДЕ
	|	Регистр.Пользователь = &Пользователь
	|	И Регистр.Хранилище В (&Хранилище, ЗНАЧЕНИЕ(Справочник.ХранилищаКонфигураций.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоХранилище УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.EMail = Выборка.Email;
		Результат.ИмяGit = Выборка.Имя;
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти
