///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// @strict-types

#Область ПрограммныйИнтерфейс

// Возвращает значение константы МаксимальноеКоличествоЧастичныхВыгрузокПодряд.
Функция МаксимальноеКоличествоЧастичныхВыгрузокПодряд() Экспорт
	Возврат Константы.МаксимальноеКоличествоЧастичныхВыгрузокПодряд.Получить();
КонецФункции

// Возвращает значение константы МаксимальноеКоличествоЧастичныхВыгрузокПодряд.
Функция ИнформацияОбАвторе(Хранилище, ИмяАвтора) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Хранилище", Хранилище);
	Запрос.УстановитьПараметр("ИмяАвтора", ИмяАвтора);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ИмяАвтора КАК ИмяАвтора,
	|	"""" КАК EmailАвтора
	|ПОМЕСТИТЬ ВТАвторИзПараметров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвторИзПараметров.ИмяАвтора КАК ИмяАвтора,
	|	ЕСТЬNULL(АвторыЭтогоХранилища.Имя, ЕСТЬNULL(АвторыПустогоХранилища.Имя, ЕСТЬNULL(АвторПоУмолчанию.Имя, АвторИзПараметров.ИмяАвтора))) КАК ПредставлениеАвтора,
	|	ЕСТЬNULL(АвторыЭтогоХранилища.Email, ЕСТЬNULL(АвторыПустогоХранилища.Email, ЕСТЬNULL(АвторПоУмолчанию.Email, АвторИзПараметров.EmailАвтора))) КАК EmailАвтора
	|ИЗ
	|	ВТАвторИзПараметров КАК АвторИзПараметров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияПользователей КАК АвторыЭтогоХранилища
	|		ПО (АвторыЭтогоХранилища.Пользователь = &ИмяАвтора)
	|			И (АвторыЭтогоХранилища.Хранилище = &Хранилище)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияПользователей КАК АвторыПустогоХранилища
	|		ПО (АвторыПустогоХранилища.Пользователь = &ИмяАвтора)
	|			И (АвторыПустогоХранилища.Хранилище = ЗНАЧЕНИЕ(Справочник.ХранилищаКонфигураций.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияПользователей КАК АвторПоУмолчанию
	|		ПО (АвторПоУмолчанию.Пользователь = """")";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	СтруктураРезультата = Новый Структура;
	Для Каждого КолонкаРезультатаЗапроса Из РезультатЗапроса.Колонки Цикл
		СтруктураРезультата.Вставить(КолонкаРезультатаЗапроса.Имя, Выборка[КолонкаРезультатаЗапроса.Имя]);
	КонецЦикла;
	
	Если СтрНайти(СтруктураРезультата.EmailАвтора, "@") = 0 Тогда
		СтруктураРезультата.EmailАвтора = "";
	КонецЕсли;
	
	Возврат СтруктураРезультата;
КонецФункции

#КонецОбласти
