///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Базовая функциональность".
// Серверные процедуры и функции общего назначения:
// - для работы с данными в базе;
// - для работы с прикладными типами и коллекциями значений;
// - математические процедуры и функции;
// - для работы с внешним соединением;
// - для работы с формами;
// - для работы с типами, объектами метаданных и их строковыми представлениями;
// - функции определения типов объектов метаданных;
// - сохранение, чтение и удаление настроек из хранилищ;
// - для работы с табличными документами;
// - для работы с журналом регистрации;
// - для работы в режиме разделения данных;
// - версионирование программных интерфейсов;
// - вспомогательные процедуры и функции.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура удаляет из массива МассивРеквизитов элементы, соответствующие именам 
// реквизитов объекта из массива МассивНепроверяемыхРеквизитов.
// Для использования в обработчиках события ОбработкаПроверкиЗаполнения.
//
// Параметры:
//	МассивРеквизитов              - Массив из Строка - массив строк с именами реквизитов объекта.
//	МассивНепроверяемыхРеквизитов - Массив из Строка - массив строк с именами реквизитов объекта, не требующих проверки.
//
Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт
	
	Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
	
		ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
		Если ПорядковыйНомер <> Неопределено Тогда
			МассивРеквизитов.Удалить(ПорядковыйНомер);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции для работы с данными в базе.

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Функция не предназначена для получения значений реквизитов пустых ссылок.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если строка затребованных реквизитов пуста, то возвращается пустая структура.
//              Если в качестве объекта передана пустая ссылка, то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъекта(Знач Ссылка, Знач Реквизиты) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		Реквизиты = СтрРазделить(Реквизиты, ", ", Ложь);
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	Если ТипЗнч(Реквизиты) = Тип("Структура") Или ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		СтруктураРеквизитов = Реквизиты;
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив") Или ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(СтрЗаменить(Реквизит, ".", ""), Реквизит);
		КонецЦикла;
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип второго параметра Реквизиты: %1'"), Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Ключ));
		
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
		|	" + ИмяПоля + " КАК " + Псевдоним;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|" + ТекстПолей + "
	|ИЗ
	|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
//
// Функция не предназначена для получения значений реквизитов пустых ссылок.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка -  например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита);
	Возврат Результат[СтрЗаменить(ИмяРеквизита, ".", "")];
	
КонецФункции 

// Возвращает значения реквизитов, прочитанные из информационной базы
// для нескольких объектов.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
//
// Функция не предназначена для получения значений реквизитов пустых ссылок.
// 
// Параметры:
//  МассивСсылок - Массив - ссылок на объекты одного типа.
//				ВАЖНО! значения массива должны быть ссылками на 
//				объекты одного типа!
//  ИменаРеквизитов - Строка - имена реквизитов перечисленные через запятую,
//				в формате требований к свойствам структуры.
//				Например, "Код, Наименование, Родитель".
// 
// Возвращаемое значение:
//  Соответствие - где ключ - ссылка на объект, а Значение - структура, которая 
//		   		содержит список свойств, как список имен в строке.
//				ИменаРеквизитов, со значениям реквизитов, прочитанными из информационной базы.
// 
Функция ЗначенияРеквизитовОбъектов(МассивСсылок, ИменаРеквизитов) Экспорт
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка, " + ИменаРеквизитов + "
		|ИЗ
		|	" + МассивСсылок[0].Метаданные().ПолноеИмя() + " КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Возвращает значения реквизита, прочитанного из информационной базы для нескольких объектов.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Функция не предназначена для получения значений реквизитов пустых ссылок.
//
// Параметры:
//  МассивСсылок - Массив - ссылок на объекты одного типа.
//				ВАЖНО! значения массива должны быть ссылками на 
//				объекты одного типа!
//  ИмяРеквизита - Строка - например, "Код".
// 
// Возвращаемое значение:
//  Соответствие - Ключ - ссылка на объект, Значение - значение прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъектов(МассивСсылок, ИмяРеквизита) Экспорт
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектов(МассивСсылок, ИмяРеквизита);
	Для Каждого Элемент Из ЗначенияРеквизитов Цикл
		ЗначенияРеквизитов[Элемент.Ключ] = Элемент.Значение[ИмяРеквизита];
	КонецЦикла;
		
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Определяет режим эксплуатации информационной базы файловый (Истина) или серверный (Ложь).
// При проверке используется СтрокаСоединенияИнформационнойБазы, которую можно указать явно.
//
// Параметры:
//  СтрокаСоединенияИнформационнойБазы - Строка - параметр используется, если
//                 нужно проверить строку соединения не текущей информационной базы.
//
// Возвращаемое значение:
//  Булево.
//
Функция ИнформационнаяБазаФайловая(Знач СтрокаСоединенияИнформационнойБазы = "") Экспорт
			
	Если ПустаяСтрока(СтрокаСоединенияИнформационнойБазы) Тогда
		СтрокаСоединенияИнформационнойБазы =  СтрокаСоединенияИнформационнойБазы();
	КонецЕсли;
	Возврат СтрНайти(Врег(СтрокаСоединенияИнформационнойБазы), "FILE=") = 1;
	
КонецФункции 

#Область ХранилищеНастроек

////////////////////////////////////////////////////////////////////////////////
// Сохранение, чтение и удаление настроек из хранилищ.

// Сохраняет настройку в хранилище общих настроек, как метод платформы Сохранить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, сохранение пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта       - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек      - Строка           - см. синтакс-помощник платформы.
//   Настройки         - Произвольный     - см. синтакс-помощник платформы.
//   ОписаниеНастроек  - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя   - Строка           - см. синтакс-помощник платформы.
//   ОбновитьПовторноИспользуемыеЗначения - Булево - выполнить одноименный метод платформы.
//
Процедура ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючНастроек, Настройки,
			ОписаниеНастроек = Неопределено,
			ИмяПользователя = Неопределено,
			ОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт
	
	ХранилищеСохранить(ХранилищеОбщихНастроек,
		КлючОбъекта,
		КлючНастроек,
		Настройки,
		ОписаниеНастроек,
		ИмяПользователя,
		ОбновитьПовторноИспользуемыеЗначения);
	
КонецПроцедуры

// Сохраняет несколько настроек в хранилище общих настроек, как метод платформы Сохранить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, сохранение пропускается без ошибки.
// 
// Параметры:
//   НесколькоНастроек - Массив - со значениями:
//     * Значение - Структура:
//         * Объект    - Строка       - см. параметр КлючОбъекта  в синтакс-помощнике платформы.
//         * Настройка - Строка       - см. параметр КлючНастроек в синтакс-помощнике платформы.
//         * Значение  - Произвольный - см. параметр Настройки    в синтакс-помощнике платформы.
//
//   ОбновитьПовторноИспользуемыеЗначения - Булево - выполнить одноименный метод платформы.
//
Процедура ХранилищеОбщихНастроекСохранитьМассив(НесколькоНастроек,
			ОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт
	
	Если Не ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из НесколькоНастроек Цикл
		ХранилищеОбщихНастроек.Сохранить(Элемент.Объект, КлючНастроек(Элемент.Настройка), Элемент.Значение);
	КонецЦикла;
	
	Если ОбновитьПовторноИспользуемыеЗначения Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры

// Загружает настройку из хранилища общих настроек, как метод платформы Загрузить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Кроме того, возвращает указанное значение по умолчанию, если настройки не существуют.
// Если нет права СохранениеДанныхПользователя, возвращается значение по умолчанию без ошибки.
//
// В возвращаемом значении очищаются ссылки на несуществующий объект в базе данных, а именно
// - возвращаемая ссылка заменяется на указанное значение по умолчанию;
// - из данных типа Массив ссылки удаляются;
// - у данных типа Структура и Соответствие ключ не меняется, а значение устанавливается Неопределено;
// - анализ значений в данных типа Массив, Структура, Соответствие выполняется рекурсивно.
//
// Параметры:
//   КлючОбъекта          - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек         - Строка           - см. синтакс-помощник платформы.
//   ЗначениеПоУмолчанию  - Произвольный     - значение, которое возвращается, если настройки не существуют.
//                                             Если не указано, возвращается значение Неопределено.
//   ОписаниеНастроек     - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя      - Строка           - см. синтакс-помощник платформы.
//
// Возвращаемое значение: 
//   Произвольный - см. синтакс-помощник платформы.
//
Функция ХранилищеОбщихНастроекЗагрузить(КлючОбъекта, КлючНастроек, ЗначениеПоУмолчанию = Неопределено, 
			ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт
	
	Возврат ХранилищеЗагрузить(ХранилищеОбщихНастроек,
		КлючОбъекта,
		КлючНастроек,
		ЗначениеПоУмолчанию,
		ОписаниеНастроек,
		ИмяПользователя);
	
КонецФункции

// Удаляет настройку из хранилища общих настроек, как метод платформы Удалить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, удаление пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта     - Строка
//                   - Неопределено - см. синтакс-помощник платформы.
//   КлючНастроек    - Строка
//                   - Неопределено - см. синтакс-помощник платформы.
//   ИмяПользователя - Строка
//                   - Неопределено - см. синтакс-помощник платформы.
//
Процедура ХранилищеОбщихНастроекУдалить(КлючОбъекта, КлючНастроек, ИмяПользователя) Экспорт
	
	ХранилищеУдалить(ХранилищеОбщихНастроек,
		КлючОбъекта,
		КлючНастроек,
		ИмяПользователя);
	
КонецПроцедуры

// Сохраняет настройку в хранилище системных настроек, как метод платформы Сохранить
// объекта СтандартноеХранилищеНастроекМенеджер, но с поддержкой длины ключа настроек
// более 128 символов путем хеширования части, которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, сохранение пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта       - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек      - Строка           - см. синтакс-помощник платформы.
//   Настройки         - Произвольный     - см. синтакс-помощник платформы.
//   ОписаниеНастроек  - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя   - Строка           - см. синтакс-помощник платформы.
//   ОбновитьПовторноИспользуемыеЗначения - Булево - выполнить одноименный метод платформы.
//
Процедура ХранилищеСистемныхНастроекСохранить(КлючОбъекта, КлючНастроек, Настройки,
			ОписаниеНастроек = Неопределено,
			ИмяПользователя = Неопределено,
			ОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт
	
	ХранилищеСохранить(ХранилищеСистемныхНастроек, 
		КлючОбъекта,
		КлючНастроек,
		Настройки,
		ОписаниеНастроек,
		ИмяПользователя,
		ОбновитьПовторноИспользуемыеЗначения);
	
КонецПроцедуры

// Загружает настройку из хранилища системных настроек, как метод платформы Загрузить,
// объекта СтандартноеХранилищеНастроекМенеджер, но с поддержкой длины ключа настроек
// более 128 символов путем хеширования части, которая превышает 96 символов.
// Кроме того, возвращает указанное значение по умолчанию, если настройки не существуют.
// Если нет права СохранениеДанныхПользователя, возвращается значение по умолчанию без ошибки.
//
// В возвращаемом значении очищаются ссылки на несуществующий объект в базе данных, а именно:
// - возвращаемая ссылка заменяется на указанное значение по умолчанию;
// - из данных типа Массив ссылки удаляются;
// - у данных типа Структура и Соответствие ключ не меняется, а значение устанавливается Неопределено;
// - анализ значений в данных типа Массив, Структура, Соответствие выполняется рекурсивно.
//
// Параметры:
//   КлючОбъекта          - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек         - Строка           - см. синтакс-помощник платформы.
//   ЗначениеПоУмолчанию  - Произвольный     - значение, которое возвращается, если настройки не существуют.
//                                             Если не указано, возвращается значение Неопределено.
//   ОписаниеНастроек     - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя      - Строка           - см. синтакс-помощник платформы.
//
// Возвращаемое значение: 
//   Произвольный - см. синтакс-помощник платформы.
//
Функция ХранилищеСистемныхНастроекЗагрузить(КлючОбъекта, КлючНастроек, ЗначениеПоУмолчанию = Неопределено, 
			ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт
	
	Возврат ХранилищеЗагрузить(ХранилищеСистемныхНастроек,
		КлючОбъекта,
		КлючНастроек,
		ЗначениеПоУмолчанию,
		ОписаниеНастроек,
		ИмяПользователя);
	
КонецФункции

// Удаляет настройку из хранилища системных настроек, как метод платформы Удалить,
// объекта СтандартноеХранилищеНастроекМенеджер, но с поддержкой длины ключа настроек
// более 128 символов путем хеширования части, которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, удаление пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта     - Строка
//                   - Неопределено - см. синтакс-помощник платформы.
//   КлючНастроек    - Строка
//                   - Неопределено - см. синтакс-помощник платформы.
//   ИмяПользователя - Строка
//                   - Неопределено - см. синтакс-помощник платформы.
//
Процедура ХранилищеСистемныхНастроекУдалить(КлючОбъекта, КлючНастроек, ИмяПользователя) Экспорт
	
	ХранилищеУдалить(ХранилищеСистемныхНастроек,
		КлючОбъекта,
		КлючНастроек,
		ИмяПользователя);
	
КонецПроцедуры

// Сохраняет настройку в хранилище настроек данных форм, как метод платформы Сохранить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, сохранение пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта       - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек      - Строка           - см. синтакс-помощник платформы.
//   Настройки         - Произвольный     - см. синтакс-помощник платформы.
//   ОписаниеНастроек  - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя   - Строка           - см. синтакс-помощник платформы.
//   ОбновитьПовторноИспользуемыеЗначения - Булево - выполнить одноименный метод платформы.
//
Процедура ХранилищеНастроекДанныхФормСохранить(КлючОбъекта, КлючНастроек, Настройки,
			ОписаниеНастроек = Неопределено,
			ИмяПользователя = Неопределено, 
			ОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт
	
	ХранилищеСохранить(ХранилищеНастроекДанныхФорм,
		КлючОбъекта,
		КлючНастроек,
		Настройки,
		ОписаниеНастроек,
		ИмяПользователя,
		ОбновитьПовторноИспользуемыеЗначения);
	
КонецПроцедуры

// Загружает настройку из хранилища настроек данных форм, как метод платформы Загрузить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Кроме того, возвращает указанное значение по умолчанию, если настройки не существуют.
// Если нет права СохранениеДанныхПользователя, возвращается значение по умолчанию без ошибки.
//
// В возвращаемом значении очищаются ссылки на несуществующий объект в базе данных, а именно
// - возвращаемая ссылка заменяется на указанное значение по умолчанию;
// - из данных типа Массив ссылки удаляются;
// - у данных типа Структура и Соответствие ключ не меняется, а значение устанавливается Неопределено;
// - анализ значений в данных типа Массив, Структура, Соответствие выполняется рекурсивно.
//
// Параметры:
//   КлючОбъекта          - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек         - Строка           - см. синтакс-помощник платформы.
//   ЗначениеПоУмолчанию  - Произвольный     - значение, которое возвращается, если настройки не существуют.
//                                             Если не указано, возвращается значение Неопределено.
//   ОписаниеНастроек     - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя      - Строка           - см. синтакс-помощник платформы.
//
// Возвращаемое значение: 
//   Произвольный - см. синтакс-помощник платформы.
//
Функция ХранилищеНастроекДанныхФормЗагрузить(КлючОбъекта, КлючНастроек, ЗначениеПоУмолчанию = Неопределено, 
			ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт
	
	Возврат ХранилищеЗагрузить(ХранилищеНастроекДанныхФорм,
		КлючОбъекта,
		КлючНастроек,
		ЗначениеПоУмолчанию,
		ОписаниеНастроек, 
		ИмяПользователя);
	
КонецФункции

// Удаляет настройку из хранилища настроек данных форм, как метод платформы Удалить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, удаление пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта     - Строка
//                   - Неопределено - см. синтакс-помощник платформы.
//   КлючНастроек    - Строка
//                   - Неопределено - см. синтакс-помощник платформы.
//   ИмяПользователя - Строка
//                   - Неопределено - см. синтакс-помощник платформы.
//
Процедура ХранилищеНастроекДанныхФормУдалить(КлючОбъекта, КлючНастроек, ИмяПользователя) Экспорт
	
	ХранилищеУдалить(ХранилищеНастроекДанныхФорм,
		КлючОбъекта,
		КлючНастроек,
		ИмяПользователя);
	
КонецПроцедуры

#КонецОбласти

#Область СериализацияXML

// Возвращает значение в виде XML-строки.
// Преобразованы в XML-строку (сериализованы) могут быть только те объекты, 
// для которых в описании указано, что они сериализуются.
//
// Параметры:
//   Значение - Произвольный - Значение, которое необходимо сериализовать в XML-строку.
//
// Возвращаемое значение:
//   Строка - XML-строка представления значения в сериализованном виде.
//
Функция ЗначениеВСтрокуXML(Значение) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

// Возвращает значение, полученное из XML-строки. 
// Получены из XML-строки могут быть только те объекты, 
// для которых в описании указано, что они сериализуются.
//
// Параметры:
// СтрокаXML - строка представления значения в сериализованном виде.
//
// Возвращаемое значение:
// Значение, полученное из переданной XML-строки.
//
Функция ЗначениеИзСтрокиXML(СтрокаXML) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Возврат СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
КонецФункции

#КонецОбласти

// Счтитывает в память текстовый файл на сервере в объект "ТектовыйДокумент" для отображения на клиенте
// 
// Параметры:
// 	ПутьКФайлу - Строка - Путь к файлу на сервере
// 	Текст - ТекстовыйДокумент- Текстовый документ, в который будет считан файл на сервере
// 	ИмяФайла - Строка - Возвращаемое значение имени файла
// 	ИспользоватьКодировкуСистемы - Булево - Истина - использовать кодировку системы, 
//      Ложь - считать файл в кодировке UTF-8
Процедура ПрочитатьТекстовыйФайл(ПутьКФайлу, Текст, ИмяФайла, ИспользоватьКодировкуСистемы = Ложь) Экспорт
	
	Файл = новый Файл(ПутьКФайлу);
	ИмяФайла = Файл.Имя;
	Если Файл.Существует() Тогда
		Если ИспользоватьКодировкуСистемы Тогда
			ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
			Если ЭтоWindowsСервер Тогда
				Текст.Прочитать(ПутьКФайлу, КодировкаТекста.OEM);
			Иначе
				Текст.Прочитать(ПутьКФайлу, КодировкаТекста.Системная);
			КонецЕсли;
		Иначе
			Текст.Прочитать(ПутьКФайлу, КодировкаТекста.UTF8);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует структуру из текста запроса без его выполнения.
//
// Параметры:
//   ТекстЗапроса - Строка
//
// Возвращаемое значение:
//   Структура - Имена полей соответствуют псевдонимам полей в тексте запроса.
//
Функция СтруктураПоТекстуЗапроса(ТекстЗапроса) Экспорт
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПоследнийЗапрос = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	Структура = Новый Структура;
	Для Каждого КолонкаСхемыЗапроса Из ПоследнийЗапрос.Колонки Цикл
		Структура.Вставить(КолонкаСхемыЗапроса.Псевдоним, КолонкаСхемыЗапроса.ТипЗначения.ПривестиЗначение(Неопределено));
	КонецЦикла;
	Возврат Структура;
КонецФункции

// Преобразует строку таблицы значений в структуру.
// Свойства структуры и их значения совпадают с колонками переданной строки.
//
// Параметры:
//  СтрокаТаблицыЗначений - СтрокаТаблицыЗначений - строка таблицы значений.
//
// Возвращаемое значение:
//  Структура - преобразованная строка таблицы значений.
//
Функция СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений) Экспорт
	
	Структура = Новый Структура;
	Для каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл
		Структура.Вставить(Колонка.Имя, СтрокаТаблицыЗначений[Колонка.Имя]);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

// Сканирует каталог с установленными версиями платформы и возвращает список версий.
//
// Параметры:
//   ШаблонКаталогаПлатформы - Неопределено - Полное имя каталога с параметром %ВерсияПлатформы%,
//       в котором расположены версии платформы. Если не указан, то значение будет получено из константы.
//
// Возвращаемое значение:
//   Массив из Строка - Найденные версии платформы.
//
Функция ДоступныеВерсииПлатформы(ШаблонКаталогаПлатформы = Неопределено) Экспорт
	
	СписокВерсий = Новый Массив;
	
	Если ШаблонКаталогаПлатформы = Неопределено Тогда
		ШаблонКаталогаПлатформы = КонвертацияХранилища.ШаблонКаталогаПлатформы(Неопределено);
	КонецЕсли;
	
	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
	
	Если ЭтоWindowsСервер Тогда
		ИмяИсполняемогоФайлаКонфигуратора = "1cv8.exe";
	Иначе
		ИмяИсполняемогоФайлаКонфигуратора = "1cv8";
	КонецЕсли;
	
	Если Найти(ШаблонКаталогаПлатформы, "%ВерсияПлатформы%") > 0 Тогда
	
		НачалоПутиКВерсиямПлатформыНаСервере = Лев(ШаблонКаталогаПлатформы, Найти(ШаблонКаталогаПлатформы, "%ВерсияПлатформы%")-1);
		ОкончаниеПутиКВерсиямПлатформыНаСервере = СтрЗаменить(ШаблонКаталогаПлатформы, НачалоПутиКВерсиямПлатформыНаСервере, "");
		ОкончаниеПутиКВерсиямПлатформыНаСервере = СтрЗаменить(ОкончаниеПутиКВерсиямПлатформыНаСервере, "%ВерсияПлатформы%", "");
		
		Для Каждого Файл Из НайтиФайлы(НачалоПутиКВерсиямПлатформыНаСервере, "*") Цикл
		
			Если Файл.ЭтоКаталог() Тогда
			
				ПолныйПуть = СтрЗаменить(ШаблонКаталогаПлатформы, "%ВерсияПлатформы%", Файл.Имя);
				ФайлКонфигуратора = Новый Файл(ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПолныйПуть) + ИмяИсполняемогоФайлаКонфигуратора);
				Если ФайлКонфигуратора.Существует() И ФайлКонфигуратора.ЭтоФайл() Тогда
				
					СписокВерсий.Добавить(Файл.Имя);
				
				КонецЕсли;
			
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат СписокВерсий;
	
КонецФункции

// Создает массив и помещает в него переданные значения.
//
// Параметры:
//  Значение1 - Произвольный - любое значение.
//  Значение2 - Произвольный
//  Значение3 - Произвольный
//  Значение4 - Произвольный
//
// Возвращаемое значение:
//  Массив
//  
// Пример:
//   Результат = ОбщегоНазначенияКлиентСервер.МассивЗначений(1, 2, 3);
//
Функция МассивЗначений(Знач Значение1, Знач Значение2 = Null, Знач Значение3 = Null, Знач Значение4 = Null) Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Значение1);
	Если Значение2 <> Null Тогда
		Результат.Добавить(Значение2);
	КонецЕсли;
	Если Значение3 <> Null Тогда
		Результат.Добавить(Значение3);
	КонецЕсли;
	Если Значение4 <> Null Тогда
		Результат.Добавить(Значение4);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Создает нерекурсивную копию структуры. Работает эффективнее чем другие методы копирования структуры.
Функция СкопироватьСтруктуру(Структура) Экспорт
	Возврат Новый Структура(Новый ФиксированнаяСтруктура(Структура));
КонецФункции

// Создает полную копию коллекции рекурсивно, с учетом типов дочерних элементов.
//   Допустимо передавать только значения, которые сериализуются в/из xml. Объектные типы не поддерживаются.
//
// Параметры:
//   Коллекция - Произвольный - Объект, который сериализуется в/из xml и который необходимо скопировать.
//
// Возвращаемое значение:
//   Произвольный - Копия объекта, переданного в параметре Источник.
//
Функция СкопироватьРекурсивно(Коллекция) Экспорт
	
	Возврат ЗначениеИзСтрокиXML(ЗначениеВСтрокуXML(Коллекция));
	
КонецФункции

#Область Коллекции

// Получает значение свойства. Если свойство отсутствует, то возвращает Неопределено.
//
// Параметры:
//   Коллекция - Произвольный.
//   Ключ - Строка - Имя свойства.
//   ЗначениеПоУмолчанию - Произвольный - Необязательный. Возвращается когда в коллекции нет значения по указанному
//       ключу или когда значение = Неопределено.
//
// Возвращаемое значение:
//   Произвольный - Значения свойства.
//
Функция ЗначениеСвойства(Коллекция, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Если Коллекция = Неопределено Или Не ЗначениеЗаполнено(Ключ) Тогда
		Возврат ЗначениеПоУмолчанию;
	ИначеЕсли ТипЗнч(Коллекция) = Тип("Структура") Тогда
		Результат = Неопределено;
		Если Не Коллекция.Свойство(Ключ, Результат) Тогда
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Коллекция) = Тип("Соответствие") Тогда
		Результат = Коллекция[Ключ];
	Иначе
		Структура = Новый Структура(Ключ);
		ЗаполнитьЗначенияСвойств(Структура, Коллекция);
		Результат = Структура[Ключ];
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	Иначе
		Возврат Результат;
	КонецЕсли;
КонецФункции

// Получает значение свойства. Если свойство отсутствует, то возвращает Неопределено.
//
// Параметры:
//   Объект - Произвольный
//   ПутьКСвойству - Строка - Путь к свойству. 
//       Например: "Оформление.Цвет" получит свойство "Цвет" свойства "Оформление" объекта.
//
// Возвращаемое значение:
//   Произвольный - Значения свойства.
//
Функция ЗначениеВложенногоСвойства(Объект, ПутьКСвойству) Экспорт
	Если Объект = Неопределено Или Не ЗначениеЗаполнено(ПутьКСвойству) Тогда
		Возврат Объект;
	КонецЕсли;
	МассивИмен = СтрРазделить(ПутьКСвойству, ".");
	ТекущийОбъект = Объект;
	Для Каждого ИмяРеквизита Из МассивИмен Цикл
		ТекущийОбъект = ЗначенияСвойств(ТекущийОбъект, ИмяРеквизита)[ИмяРеквизита];
	КонецЦикла;
	Возврат ТекущийОбъект;
КонецФункции

// Получает значения свойств. Если свойство отсутствует, то в значении будет Неопределено.
//
// Параметры:
//   Объект - Произвольный
//   ИменаСвойств - Строка - Имена получаемых свойств.
//
// Возвращаемое значение:
//   Структура - Значения свойств.
//
Функция ЗначенияСвойств(Объект, ИменаСвойств) Экспорт
	Структура = Новый Структура(ИменаСвойств);
	Если Объект <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Структура, Объект);
	КонецЕсли;
	Возврат Структура;
КонецФункции

#КонецОбласти

#Область ФайловаяСистема

// Добавляет к переданному пути каталога конечный символ-разделитель, если он отсутствует.
//
// Параметры:
//   ПолноеИмяКаталога - Строка - Полное имя каталога.
//
// Возвращаемое значение:
//   Строка - Полное имя каталога с конечным разделителем.
//
// Примеры использования:
//  Результат = ДобавитьКонечныйРазделительПути("C:\Мой каталог"); // возвращает "C:\Мой каталог\".
//  Результат = ДобавитьКонечныйРазделительПути("C:\Мой каталог\"); // возвращает "C:\Мой каталог\".
//  Результат = ДобавитьКонечныйРазделительПути("%APPDATA%"); // возвращает "%APPDATA%\"
//
Функция ДобавитьКонечныйРазделительПути(Знач ПолноеИмяКаталога) Экспорт
	Если ПолноеИмяКаталога = "" Тогда
		Возврат "";
	КонецЕсли;
	ДобавляемыйСимвол = ПолучитьРазделительПути();
	Если СтрЗаканчиваетсяНа(ПолноеИмяКаталога, ДобавляемыйСимвол) Тогда
		Возврат ПолноеИмяКаталога;
	Иначе
		Возврат ПолноеИмяКаталога + ДобавляемыйСимвол;
	КонецЕсли;
КонецФункции

// Удаляет в переданномм пути каталога конечный символ-разделитель, если он присутствует.
//
// Параметры:
//   ПолноеИмяКаталога - Строка - Полное имя каталога.
//
// Возвращаемое значение:
//   Строка - Полное имя каталога без конечного разделителя.
//
Функция УдалитьКонечныйРазделительПути(Знач ПолноеИмяКаталога) Экспорт
	Если ПолноеИмяКаталога = "" Тогда
		Возврат "";
	КонецЕсли;
	ДлинаСтроки = СтрДлина(ПолноеИмяКаталога);
	Пока Истина Цикл
		Код = КодСимвола(ПолноеИмяКаталога, ДлинаСтроки);
		Если Код = 47 Или Код = 92 Тогда
			ДлинаСтроки = ДлинаСтроки - 1;
		Иначе
			Возврат Лев(ПолноеИмяКаталога, ДлинаСтроки);
		КонецЕсли;
	КонецЦикла;
КонецФункции

// Проверяет существование файла.
Функция ФайлСуществует(ПолноеИмяФайла) Экспорт
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда
		Возврат Ложь;
	КонецЕсли;
	Файл = Новый Файл(ПолноеИмяФайла);
	Возврат Файл.Существует() И Не Файл.ЭтоКаталог();
КонецФункции

// Проверяет существование файла.
Функция КаталогСуществует(ПолноеИмяКаталога) Экспорт
	Если ПустаяСтрока(ПолноеИмяКаталога) Тогда
		Возврат Ложь;
	КонецЕсли;
	Файл = Новый Файл(ПолноеИмяКаталога);
	Возврат Файл.Существует() И Файл.ЭтоКаталог();
КонецФункции

Функция КаталогиНаОдномУстройстве(ПутьККаталогу1, ПутьККаталогу2) Экспорт
	МассивИмен1 = СтрРазделить(ПутьККаталогу1, "\/", Ложь);
	МассивИмен2 = СтрРазделить(ПутьККаталогу2, "\/", Ложь);
	Возврат МассивИмен1[0] = МассивИмен2[0]
		И ?(СтрНачинаетсяС(ПутьККаталогу1, "\\"), МассивИмен1[1] = МассивИмен2[1], Истина);
КонецФункции

Функция КаталогФайловойИБ() Экспорт
	Строка = СтрокаСоединенияИнформационнойБазы();
	Если СтрНачинаетсяС(ВРег(Строка), ВРег("File=""")) Тогда
		Возврат Сред(Строка, СтрДлина("File=""") + 1, СтрДлина(Строка) - СтрДлина("File=""") - 2);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция РодительскийКаталог(ПутьКФайлуИлиКаталогу) Экспорт
	Если ПутьКФайлуИлиКаталогу = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ФайлИлиКаталог = Новый Файл(ПутьКФайлуИлиКаталогу);
	Если ФайлИлиКаталог.Существует() Тогда
		Возврат ФайлИлиКаталог.Путь;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Канонизирует полное имя каталога. При необходимости, добавляет слеш и создает каталог.
//
// Параметры:
//   ПолноеИмя - Строка - Полное имя каталога.
//   КонечныйРазделительПути - Булево - Если Истина, то результат должен заканчиваться разделителем пути.
//       Если Ложь, то результат не должен заканчиваться разделителем пути.
//   Создавать - Булево - Создавать в случае отсутствия.
//
// Возвращаемое значение:
//   Строка - Настоящее полное имя каталога.
//
Функция ПолноеИмяКаталога(Знач ПолноеИмя, КонечныйРазделительПути, Создавать = Ложь) Экспорт
	Если ПустаяСтрока(ПолноеИмя) Тогда
		Возврат "";
	КонецЕсли;
	Каталог = Новый Файл(ПолноеИмя);
	Если Создавать И Не Каталог.Существует() Тогда
		ЗаписатьПримечание("ru = 'ОбщегоНазначения.ФайловаяСистема'",
			СтрШаблон("ru = 'Создание каталога ""%1""...'", Каталог.ПолноеИмя));
		СоздатьКаталог(Каталог.ПолноеИмя);
	КонецЕсли;
	Если КонечныйРазделительПути Тогда
		Возврат ДобавитьКонечныйРазделительПути(Каталог.ПолноеИмя);
	Иначе
		Возврат УдалитьКонечныйРазделительПути(Каталог.ПолноеИмя);
	КонецЕсли;
КонецФункции

Процедура ПроверитьКаталогСуществует(ПолноеИмя) Экспорт
	Если Не КаталогСуществует(ПолноеИмя) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Каталог ""%1"" не найден.'"), ПолноеИмя);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьФайлСуществует(ПолноеИмя) Экспорт
	Если Не ФайлСуществует(ПолноеИмя) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Файл ""%1"" не найден.'"), ПолноеИмя);
	КонецЕсли;
КонецПроцедуры

// Создает временный каталог. После окончания работы с временным каталогом его необходимо удалить 
// с помощью ОбщегоНазначения.УдалитьВременныйКаталог.
//
// Параметры:
//   Расширение - Строка - Расширение каталога, которое идентифицирует назначение временного каталога
//                         и подсистему, которая его создала.
//                         Рекомендуется указывать на английском языке.
//
// Возвращаемое значение:
//   Строка - Полный путь к каталогу с разделителем пути.
//
Функция СоздатьВременныйКаталог(Знач Расширение = "") Экспорт
	Возврат ПолноеИмяКаталога(ПолучитьИмяВременногоФайла(Расширение), Истина, Истина);
КонецФункции

// Удаляет временный каталог вместе с его содержимым, если возможно.
// Если временный каталог не может быть удален (например, он занят каким-то процессом),
// то в журнал регистрации записывается соответствующее предупреждение, а процедура завершается.
//
// Для совместного использования с ОбщегоНазначения.СоздатьВременныйКаталог, 
// после окончания работы с временным каталогом.
//
// Параметры:
//   ПутьККаталогу - Строка - Полный путь к временному каталогу.
//
Процедура УдалитьВременныйКаталог(Знач ПолноеИмя) Экспорт
	
	Если ЭтоИмяВременногоФайла(ПолноеИмя) Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверное значение параметра Путь в ФайловаяСистема.УдалитьВременныйКаталог:
				       |Каталог не является временным ""%1""'"), 
			ПолноеИмя);
	КонецЕсли;
	
	УдалитьФайлИлиКаталог(ПолноеИмя);
	
КонецПроцедуры

// Удаляет файл или каталог. Если файл не может быть удален (например, он занят каким-либо процессом),
// то в журнал регистрации записывается соответствующее предупреждение, а процедура завершается.
//
// Параметры:
//   ПолноеИмя - Строка - полный путь к временному файлу.
//
Функция УдалитьФайлИлиКаталог(Знач ПолноеИмя) Экспорт
	Файл = Новый Файл(ПолноеИмя);
	Если Не Файл.Существует() Тогда
		Возврат Истина;
	КонецЕсли;
	Файл = Неопределено;
	Попытка
		УдалитьФайлы(ПолноеИмя);
		Возврат Истина;
	Исключение
		ТекстОшибки = СтрШаблон(
			"ru = 'Не удалось удалить файл или каталог ""%1"" по причине:
			|%2'",
			ПолноеИмя,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписатьОшибку("ru = 'ОбщегоНазначения.ФайловаяСистема'", ТекстОшибки);
	КонецПопытки;
	Возврат Ложь;
КонецФункции

// Очищает каталог. Если каталог не может быть очищен (например, файлы заняты каким-либо процессом),
// то в журнал регистрации записывается соответствующее предупреждение, а процедура завершается.
//
// Параметры:
//   ПолноеИмяКаталога - Строка - Полное имя каталога.
//   СоздатьВСлучаеОтсутствия - Булево - Если Истина то в случае отсутствия будет создан пустой каталог.
//   ИсключениеПриОшибке - Булево - Если Истина то в случае ошибки будет поднято исключение.
//
Функция ОчиститьКаталог(Знач ПолноеИмяКаталога, Знач СоздатьВСлучаеОтсутствия = Ложь, Знач ИсключениеПриОшибке = Ложь) Экспорт
	
	// Возможно уже удален.
	Если Не КаталогСуществует(ПолноеИмяКаталога) Тогда
		Если СоздатьВСлучаеОтсутствия Тогда
			СоздатьКаталог(ПолноеИмяКаталога);
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	// Первая попытка.
	Попытка
		УдалитьФайлы(ПолноеИмяКаталога, "*");
		Возврат Истина;
	Исключение
		ТекстОшибки = НСтрШаблон("ru = 'Не удалось очистить каталог ""%1"" (попытка № 1) по причине:
			|%2'",
			ПолноеИмяКаталога,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписатьПредупреждение("ru = 'ОбщегоНазначения.ФайловаяСистема'", ТекстОшибки);
	КонецПопытки;
	
	// Вторая попытка.
	Попытка
		// Снятие атрибута ТолькоЧтение.
		Найденные = НайтиФайлы(ПолноеИмяКаталога, "*", Истина);
		Для Каждого Файл Из Найденные Цикл
			Файл.УстановитьТолькоЧтение(Ложь);
		КонецЦикла;
		// Очистка каталога.
		УдалитьФайлы(ПолноеИмяКаталога, "*");
		Возврат Истина;
	Исключение
		ТекстОшибки = НСтрШаблон("ru = 'Не удалось очистить каталог ""%1"" (попытка № 2) по причине:
			|%2'",
			ПолноеИмяКаталога,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Если ИсключениеПриОшибке Тогда
			ВызватьИсключение ТекстОшибки;
		Иначе
			ЗаписатьОшибку("ru = 'ОбщегоНазначения.ФайловаяСистема'", ТекстОшибки);
		КонецЕсли;
	КонецПопытки;
	
	Возврат Ложь;
КонецФункции

// Возвращает Истина если переданное полное имя - имя временного файла.
Функция ЭтоИмяВременногоФайла(Путь) Экспорт
	
	// Ожидается, что Путь получен методом ПолучитьИмяВременногоФайла().
	// Перед проверкой разворачиваем слэши в одну сторону.
	Возврат Не СтрНачинаетсяС(СтрЗаменить(Путь, "/", "\"), СтрЗаменить(КаталогВременныхФайлов(), "/", "\"));
	
КонецФункции

// Возвращает хеш-сумму файла.
Функция ХешФайла(ПолноеИмя) Экспорт
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.CRC32);
	ХешированиеДанных.ДобавитьФайл(ПолноеИмя);
	Возврат СтроковыеФункции.УбратьПробелы(Строка(ХешированиеДанных.ХешСумма));
КонецФункции

// Возвращает полное имя указанного системного каталога.
//
// Параметры:
//   Номер - Число - Номер типа каталога.
//       См. https://learn.microsoft.com/ru-ru/windows/win32/shell/shell-namespace.
//       Например, 26 - APPDATA, 28 - LOCALAPPDATA.
//
// Возвращаемое значение:
//   Строка - Полно имя каталога.
//
Функция СистемныйКаталог(Номер) Экспорт
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		Application = Новый COMОбъект("Shell.Application");
		Возврат Application.Namespace(Номер).Self.Path;
	Иначе
		Возврат КаталогВременныхФайлов();
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ЖурналРегистрации

// Записывает событие в журнал регистрации.
//
// Параметры:
//   Уровень - Число, Строка, УровеньЖурналаРегистрации - Уровень критичности события.
//   ИмяСобытия - Строка - Имя события журнала. Передается в формате 1го параметра функции НСтр.
//   ТекстЖурнала - Строка - Текст для записи в журнал.
//   Объект - ОбъектМетаданных, ЛюбаяСсылка, ЛюбойОбъект, Неопределено - Объект соответствующий контексту события.
//
Процедура ЗаписатьВЖурнал(Знач Уровень, ИмяСобытия = "", Знач ТекстЖурнала = "", Знач Объект = Неопределено) Экспорт
	
	КодЯзыкаЖурнала = Метаданные.ОсновнойЯзык.КодЯзыка;
	
	УровеньЖурнала = УровеньЖурнала(Уровень);
	
	Если Объект = Неопределено Тогда
		ОбъектДанных = СокрП(СтрПолучитьСтроку(ТекстЖурнала, 1));
		ОбъектМетаданных = Неопределено;
	ИначеЕсли ТипЗнч(Объект) = Тип("ОбъектМетаданных") Тогда
		ОбъектДанных = СокрП(СтрПолучитьСтроку(ТекстЖурнала, 1));
		ОбъектМетаданных = Объект;
	Иначе
		ОбъектДанных = Объект;
		ОбъектМетаданных = ОбъектДанных.Метаданные();
	КонецЕсли;
	
	Если ИмяСобытия = "" Тогда
		Если ОбъектМетаданных <> Неопределено Тогда
			ИмяСобытияЖурнала = ОбъектМетаданных.ПолноеИмя();
		Иначе
			ИмяСобытияЖурнала = НСтр("ru = 'Не определено'", КодЯзыкаЖурнала);
			ЗаписатьОшибку("ru = 'ОбщегоНазначения.ЖурналРегистрации'",
				СтрШаблон("ru = 'Ошибка при вызове процедуры ЗаписатьВЖурнал(): параметр ИмяСобытия не заполнен.'",
				ИмяСобытия));
		КонецЕсли;
	Иначе
		ИмяСобытияЖурнала = НСтр(ИмяСобытия, КодЯзыкаЖурнала);
		Если ИмяСобытияЖурнала = "" И ИмяСобытия <> "" Тогда
			ИмяСобытияЖурнала = ИмяСобытия;
			ЗаписатьОшибку("ru = 'ОбщегоНазначения.ЖурналРегистрации'",
				СтрШаблон("ru = 'Ошибка при вызове процедуры ЗаписатьВЖурнал(): в параметр ИмяСобытия передано значение ""%1"", которое не может быть использовано в функции НСтр.'",
				ИмяСобытия));
		КонецЕсли;
	КонецЕсли;
	
	ИмяСобытия = ИмяСобытияЖурнала; // Возврат значения.
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурнала,
		УровеньЖурнала,
		ОбъектМетаданных,
		ОбъектДанных,
		ТекстЖурнала);
	
КонецПроцедуры

// Регистрирует ошибку в журнале регистрации.
//
// Параметры:
//   ИмяСобытия - Строка - Имя события журнала. Передается в формате 1го параметра функции НСтр.
//   Текст - Строка, ИнформацияОбОшибке - Текст или информация об ошибке для записи в журнал.
//   Объект - ОбъектМетаданных, ЛюбаяСсылка, ЛюбойОбъект, Неопределено - Объект соответствующий контексту события.
//
Процедура ЗаписатьОшибку(Знач ИмяСобытия = "", Знач Текст = "", Знач Объект = Неопределено) Экспорт
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка, ИмяСобытия, ТекстЖурнала(Текст), Объект);
КонецПроцедуры

// Регистрирует предупреждение в журнале регистрации.
//
// Параметры:
//   ИмяСобытия - Строка - Имя события журнала. Передается в формате 1го параметра функции НСтр.
//   Текст - Строка, ИнформацияОбОшибке - Текст или информация об ошибке для записи в журнал.
//   Объект - ОбъектМетаданных, ЛюбаяСсылка, ЛюбойОбъект, Неопределено - Объект соответствующий контексту события.
//
Процедура ЗаписатьПредупреждение(Знач ИмяСобытия = "", Знач Текст = "", Знач Объект = Неопределено) Экспорт
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Предупреждение, ИмяСобытия, ТекстЖурнала(Текст), Объект);
КонецПроцедуры

// Регистрирует информацию в журнале регистрации.
//
// Параметры:
//   ИмяСобытия - Строка - Имя события журнала. Передается в формате 1го параметра функции НСтр.
//   Текст - Строка, ИнформацияОбОшибке - Текст или информация об ошибке для записи в журнал.
//   Объект - ОбъектМетаданных, ЛюбаяСсылка, ЛюбойОбъект, Неопределено - Объект соответствующий контексту события.
//
Процедура ЗаписатьИнформацию(Знач ИмяСобытия = "", Знач Текст = "", Знач Объект = Неопределено) Экспорт
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Информация, ИмяСобытия, ТекстЖурнала(Текст), Объект);
КонецПроцедуры

// Регистрирует примечание в журнале регистрации.
//
// Параметры:
//   ИмяСобытия - Строка - Имя события журнала. Передается в формате 1го параметра функции НСтр.
//   Текст - Строка, ИнформацияОбОшибке - Текст или информация об ошибке для записи в журнал.
//   Объект - ОбъектМетаданных, ЛюбаяСсылка, ЛюбойОбъект, Неопределено - Объект соответствующий контексту события.
//
Процедура ЗаписатьПримечание(Знач ИмяСобытия = "", Знач Текст = "", Знач Объект = Неопределено) Экспорт
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Примечание, ИмяСобытия, ТекстЖурнала(Текст), Объект);
КонецПроцедуры

// Превращает строковый или числовой уровень критичности события в уровень журнала регистрации.
//
// Параметры:
//   Уровень - Число, Строка, УровеньЖурналаРегистрации - Уровень критичности события.
//
// Возвращаемое значение:
//   УровеньЖурналаРегистрации
//
Функция УровеньЖурнала(Знач Уровень) Экспорт
	Если ТипЗнч(Уровень) = Тип("УровеньЖурналаРегистрации") Тогда
		Возврат Уровень;
	ИначеЕсли Уровень = 1 Тогда
		Возврат УровеньЖурналаРегистрации.Ошибка;
	ИначеЕсли Уровень = 2 Тогда
		Возврат УровеньЖурналаРегистрации.Предупреждение;
	ИначеЕсли Уровень = 3 Тогда
		Возврат УровеньЖурналаРегистрации.Информация;
	ИначеЕсли Уровень = 4 Тогда
		Возврат УровеньЖурналаРегистрации.Примечание;
	Иначе
		Возврат УровеньЖурналаРегистрации[Уровень];
	КонецЕсли;
КонецФункции

// Превращает текст или информацию об ошибке в строку для записи в журнал регистрации.
//
// Параметры:
//   Текст - Строка, ИнформацияОбОшибке - Текст или информация об ошибке для записи в журнал.
//
// Возвращаемое значение:
//   Строка
//
Функция ТекстЖурнала(Текст) Экспорт
	Если ТипЗнч(Текст) = Тип("ИнформацияОбОшибке") Тогда
		Возврат ПодробноеПредставлениеОшибки(Текст);
	ИначеЕсли Текст = "" Тогда
		Возврат "";
	КонецЕсли;
	Результат = НСтр(СокрЛП(Текст), Метаданные.ОсновнойЯзык.КодЯзыка);
	Если Результат = "" Тогда
		Результат = СокрЛП(Текст);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция НСтрШаблон(Знач Шаблон, Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено) Экспорт
	
	Результат = НСтр(Шаблон, Метаданные.ОсновнойЯзык.КодЯзыка);
	Если Результат = "" Тогда
		Результат = Шаблон;
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "%1", Параметр1);
	Результат = СтрЗаменить(Результат, "%2", Параметр2);
	Результат = СтрЗаменить(Результат, "%3", Параметр3);
	Результат = СтрЗаменить(Результат, "%4", Параметр4);
	Результат = СтрЗаменить(Результат, "%5", Параметр5);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Лог

// Формирует полное имя файла лога конвертации хранилища
//
// Параметры:
//   ПолноеИмяКаталога - Строка - Каталог выгрузки версий хранилища.
//   СостояниеИлиИмяОперации - Строка, ПеречислениеСсылка.СостоянияВерсии - Имя типа операции, которое будет использоваться как префикс файла.
//
// Возвращаемое значение:
//   Строка - Полное имя файла лога.
//
Функция ИмяФайлаЛога(Знач ПолноеИмяКаталога, Знач ПрефиксИмениФайла) Экспорт
	Возврат ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПолноеИмяКаталога) + ПрефиксИмениФайла + "_log.txt";
КонецФункции

// Записывает событие в журнал регистрации и в лог-файл.
//
// Параметры:
//   ИмяФайлаЛога - Строка - Полное имя файла лога. См. ОбщегоНазначения.ИмяФайлаЛога.
//   Уровень - Число, Строка, УровеньЖурналаРегистрации - Уровень критичности события.
//   ИмяСобытия - Строка - Имя события журнала. Передается в формате 1го параметра функции НСтр.
//   Текст - Строка, ИнформацияОбОшибке - Текст или информация об ошибке для записи в журнал.
//   Объект - ОбъектМетаданных, ЛюбаяСсылка, ЛюбойОбъект, Неопределено - Объект соответствующий контексту события.
//   Процент - Число, Неопределено - Количество процентов текущего фонового задания. Если заполнено,
//       то вызвается ДлительныеОперации.СообщитьПрогресс(Процент, Текст).
//
Процедура ЗаписатьВЛог(Знач ИмяФайлаЛога, Знач Уровень, Знач ИмяСобытия, Знач Текст,
	Знач Объект = Неопределено, Знач Процент = Неопределено, Знач Кодировка = Неопределено) Экспорт
	УровеньЖурнала = УровеньЖурнала(Уровень);
	ТекстЖурнала = ТекстЖурнала(Текст);
	
	ЗаписатьВЖурнал(УровеньЖурнала, ИмяСобытия, ТекстЖурнала, Объект);
	
	Если ЗначениеЗаполнено(ИмяФайлаЛога) Тогда
		ЗаписатьВФайлЛога(ИмяФайлаЛога, УровеньЖурнала, ИмяСобытия, ТекстЖурнала, Кодировка);
	КонецЕсли;
	Если ТипЗнч(Процент) = Тип("Число") Тогда
		ДлительныеОперации.СообщитьПрогресс(Процент, ТекстЖурнала);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьВФайлЛога(ИмяФайлаЛога, УровеньЖурнала, ИмяСобытия, ТекстЖурнала, Кодировка)
	Начало = "[" + Формат(ТекущаяДатаСеанса(), "ДФ=HH:mm:ss") + "] [" + ВРег(УровеньЖурнала) + "] ";
	Отступ = "    ";
	Окончание = " (" + ИмяСобытия + ")";
	
	Дописывать = ФайлСуществует(ИмяФайлаЛога);
	Если Дописывать Тогда
		Начало = Символы.ПС + Начало;
	КонецЕсли;
	ТекстЛога = Начало + СтрЗаменить(ТекстЖурнала, Символы.ПС, Символы.ПС + Отступ) + Окончание;
	
	Если Кодировка = Неопределено Тогда
		Лог = Новый ЗаписьТекста(ИмяФайлаЛога, , , Дописывать);
	Иначе
		Лог = Новый ЗаписьТекста(ИмяФайлаЛога, Кодировка, , Дописывать);
	КонецЕсли;
	Лог.ЗаписатьСтроку(ТекстЛога);
	Лог.Закрыть();
	Лог = Неопределено;
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ВыполнитьВФоне(Ключ, ИмяМетода, Представление, Параметр1, Параметр2 = Null, Параметр3 = Null) Экспорт
	Отбор = Новый Структура();
	Отбор.Вставить("Ключ", Ключ);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	Отбор.Вставить("ИмяМетода", ИмяМетода);
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если МассивФоновыхЗаданий.Количество() > 0 Тогда
		Возврат МассивФоновыхЗаданий[0];
	КонецЕсли;
	
	Параметры = ОбщегоНазначения.МассивЗначений(Параметр1, Параметр2, Параметр3);
	Возврат ФоновыеЗадания.Выполнить(ИмяМетода, Параметры, Ключ, Лев(Представление, 120));
КонецФункции

#Область ОбработкаСобытийПриложения

// Выполняет стандартные действия перед началом работы пользователя.
Процедура ПередНачаломРаботыСистемы(ПараметрыПриложения = Неопределено) Экспорт
	
	Если ПараметрыПриложения <> Неопределено Тогда
		ПараметрыКлиентаНаСервере = Новый Соответствие(ПараметрыСеанса.ПараметрыКлиентаНаСервере);
		Для Каждого КлючИЗначение Из ПараметрыПриложения Цикл
			ПараметрыКлиентаНаСервере.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(ПараметрыКлиентаНаСервере);
	КонецЕсли;
	
	Если НеобходимоОбновлениеИБ() Тогда
		ОбновитьИБ();
		Константы.ВерсияДанныхИБ.Установить(Метаданные.Версия);
		ПараметрыПриложения.Вставить("ВыполненоОбновлениеИБ", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИБ

// Возвращает Истина если необходимо обновление данных информационной базы при смене версии конфигурации.
Функция НеобходимоОбновлениеИБ() Экспорт
	
	Возврат Метаданные.Версия <> Константы.ВерсияДанныхИБ.Получить()
		Или СтрНайти(
			НРег(ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("ПараметрЗапуска")),
			НРег("ЗапуститьОбновлениеИнформационнойБазы")) > 0;
	
КонецФункции

Процедура ОбновитьИБ(ВерсияС = Неопределено, ВерсияПо = Неопределено) Экспорт
	КонвертацияОстановленаДо = Константы.КонвертацияОстановлена.Получить();
	Константы.КонвертацияОстановлена.Установить(Истина);
	
	Если ВерсияС = Неопределено Тогда
		ВерсияС = Константы.ВерсияДанныхИБ.Получить();
	КонецЕсли;
	Если ВерсияПо = Неопределено Тогда
		ВерсияПо = Метаданные.Версия;
	КонецЕсли;
	Если ВерсияЧислом(ВерсияС) <= ВерсияЧислом("2.0.1.1") И ВерсияЧислом("2.0.1.1") <= ВерсияЧислом(ВерсияПо) Тогда
		Справочники.ХранилищаКонфигураций.ЗаполнитьПредставленияРасписаний();
		Справочники.ОчередиВыполнения.ЗаполнитьПредставленияРасписаний();
		Справочники.КопииХранилищКонфигурации.ЗаполнитьПредставленияРасписаний();
	КонецЕсли;
	
	Константы.КонвертацияОстановлена.Установить(КонвертацияОстановленаДо);
КонецПроцедуры

// Преобразует строковое представление версии в числовое.
Функция ВерсияЧислом(СтрокаВерсии, КоличествоРазрядов = 4, МножительРазрядов = 10000) Экспорт
	Если Не ЗначениеЗаполнено(СтрокаВерсии) Тогда
		Возврат 0;
	КонецЕсли;
	Результат = 0;
	Фрагменты = СтрРазделить(СтрокаВерсии, ".");
	Разряд = 0;
	Для Каждого ФрагментВерсии Из Фрагменты Цикл
		Результат = Результат * МножительРазрядов + Число(ФрагментВерсии);
		Разряд = Разряд + 1;
	КонецЦикла;
	Если Разряд <> КоличествоРазрядов Тогда
		Результат = Результат / Pow(МножительРазрядов, Разряд - КоличествоРазрядов);
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Работа_с_DOM_и_XPath

// На основании XML получает структуру с документом DOM и разыменователем пространств имен DOM.
//   Полученную структуру можно передавать в другие методы модуля в качестве параметра СтруктураDOM.
//
// Параметры:
//   ПолноеИмяФайлаXML - Строка - Полное имя файла в формате XML.
//
// Возвращаемое значение:
//   Структура - Информация о документе DOM.
//       * ДокументDOM - ДокументDOM
//       * Разыменователь - РазыменовательПространствИменDOM
//       * ПолноеИмяФайлаXML - Строка
//       * ДокументИзменен - Булево - Ложь
//
Функция СтруктураDOM(ПолноеИмяФайлаXML) Экспорт
	Если Не ЭтоФайлXML(ПолноеИмяФайлаXML) Тогда
		Возврат Неопределено;
	КонецЕсли;
	СтруктураDOM = Новый Структура;
	СтруктураDOM.Вставить("ДокументDOM", ДокументDOM(ПолноеИмяФайлаXML));
	СтруктураDOM.Вставить("Разыменователь", Новый РазыменовательПространствИменDOM(СтруктураDOM.ДокументDOM));
	СтруктураDOM.Вставить("ПолноеИмяФайлаXML", ПолноеИмяФайлаXML);
	Возврат СтруктураDOM;
КонецФункции

// Возвращает Истина если указанный файл является файлом XML.
Функция ЭтоФайлXML(ПолноеИмяФайлаXML) Экспорт
	Если Не ФайлСуществует(ПолноеИмяФайлаXML) Тогда
		Возврат Ложь;
	КонецЕсли;
	ЧтениеXML = Новый ЧтениеXML;
	Попытка
		ЧтениеXML.ОткрытьФайл(ПолноеИмяФайлаXML);
		ЧтениеXML.ПерейтиКСодержимому();
		ЧтениеXML.Закрыть();
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции

// На основании XML получает документ DOM.
//
// Параметры:
//   ПолноеИмяФайлаXML - Строка - Полное имя файла в формате XML.
//
// Возвращаемое значение:
//   ДокументDOM
//
Функция ДокументDOM(ПолноеИмяФайлаXML) Экспорт
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПолноеИмяФайлаXML);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	Возврат ДокументDOM;
КонецФункции

// Записывает документ DOM в файл.
//
// Параметры:
//   ДокументDOM - ДокументDOM - См. функцию ДокументDOM.
//   ИмяФайла - Строка
//
Процедура ЗаписатьДокументDOM(ДокументDOM, ИмяФайла) Экспорт
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайла);
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
КонецПроцедуры

// Находит узел документа DOM используя выражение XPath.
//
// Параметры:
//   СтруктураDOM - Структура - См. СтруктураDOM.
//   ВыражениеXPath - Строка - См. в синтакс-помощнике "ДокументDOM.ВычислитьВыражениеXPath", параметр "Выражение".
//   ЭлементDOM - Произвольный - Элемент документа, в контексте которого выполняется поиск.
//       См. в синтакс-помощнике "ДокументDOM.ВычислитьВыражениеXPath", параметр "УзелКонтекста".
//
// Возвращаемое значение:
//   Неопределено - Если элемент не найден.
//   ЭлементDOM, Произвольный - См. в синтакс-помощнике "РезультатXPath.ПолучитьСледующий", возвращаемое значение.
//
Функция НайтиУзелDOM(Знач СтруктураDOM, Знач ВыражениеXPath, Знач ЭлементDOM = Неопределено) Экспорт
	Возврат ВычислитьВыражениеXPath(СтруктураDOM, ВыражениеXPath, ЭлементDOM).ПолучитьСледующий();
КонецФункции

// Находит узел документа DOM используя выражение XPath.
//
// Параметры:
//   СтруктураDOM - Структура - См. СтруктураDOM.
//   ЛокальноеИмя - Строка - Имя элемента или маска имени. Допускается использование предопределенного шаблона '*'.
//
// Возвращаемое значение:
//   Неопределено - Если элемент не найден.
//   ЭлементDOM, Произвольный - См. в синтакс-помощнике "СписокЭлементовDOM", элементы коллекции.
//
Функция НайтиУзелDOMПоИмени(Знач СтруктураDOM, Знач ЛокальноеИмя) Экспорт
	СписокЭлементовDOM = СтруктураDOM.ДокументDOM.ПолучитьЭлементыПоИмени("*", ЛокальноеИмя);
	Возврат ?(СписокЭлементовDOM.Количество() > 0, СписокЭлементовDOM[0], Неопределено);
КонецФункции

// Вычисляет выражение XPath для документа DOM.
//
// Параметры:
//   СтруктураDOM - Структура - См. СтруктураDOM.
//   ВыражениеXPath - Строка - См. в синтакс-помощнике "ДокументDOM.ВычислитьВыражениеXPath", параметр "Выражение".
//   ЭлементDOM - Произвольный - Элемент документа, в контексте которого выполняется поиск.
//       См. в синтакс-помощнике "ДокументDOM.ВычислитьВыражениеXPath", параметр "УзелКонтекста".
//
// Возвращаемое значение:
//   РезультатXPath - См. в синтакс-помощнике "ДокументDOM.ВычислитьВыражениеXPath".
//
Функция ВычислитьВыражениеXPath(Знач СтруктураDOM, Знач ВыражениеXPath, Знач ЭлементDOM = Неопределено) Экспорт
	Если ЭлементDOM = Неопределено Тогда
		ЭлементDOM = СтруктураDOM.ДокументDOM;
	КонецЕсли;
	Возврат СтруктураDOM.ДокументDOM.ВычислитьВыражениеXPath(ВыражениеXPath, ЭлементDOM, СтруктураDOM.Разыменователь);
КонецФункции

// Возвращает массив имен языков конфигурации.
//
// Параметры:
//   СтруктураDOM - Структура - Объект корня конфигурации полученный методом СтруктураDOM.
//
// Возвращаемое значение:
//   Массив из Строка - Массив имен языков конфигурации.
//
Функция ИменаЯзыковКонфигурацииXML(Знач СтруктураDOM) Экспорт
	МассивИмен = Новый Массив;
	Выражение = "/xmlns:MetaDataObject/xmlns:Configuration/xmlns:ChildObjects/xmlns:Language";
	РезультатXPath = ВычислитьВыражениеXPath(СтруктураDOM, Выражение);
	Пока Истина Цикл
		Язык_ЭлементDOM = РезультатXPath.ПолучитьСледующий();
		Если Язык_ЭлементDOM = Неопределено Тогда
			Прервать;
		КонецЕсли;
		МассивИмен.Добавить(Язык_ЭлементDOM.ТекстовоеСодержимое);
	КонецЦикла;
	Возврат МассивИмен;
КонецФункции

// Возвращает версию конфигурации.
//
// Параметры:
//   СтруктураDOM - Структура - Объект корня конфигурации полученный методом СтруктураDOM.
//
// Возвращаемое значение:
//   Массив из Строка - Массив имен языков конфигурации.
//
Функция ВерсияКонфигурацииXML(СтруктураDOM) Экспорт
	// Формат 1С XML - файл Configuration.xml.
	Выражение = "//*[local-name()='Configuration']/*[local-name()='Properties']/*[local-name()='Version']";
	УзелВерсии = НайтиУзелDOM(СтруктураDOM, Выражение);
	Если УзелВерсии = Неопределено Тогда
		// Формат EDT - файл Configuration\Configuration.mdo.
		Выражение = "/*[local-name()='Configuration']/*[local-name()='version']";
		УзелВерсии = НайтиУзелDOM(СтруктураDOM, Выражение);
	КонецЕсли;
	Если УзелВерсии = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат СокрЛП(УзелВерсии.ТекстовоеСодержимое);
КонецФункции

#КонецОбласти

#Область XML

// Возвращает Истина если указанный ТипДанныхXML принадлежит объекту (СправочникОбъект, ДокументОбъект, ...).
Функция ЭтоТипОбъекта(ТипДанныхXML) Экспорт
	Возврат ТипДанныхXML <> Неопределено И СтрНайти(ТипДанныхXML.ИмяТипа, "Object.") > 0;
КонецФункции

// Возвращает Истина если указанный ТипДанныхXML принадлежит ссылке объекта (СправочникСсылка, ДокументСсылка, ...).
Функция ЭтоТипСсылки(ТипДанныхXML) Экспорт
	Возврат ТипДанныхXML <> Неопределено И СтрНайти(ТипДанныхXML.ИмяТипа, "Ref.") > 0;
КонецФункции

#КонецОбласти

#Область СозданиеСообщенийПользователю

// Сообщает об ошибке заполнения в реквизите объекта и включает флажок Отказ.
//
// Параметры:
//   Отказ        - Булево        - Флажок отказа, который включается в данной процедуре.
//   Объект       - ЛюбаяСсылка,
//                  ЛюбойОбъект   - Объект, в котором обнаружена ошибка.
//   Текст        - Строка        - Текст ошибки.
//   ИмяРеквизита - Строка        - Имя реквизита, в котором обнаружена ошибка.
//
Процедура СообщитьОбОшибкеВОбъекте(Отказ, Объект, Текст, ИмяРеквизита = "") Экспорт
	Отказ = Истина;
	СообщитьОПроблеме(Текст, Объект, ИмяРеквизита);
КонецПроцедуры

// Выводит сообщение предупреждающее о проблеме связанной с указанным полем объекта.
//
// Параметры:
//   Текст  - Строка                   - Текст сообщения.
//   Объект - ЛюбаяСсылка, ЛюбойОбъект - Объект, в котором обнаружена проблема.
//   Поле   - Строка                   - Полное имя реквизита, в котором обнаружена проблема.
//
Процедура СообщитьОПроблеме(Текст, Объект = Неопределено, Поле = "") Экспорт
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Поле = Поле;
	
	Если Объект <> Неопределено Тогда
		ТипДанныхXML = XMLТипЗнч(Объект);
		Если ЭтоТипОбъекта(ТипДанныхXML) Тогда
			Сообщение.УстановитьДанные(Объект);
		ИначеЕсли ЭтоТипСсылки(ТипДанныхXML) Тогда
			Сообщение.КлючДанных = Объект;
		КонецЕсли;
	КонецЕсли;
	
	Сообщение.Сообщить();
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область IniФайлы

Функция ТаблицаИзIniФайла(ПолноеИмяФайла, Кодировка = Неопределено, ИменаДополнительныхКолонок = Неопределено) Экспорт
	Перем Ключ, Значение, ИмяКолонки;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Секция", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СекцияНРег", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Содержимое", Новый ОписаниеТипов("Строка"));
	
	ЕстьДополнительныеКолонки = (ИменаДополнительныхКолонок <> Неопределено);
	Если ЕстьДополнительныеКолонки Тогда
		Для Каждого КлючИЗначение Из ИменаДополнительныхКолонок Цикл
			Результат.Колонки.Добавить(КлючИЗначение.Значение, Новый ОписаниеТипов("Строка"));
		КонецЦикла;
	КонецЕсли;
	
	Если Не ФайлСуществует(ПолноеИмяФайла) Тогда
		Возврат Результат;
	КонецЕсли;
	ФайловыйПоток = ФайловыеПотоки.ОткрытьДляЧтения(ПолноеИмяФайла);
	Если Кодировка = Неопределено Тогда
		Кодировка = КодировкаBOM(ФайловыйПоток);
		Если Кодировка = Неопределено Тогда
			Кодировка = "UTF-8";
		КонецЕсли;
	КонецЕсли;
	ФайловыйПоток.СброситьБуферы();
	ЧтениеТекста = Новый ЧтениеТекста(ФайловыйПоток, Кодировка);
	ТекущаяСекция = Неопределено;
	НомерСтроки = 0;
	Порядок = 0;
	Пока Истина Цикл
		СтрокаТекста = ЧтениеТекста.ПрочитатьСтроку();
		Если СтрокаТекста = Неопределено Тогда
			Прервать;
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
		СтрокаТекста = СокрЛП(СтрокаТекста);
		
		Если Лев(СтрокаТекста, 1) = "[" И Прав(СтрокаТекста, 1) = "]" Тогда
			Порядок = Порядок + 1;
			ТекущаяСекция = Результат.Добавить();
			ТекущаяСекция.Секция = СокрЛП(Сред(СтрокаТекста, 2, СтрДлина(СтрокаТекста) - 2));
			ТекущаяСекция.СекцияНРег = НРег(ТекущаяСекция.Секция);
			ТекущаяСекция.Порядок = Порядок;
			ТекущаяСекция.НомерСтроки = НомерСтроки;
			ТекущаяСекция.Содержимое = СтрокаТекста;
			Продолжить;
		ИначеЕсли ТекущаяСекция = Неопределено Тогда
			// Нулевая секция при необходимости.
			Если СтрокаТекста = "" Тогда
				Продолжить;
			КонецЕсли;
			ТекущаяСекция = Результат.Добавить(); // Секция = "", Порядок = 0, НомерСтроки = 1.
			ТекущаяСекция.Содержимое = СтрокаТекста;
			ТекущаяСекция.НомерСтроки = НомерСтроки;
			Продолжить;
		КонецЕсли;
		
		ТекущаяСекция.Содержимое = ТекущаяСекция.Содержимое + Символы.ПС + СтрокаТекста;
		
		Если ЕстьДополнительныеКолонки
			И СтрокаТекста <> ""
			И Лев(СтрокаТекста, 1) <> ";"
			И Лев(СтрокаТекста, 1) <> "#" Тогда
			Позиция = Найти(СтрокаТекста, "=");
			Если Позиция > 0 Тогда
				ИмяПараметра = Лев(СтрокаТекста, Позиция - 1);
				Если ИменаДополнительныхКолонок.Свойство(ИмяПараметра, ИмяКолонки) Тогда
					ТекущаяСекция[ИмяКолонки] = Сред(СтрокаТекста, Позиция + 1);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Процедура ТаблицаВIniФайл(Таблица, ПолноеИмяФайла, Кодировка, ЗаписатьBOM = Истина) Экспорт
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Не КаталогСуществует(Файл.Путь) Тогда
		СоздатьКаталог(Файл.Путь);
	КонецЕсли;
	ЗаписьТекста = Новый ЗаписьТекста(ПолноеИмяФайла, Кодировка, , , ЗаписатьBOM);
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		ЗаписьТекста.Записать(СтрокаТаблицы.Содержимое + Символы.ПС);
	КонецЦикла;
	ЗаписьТекста.Закрыть();
КонецПроцедуры

Процедура УдалитьСекциюIniФайла(ПолноеИмяФайла, Знач Секция, Кодировка, ЗаписатьBOM) Экспорт
	Если Не ФайлСуществует(ПолноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	Если Не СтрНачинаетсяС(Секция, "[") Тогда
		Секция = "[" + Секция;
	КонецЕсли;
	Если Не СтрЗаканчиваетсяНа(Секция, "]") Тогда
		Секция = Секция + "]";
	КонецЕсли;
	ТекстФайла = СтроковыеФункции.СтрокаИзФайла(ПолноеИмяФайла, Кодировка);
	Позиция1 = СтрНайти(ТекстФайла, Секция);
	Если Позиция1 = 0 Тогда
		Возврат;
	КонецЕсли;
	Позиция2 = СтрНайти(ТекстФайла, "[", , Позиция1 + СтрДлина(Секция) + 1);
	Если Позиция2 = 0 Тогда
		Если Позиция1 = 1 Тогда
			ТекстФайла = "";
		Иначе
			ТекстФайла = СокрЛП(Лев(ТекстФайла, Позиция1 - 1));
		КонецЕсли;
	Иначе
		Если Позиция1 = 1 Тогда
			ТекстФайла = СокрЛП(Сред(ТекстФайла, Позиция2));
		Иначе
			ТекстФайла = СокрЛП(Лев(ТекстФайла, Позиция1 - 1)) + Символы.ПС + СокрЛП(Сред(ТекстФайла, Позиция2));
		КонецЕсли;
	КонецЕсли;
	СтроковыеФункции.СтрокаВФайл(ТекстФайла, ПолноеИмяФайла, Кодировка, Ложь, ЗаписатьBOM);
КонецПроцедуры

#КонецОбласти

#Область Кодировки

// Возвращает кодировку BOM файла.
//
// Параметры:
//   ДанныеФайла - ДвоичныеДанные, Строка, Поток, ПотокВПамяти, ФайловыйПоток - Данные файла.
//       В типе Строка может быть передано только полное имя файла.
//
// Возвращаемое значение:
//   Строка - Кодировка текста, либо пустая строка, если в файле отсутствует сигнатура XML.
//
Функция КодировкаXML(ДанныеФайла) Экспорт
	// Список кодировок XML см. в https://msdn.microsoft.com/en-us/library/dd317756.aspx
	Если ТипЗнч(ДанныеФайла) = Тип("ДвоичныеДанные") Тогда
		БуферДвоичныхДанных = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДанныеФайла);
		ПотокВПамяти = Новый ПотокВПамяти(БуферДвоичныхДанных);
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьПоток(ПотокВПамяти);
	ИначеЕсли ТипЗнч(ДанныеФайла) = Тип("Строка") Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ДанныеФайла);
	ИначеЕсли ТипЗнч(ДанныеФайла) = Тип("Поток")
		Или ТипЗнч(ДанныеФайла) = Тип("ФайловыйПоток")
		Или ТипЗнч(ДанныеФайла) = Тип("ПотокВПамяти") Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьПоток(ДанныеФайла);
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип параметра функции КодировкаXML: %1'"), ТипЗнч(ДанныеФайла));
	КонецЕсли;
	
	Попытка
		ЧтениеXML.ПерейтиКСодержимому();
		КодировкаXML = ЧтениеXML.КодировкаXML;
	Исключение
		КодировкаXML = "";
	КонецПопытки;
	
	ЧтениеXML.Закрыть();
	
	Если ТипЗнч(ДанныеФайла) = Тип("ДвоичныеДанные") Тогда
		ПотокВПамяти.Закрыть();
	КонецЕсли;
	
	Возврат КодировкаXML;
КонецФункции

// Возвращает кодировку BOM файла.
//
// Параметры:
//   ДанныеФайла - ДвоичныеДанные, Строка, Поток, ПотокВПамяти, ФайловыйПоток - Данные файла.
//       В типе Строка может быть передано только полное имя файла.
//
// Возвращаемое значение:
//   Строка - Кодировка текста, либо пустая строка, если в файле отсутствует сигнатура BOM.
//
Функция КодировкаBOM(ДанныеФайла) Экспорт
	ЧтениеДанных = Новый ЧтениеДанных(ДанныеФайла);
	БуферДвоичныхДанных = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных(5);
	ПрочитанныеБайты = Новый Массив(5);
	
	ВГраница = БуферДвоичныхДанных.Размер - 1;
	Для Индекс = 0 По 4 Цикл
		Если Индекс < БуферДвоичныхДанных.Размер Тогда
			ПрочитанныеБайты[Индекс] = БуферДвоичныхДанных[Индекс];
		Иначе // Неинициализированные байты считаем равными 0xA5, чтобы в случае меньшего размера файла не ошибиться в кодировке.
			ПрочитанныеБайты[Индекс] = ЧислоИзШестнадцатеричнойСтроки("0xA5");
		КонецЕсли;
	КонецЦикла;
	
	Если ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0xFE")
		И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0xFF") Тогда
		КодировкаBOM = "UTF-16BE";
	ИначеЕсли ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0xFF")
		И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0xFE") Тогда
		Если ПрочитанныеБайты[2] = ЧислоИзШестнадцатеричнойСтроки("0x00")
			И ПрочитанныеБайты[3] = ЧислоИзШестнадцатеричнойСтроки("0x00") Тогда
			КодировкаBOM = "UTF-32LE";
		Иначе
			КодировкаBOM = "UTF-16LE";
		КонецЕсли;
	ИначеЕсли ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0xEF")
		И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0xBB")
		И ПрочитанныеБайты[2] = ЧислоИзШестнадцатеричнойСтроки("0xBF") Тогда
		КодировкаBOM = "UTF-8";
	ИначеЕсли ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0x00")
		И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0x00")
		И ПрочитанныеБайты[2] = ЧислоИзШестнадцатеричнойСтроки("0xFE")
		И ПрочитанныеБайты[3] = ЧислоИзШестнадцатеричнойСтроки("0xFF") Тогда
		КодировкаBOM = "UTF-32BE";
	ИначеЕсли ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0x0E")
		И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0xFE")
		И ПрочитанныеБайты[2] = ЧислоИзШестнадцатеричнойСтроки("0xFF") Тогда
		КодировкаBOM = "SCSU";
	ИначеЕсли ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0xFB")
		И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0xEE")
		И ПрочитанныеБайты[2] = ЧислоИзШестнадцатеричнойСтроки("0x28") Тогда
		КодировкаBOM = "BOCU-1";
	ИначеЕсли ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0x2B")
		И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0x2F")
		И ПрочитанныеБайты[2] = ЧислоИзШестнадцатеричнойСтроки("0x76")
		И (ПрочитанныеБайты[3] = ЧислоИзШестнадцатеричнойСтроки("0x38")
			Или ПрочитанныеБайты[3] = ЧислоИзШестнадцатеричнойСтроки("0x39")
			Или ПрочитанныеБайты[3] = ЧислоИзШестнадцатеричнойСтроки("0x2B")
			Или ПрочитанныеБайты[3] = ЧислоИзШестнадцатеричнойСтроки("0x2F")) Тогда
		КодировкаBOM = "UTF-7";
	ИначеЕсли ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0xDD")
		И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0x73")
		И ПрочитанныеБайты[2] = ЧислоИзШестнадцатеричнойСтроки("0x66")
		И ПрочитанныеБайты[3] = ЧислоИзШестнадцатеричнойСтроки("0x73") Тогда
		КодировкаBOM = "UTF-EBCDIC";
	Иначе
		КодировкаBOM = "";
	КонецЕсли;
	
	Возврат КодировкаBOM;
КонецФункции

#КонецОбласти

#Область СвертываемыеГруппы_СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьСвертываемыеГруппы(Форма) Экспорт
	ВидимостьОбновлена = Ложь;
	
	ИнициализироватьСвертываемыеГруппы(Форма, ВидимостьОбновлена);
	
	Если Не ВидимостьОбновлена Тогда
		Для Каждого КлючИЗначение Из Форма.ПараметрыСвертываемыхГрупп Цикл
			ОбновитьЭлементыСвертываемойГруппы(Форма, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьСвертываемуюГруппу(Форма, Группа) Экспорт
	ОбновитьЭлементыСвертываемойГруппы(Форма, Форма.ПараметрыСвертываемыхГрупп[Группа.Имя]);
КонецПроцедуры

Процедура СвернутьРазвернутьГруппу(Форма, ИмяЭлемента) Экспорт
	Позиция = СтрНайти(ИмяЭлемента, "_", НаправлениеПоиска.СКонца);
	Если Позиция = 0 Тогда
		ИмяГруппы = ИмяЭлемента;
	Иначе
		ИмяГруппы = Лев(ИмяЭлемента, Позиция - 1);
	КонецЕсли;
	ПараметрыГруппы = Форма.ПараметрыСвертываемыхГрупп[ИмяГруппы];
	ПараметрыГруппы.Развернута = Не (ПараметрыГруппы.Развернута Или ПараметрыГруппы.ТребуетЗаполнения);
	ПараметрыГруппы.ТребуетЗаполнения = Ложь;
	СохранитьНастройкиСвертываемыхГрупп(Форма);
	ОбновитьЭлементыСвертываемойГруппы(Форма, ПараметрыГруппы);
КонецПроцедуры

Процедура СвертываемыеГруппыОбработкаПроверкиЗаполненияНаСервере(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
	Для Каждого КлючИЗначение Из Форма.ПараметрыСвертываемыхГрупп Цикл
		КлючИЗначение.Значение.ТребуетЗаполнения = Ложь;
	КонецЦикла;
КонецПроцедуры

Процедура СвертываемыеГруппыАдаптироватьСообщениеПользователю(Форма, Сообщение) Экспорт
	Элемент = Форма.Элементы.Найти(Сообщение.Поле);
	Если Элемент = Неопределено И СтрНайти(Сообщение.Поле, "[") > 0 Тогда
		Массив = СтрРазделить(Сообщение.Поле, "[].", Ложь);
		Элемент = Форма.Элементы.Найти(Массив[0]);
	КонецЕсли;
	Если ТипЗнч(Элемент) <> Тип("ПолеФормы") И ТипЗнч(Элемент) <> Тип("ТаблицаФормы") Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Элемент) = Тип("ПолеФормы") И Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
		Элемент.ОтметкаНезаполненного = Истина;
	КонецЕсли;
	ПараметрыГрупп = Форма.ПараметрыСвертываемыхГрупп;
	ПараметрыГруппы = Неопределено;
	Пока Истина Цикл
		Элемент = Элемент.Родитель;
		Если ТипЗнч(Элемент) = Тип("ФормаКлиентскогоПриложения") Тогда
			Прервать;
		КонецЕсли;
		Если ПараметрыГрупп.Свойство(Элемент.Имя, ПараметрыГруппы) И Не ПараметрыГруппы.Развернута Тогда
			ПараметрыГруппы.ТребуетЗаполнения = Истина;
			ОбновитьЭлементыСвертываемойГруппы(Форма, ПараметрыГруппы);
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СвертываемыеГруппы_СлужебныеПроцедурыИФункции

Процедура ОбновитьЭлементыСвертываемойГруппы(Форма, ПараметрыГруппы, СвертываемаяГруппа = Неопределено, Картинка = Неопределено, Кнопка = Неопределено)
	ИмяГруппы = ПараметрыГруппы.Имя;
	Родитель  = Форма.Элементы[ИмяГруппы + "_1"];
	
	Если СвертываемаяГруппа = Неопределено Тогда
		Элементы           = Форма.Элементы;
		СвертываемаяГруппа = Элементы[ИмяГруппы];
		Картинка           = Элементы[ИмяГруппы + "_Картинка"];
		Кнопка             = Элементы[ИмяГруппы + "_Команда"];
	КонецЕсли;
	
	НастройкиГруппы = Новый Структура("Представление, Обязательная, Заполнена, Развернута, Видимость");
	НастройкиГруппы.Обязательная = Ложь;
	НастройкиГруппы.Развернута = ПараметрыГруппы.Развернута Или ПараметрыГруппы.ТребуетЗаполнения;
	НастройкиГруппы.Видимость = Родитель.Видимость;
	
	Форма.ПриОпределенииСвойствСвертываемойГруппы(СвертываемаяГруппа, НастройкиГруппы);
	
	Представление = НастройкиГруппы.Представление;
	Обязательная = НастройкиГруппы.Обязательная;
	Заполнена = НастройкиГруппы.Заполнена;
	Развернута = НастройкиГруппы.Развернута;
	Видимость = НастройкиГруппы.Видимость;
	
	Если Видимость <> Родитель.Видимость Тогда
		Родитель.Видимость = Видимость;
	КонецЕсли;
	Если Не Видимость Тогда
		Возврат;
	КонецЕсли;
	
	СвертываемаяГруппа.Видимость = Развернута;
	
	Если Заполнена = Неопределено Тогда
		Заполнена = Развернута Или ЗначениеЗаполнено(Представление);
	КонецЕсли;
	Подсказка = "";
	Если Не Развернута И ЗначениеЗаполнено(Представление) И СтрДлина(Представление) > 100 Тогда
		Позиция = СтрНайти(Представление, " ", НаправлениеПоиска.СКонца, 100);
		Если Позиция > 0 Тогда
			Подсказка = Представление;
			Представление = Лев(Представление, Позиция) + "...";
		КонецЕсли;
	КонецЕсли;
	Если Не Развернута И Не Заполнена И Не ЗначениеЗаполнено(Представление) Тогда
		Представление = НСтр("ru = 'Нет'");
	КонецЕсли;
	Если Заполнена Тогда
		Картинка.Картинка = ?(Развернута, БиблиотекаКартинок.СтрелкаВнизЗеленая, БиблиотекаКартинок.СтрелкаВправоЗеленая);
		Кнопка.ЦветТекста = ЦветаСтиля.ОбычнаяГруппаЦвет;
	ИначеЕсли Обязательная Тогда
		Картинка.Картинка = ?(Развернута, БиблиотекаКартинок.СтрелкаВнизКрасная, БиблиотекаКартинок.СтрелкаВправоКрасная);
		Кнопка.ЦветТекста = ЦветаСтиля.ПоясняющийОшибкуТекст;
	Иначе
		Картинка.Картинка = ?(Развернута, БиблиотекаКартинок.СтрелкаВнизСерая, БиблиотекаКартинок.СтрелкаВправоСерая);
		Кнопка.ЦветТекста = ЦветаСтиля.ЗаголовокПоляЗаполняемогоАвтоматическиЦвет;
	КонецЕсли;
	Если Развернута Или Не ЗначениеЗаполнено(Представление) Или Представление = "-" Тогда
		Кнопка.Заголовок = СвертываемаяГруппа.Заголовок;
	Иначе
		Кнопка.Заголовок = СвертываемаяГруппа.Заголовок + ": " + Представление;
	КонецЕсли;
	Если Подсказка = "" Тогда
		Кнопка.РасширеннаяПодсказка.Заголовок = "";
	Иначе
		Кнопка.РасширеннаяПодсказка.Заголовок = Подсказка;
	КонецЕсли;
КонецПроцедуры

Процедура ИнициализироватьСвертываемыеГруппы(Форма, ВидимостьОбновлена)
	Если Форма.ПараметрыСвертываемыхГрупп <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	// Наполнение списка групп.
	МассивГрупп = Новый Массив;
	Форма.ПриОпределенииСвертываемыхГрупп(МассивГрупп);
	// Перенос параметров в реквизит формы.
	ПараметрыГрупп = Новый Структура;
	ШаблонГруппы = Новый Структура("Имя, Развернута, ТребуетЗаполнения", "", Ложь, Ложь);
	Для Каждого ГруппаФормы Из МассивГрупп Цикл
		ПараметрыГруппы = Новый Структура(Новый ФиксированнаяСтруктура(ШаблонГруппы));
		ПараметрыГруппы.Имя = ГруппаФормы.Имя;
		ПараметрыГрупп.Вставить(ПараметрыГруппы.Имя, ПараметрыГруппы);
	КонецЦикла;
	Форма.ПараметрыСвертываемыхГрупп = ПараметрыГрупп;
	// Чтение настроек списка.
	ПрочитатьНастройкиСвертываемыхГрупп(Форма);
	// Добавление элементов формы.
	ДобавитьЭлементыСвертываемыхГрупп(Форма);
	// Отключение второго цикла.
	ВидимостьОбновлена = Истина;
	Форма.ПослеДобавленияЭлементовСвертываемыхГрупп();
КонецПроцедуры

Процедура ПрочитатьНастройкиСвертываемыхГрупп(Форма)
	Хранилище = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(Форма.ИмяФормы, "СвертываемыеГруппы");
	ПараметрыГрупп  = Форма.ПараметрыСвертываемыхГрупп;
	ПараметрыГруппы = Неопределено;
	Если ТипЗнч(Хранилище) = Тип("СписокЗначений") Тогда
		Для Каждого ЭлементСписка Из Хранилище Цикл
			Если ПараметрыГрупп.Свойство(ЭлементСписка.Значение, ПараметрыГруппы) Тогда
				ПараметрыГруппы.Развернута = ЭлементСписка.Пометка;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Хранилище) = Тип("Структура") Тогда
		Для Каждого КлючИЗначение Из Хранилище Цикл
			Если ПараметрыГрупп.Свойство(КлючИЗначение.Ключ, ПараметрыГруппы) Тогда
				ПараметрыГруппы.Развернута = КлючИЗначение.Значение.Развернута;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура СохранитьНастройкиСвертываемыхГрупп(Форма)
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(Форма.ИмяФормы, "СвертываемыеГруппы", Форма.ПараметрыСвертываемыхГрупп);
КонецПроцедуры

Процедура ДобавитьЭлементыСвертываемыхГрупп(Форма)
	Элементы = Форма.Элементы;
	Команды = Форма.Команды;
	Для Каждого КлючИЗначение Из Форма.ПараметрыСвертываемыхГрупп Цикл
		ПараметрыГруппы    = КлючИЗначение.Значение;
		ИмяГруппы          = ПараметрыГруппы.Имя;
		СвертываемаяГруппа = Элементы.Найти(ИмяГруппы);
		Если СвертываемаяГруппа = Неопределено Тогда
			Сообщить(СтрШаблон(НСтр("ru = 'Не найдена сворачивающаяся группа %1'"), ИмяГруппы));
			Форма.ПараметрыСвертываемыхГрупп.Очистить();
			Возврат;
		КонецЕсли;
		Родитель = СвертываемаяГруппа.Родитель;
		
		ГруппаСтрок = Элементы.Вставить(ИмяГруппы + "_1", Тип("ГруппаФормы"), Родитель, СвертываемаяГруппа);
		ГруппаСтрок.Вид         = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСтрок.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаСтрок.Отображение = СвертываемаяГруппа.Отображение;
		ГруппаСтрок.ОтображатьЗаголовок = Ложь;
		
		ГруппаКолонок = Элементы.Добавить(ИмяГруппы + "_2", Тип("ГруппаФормы"), ГруппаСтрок);
		ГруппаКолонок.Вид         = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаКолонок.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаКолонок.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаКолонок.ОтображатьЗаголовок = Ложь;
		ГруппаКолонок.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
		ГруппаКолонок.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		
		Картинка = Элементы.Добавить(ИмяГруппы + "_Картинка", Тип("ДекорацияФормы"), ГруппаКолонок);
		Картинка.Вид         = ВидДекорацииФормы.Картинка;
		Картинка.Гиперссылка = Истина;
		Картинка.УстановитьДействие("Нажатие", "Подключаемый_СвернутьРазвернутьГруппу");
		
		Команда = Команды.Добавить(ИмяГруппы + "_Команда");
		Команда.Действие = "Подключаемый_СвернутьРазвернутьГруппу";
		
		Кнопка = Элементы.Добавить(Команда.Имя, Тип("КнопкаФормы"), ГруппаКолонок);
		Кнопка.ИмяКоманды        = Команда.Имя;
		Кнопка.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
		Кнопка.ЦветТекста        = ЦветаСтиля.ОбычнаяГруппаЦвет;
		Кнопка.Шрифт             = СвертываемаяГруппа.ШрифтЗаголовка;
		
		Если ГруппаСтрок.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение
			Или ГруппаСтрок.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение Тогда
			Кнопка.Шрифт = ШрифтыСтиля.ОбычнаяГруппаШрифт;
		КонецЕсли;
		
		Элементы.Переместить(СвертываемаяГруппа, ГруппаСтрок);
		
		СвертываемаяГруппа.Поведение            = ПоведениеОбычнойГруппы.Обычное;
		СвертываемаяГруппа.Отображение          = ОтображениеОбычнойГруппы.Нет;
		СвертываемаяГруппа.ОтображатьЗаголовок  = Ложь;
		СвертываемаяГруппа.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСлева;
		СвертываемаяГруппа.Подсказка            = " ";
		
		ОбновитьЭлементыСвертываемойГруппы(Форма, ПараметрыГруппы, СвертываемаяГруппа, Картинка, Кнопка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ХранилищеНастроек

Процедура ХранилищеСохранить(МенеджерХранилища, КлючОбъекта, КлючНастроек, Настройки,
			ОписаниеНастроек, ИмяПользователя, ОбновитьПовторноИспользуемыеЗначения)
	
	Если Не ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерХранилища.Сохранить(КлючОбъекта, КлючНастроек(КлючНастроек), Настройки,
		ОписаниеНастроек, ИмяПользователя);
	
	Если ОбновитьПовторноИспользуемыеЗначения Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры

Функция ХранилищеЗагрузить(МенеджерХранилища, КлючОбъекта, КлючНастроек, ЗначениеПоУмолчанию,
			ОписаниеНастроек, ИмяПользователя)
	
	Результат = Неопределено;
	
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		Результат = МенеджерХранилища.Загрузить(КлючОбъекта, КлючНастроек(КлючНастроек),
			ОписаниеНастроек, ИмяПользователя);
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Результат = ЗначениеПоУмолчанию;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		Если ОчиститьНесуществующиеСсылки(Результат) Тогда
			Результат = ЗначениеПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Удаляет из переданной коллекции ссылки, ссылающиеся на несуществующие данные в информационной базе.
// Не очищает переданное значение, если в нем передана несуществующая ссылка, а возвращает Ложь. 
//
// Параметры:
//   Значение - ЛюбаяСсылка
//            - Произвольный - проверяемое значение или коллекция.
//
// Возвращаемое значение: 
//   Булево - Истина, если Значение ссылочного типа и объект не существует в информационной базе.
//            Ложь, если Значение не ссылочного типа или объект существует.
//
Функция ОчиститьНесуществующиеСсылки(Значение)
	
	Тип = ТипЗнч(Значение);
	Если Тип = Тип("Неопределено")
		Или Тип = Тип("Булево")
		Или Тип = Тип("Строка")
		Или Тип = Тип("Число")
		Или Тип = Тип("Дата") Тогда // Оптимизация - часто используемые примитивные типы.
		
		Возврат Ложь; // Не ссылка.
		
	ИначеЕсли Тип = Тип("Массив") Тогда
		
		Количество = Значение.Количество();
		Для Номер = 1 По Количество Цикл
			ОбратныйИндекс = Количество - Номер;
			// @skip-check query-in-loop - выборка ссылок из разных таблиц.
			Если ОчиститьНесуществующиеСсылки(Значение[ОбратныйИндекс]) Тогда
				Значение.Удалить(ОбратныйИндекс);
			КонецЕсли;
		КонецЦикла;
		
		Возврат Ложь; // Не ссылка.
		
	ИначеЕсли Тип = Тип("Структура")
		Или Тип = Тип("Соответствие") Тогда
		
		Для Каждого КлючИЗначение Из Значение Цикл
			// @skip-check query-in-loop - выборка ссылок из разных таблиц.
			Если ОчиститьНесуществующиеСсылки(КлючИЗначение.Значение) Тогда
				Значение.Вставить(КлючИЗначение.Ключ, Неопределено);
			КонецЕсли;
		КонецЦикла;
		
		Возврат Ложь; // Не ссылка.
		
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(Тип)
		Или Справочники.ТипВсеСсылки().СодержитТип(Тип)
		Или Перечисления.ТипВсеСсылки().СодержитТип(Тип)
		Или ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип)
		Или ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип)
		Или ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип)
		Или ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип)
		Или БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип)
		Или Задачи.ТипВсеСсылки().СодержитТип(Тип) Тогда
		// Ссылочный тип, исключая ТочкаМаршрутаБизнесПроцессаСсылка.
		
		Если Значение.Пустая() Тогда
			Возврат Ложь; // Ссылка пустая.
		КонецЕсли;
		Возврат ЗначениеРеквизитаОбъекта(Значение, "Ссылка") = Неопределено;
		
	Иначе
		Возврат Ложь; // Не ссылка.
	КонецЕсли;
	
КонецФункции

Процедура ХранилищеУдалить(МенеджерХранилища, КлючОбъекта, КлючНастроек, ИмяПользователя)
	
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		МенеджерХранилища.Удалить(КлючОбъекта, КлючНастроек(КлючНастроек), ИмяПользователя);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает строку ключа настроек, не превышающую допустимую длину 128 символов.
// Если указанная строка превышает 128, тогда вместо символов сверх 96 символов
// добавляется их хеш-сумма по алгоритму MD5 размером 32 символа.
//
// Параметры:
//  Строка - Строка - строка произвольной длины.
//
// Возвращаемое значение:
//  Строка - не более 128 символов.
//
Функция КлючНастроек(Знач Строка)
	Возврат СтроковыеФункции.СократитьСтрокуКонтрольнойСуммой(Строка, 128);
КонецФункции

#КонецОбласти

Функция ВерсияПлатформы() Экспорт
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ВерсияПриложения;
КонецФункции

Функция ПредставлениеДлительностиКраткое(ДлительностьВСекундах) Экспорт
	Если ДлительностьВСекундах <= 0 Тогда
		Возврат НСтр("ru = '<1 с.'");
	КонецЕсли;
	
	Секунды = ДлительностьВСекундах%60;
	Минуты = Цел(ДлительностьВСекундах/60)%60;
	Часы = Цел(ДлительностьВСекундах/3600);
	Дни = Цел(ДлительностьВСекундах/86400);
	
	Результаты = Новый Массив;
	
	ТекущийФормат = "ЧГ=";
	ПоследующийФормат = "ЧЦ=2; ЧН=; ЧВН=; ЧГ=";
	Если Дни > 0 Тогда
		Результаты.Добавить(СтрШаблон(НСтр("ru = '%1 д.'"), Формат(Дни, ТекущийФормат)));
		ТекущийФормат = ПоследующийФормат;
	КонецЕсли;
	Если Часы > 0 Тогда
		Результаты.Добавить(СтрШаблон(НСтр("ru = '%1 ч.'"), Формат(Часы, ТекущийФормат)));
		ТекущийФормат = ПоследующийФормат;
	КонецЕсли;
	Если Минуты > 0 Тогда
		Результаты.Добавить(СтрШаблон(НСтр("ru = '%1 м.'"), Формат(Минуты, ТекущийФормат)));
		ТекущийФормат = ПоследующийФормат;
	КонецЕсли;
	Если Секунды > 0 И Дни = 0 И Часы = 0 Тогда
		Результаты.Добавить(СтрШаблон(НСтр("ru = '%1 с.'"), Формат(Секунды, ТекущийФормат)));
		ТекущийФормат = ПоследующийФормат;
	КонецЕсли;
	
	Возврат СтрСоединить(Результаты, " ");
КонецФункции

#КонецОбласти
