///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Базовая функциональность".
// Серверные процедуры и функции общего назначения:
// - для работы с данными в базе;
// - для работы с прикладными типами и коллекциями значений;
// - математические процедуры и функции;
// - для работы с внешним соединением;
// - для работы с формами;
// - для работы с типами, объектами метаданных и их строковыми представлениями;
// - функции определения типов объектов метаданных;
// - сохранение, чтение и удаление настроек из хранилищ;
// - для работы с табличными документами;
// - для работы с журналом регистрации;
// - для работы в режиме разделения данных;
// - версионирование программных интерфейсов;
// - вспомогательные процедуры и функции.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура удаляет из массива МассивРеквизитов элементы, соответствующие именам 
// реквизитов объекта из массива МассивНепроверяемыхРеквизитов.
// Для использования в обработчиках события ОбработкаПроверкиЗаполнения.
//
// Параметры:
//	МассивРеквизитов              - Массив из Строка - массив строк с именами реквизитов объекта.
//	МассивНепроверяемыхРеквизитов - Массив из Строка - массив строк с именами реквизитов объекта, не требующих проверки.
//
Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт
	
	Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
	
		ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
		Если ПорядковыйНомер <> Неопределено Тогда
			МассивРеквизитов.Удалить(ПорядковыйНомер);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции для работы с данными в базе.

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Функция не предназначена для получения значений реквизитов пустых ссылок.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если строка затребованных реквизитов пуста, то возвращается пустая структура.
//              Если в качестве объекта передана пустая ссылка, то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъекта(Знач Ссылка, Знач Реквизиты) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		Реквизиты = СтрРазделить(Реквизиты, ", ", Ложь);
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	Если ТипЗнч(Реквизиты) = Тип("Структура") Или ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		СтруктураРеквизитов = Реквизиты;
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив") Или ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(СтрЗаменить(Реквизит, ".", ""), Реквизит);
		КонецЦикла;
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип второго параметра Реквизиты: %1'"), Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Ключ));
		
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
		|	" + ИмяПоля + " КАК " + Псевдоним;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|" + ТекстПолей + "
	|ИЗ
	|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
//
// Функция не предназначена для получения значений реквизитов пустых ссылок.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка -  например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита);
	Возврат Результат[СтрЗаменить(ИмяРеквизита, ".", "")];
	
КонецФункции 

// Возвращает значения реквизитов, прочитанные из информационной базы
// для нескольких объектов.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
//
// Функция не предназначена для получения значений реквизитов пустых ссылок.
// 
// Параметры:
//  МассивСсылок - Массив - ссылок на объекты одного типа.
//				ВАЖНО! значения массива должны быть ссылками на 
//				объекты одного типа!
//  ИменаРеквизитов - Строка - имена реквизитов перечисленные через запятую,
//				в формате требований к свойствам структуры.
//				Например, "Код, Наименование, Родитель".
// 
// Возвращаемое значение:
//  Соответствие - где ключ - ссылка на объект, а Значение - структура, которая 
//		   		содержит список свойств, как список имен в строке.
//				ИменаРеквизитов, со значениям реквизитов, прочитанными из информационной базы.
// 
Функция ЗначенияРеквизитовОбъектов(МассивСсылок, ИменаРеквизитов) Экспорт
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка, " + ИменаРеквизитов + "
		|ИЗ
		|	" + МассивСсылок[0].Метаданные().ПолноеИмя() + " КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Возвращает значения реквизита, прочитанного из информационной базы для нескольких объектов.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Функция не предназначена для получения значений реквизитов пустых ссылок.
//
// Параметры:
//  МассивСсылок - Массив - ссылок на объекты одного типа.
//				ВАЖНО! значения массива должны быть ссылками на 
//				объекты одного типа!
//  ИмяРеквизита - Строка - например, "Код".
// 
// Возвращаемое значение:
//  Соответствие - Ключ - ссылка на объект, Значение - значение прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъектов(МассивСсылок, ИмяРеквизита) Экспорт
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектов(МассивСсылок, ИмяРеквизита);
	Для Каждого Элемент Из ЗначенияРеквизитов Цикл
		ЗначенияРеквизитов[Элемент.Ключ] = Элемент.Значение[ИмяРеквизита];
	КонецЦикла;
		
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Определяет режим эксплуатации информационной базы файловый (Истина) или серверный (Ложь).
// При проверке используется СтрокаСоединенияИнформационнойБазы, которую можно указать явно.
//
// Параметры:
//  СтрокаСоединенияИнформационнойБазы - Строка - параметр используется, если
//                 нужно проверить строку соединения не текущей информационной базы.
//
// Возвращаемое значение:
//  Булево.
//
Функция ИнформационнаяБазаФайловая(Знач СтрокаСоединенияИнформационнойБазы = "") Экспорт
			
	Если ПустаяСтрока(СтрокаСоединенияИнформационнойБазы) Тогда
		СтрокаСоединенияИнформационнойБазы =  СтрокаСоединенияИнформационнойБазы();
	КонецЕсли;
	Возврат СтрНайти(Врег(СтрокаСоединенияИнформационнойБазы), "FILE=") = 1;
	
КонецФункции 

// Возвращает значение в виде XML-строки.
// Преобразованы в XML-строку (сериализованы) могут быть только те объекты, 
// для которых в описании указано, что они сериализуются.
//
// Параметры:
//   Значение - Произвольный - Значение, которое необходимо сериализовать в XML-строку.
//
// Возвращаемое значение:
//   Строка - XML-строка представления значения в сериализованном виде.
//
Функция ЗначениеВСтрокуXML(Значение) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

// Возвращает значение, полученное из XML-строки. 
// Получены из XML-строки могут быть только те объекты, 
// для которых в описании указано, что они сериализуются.
//
// Параметры:
// СтрокаXML - строка представления значения в сериализованном виде.
//
// Возвращаемое значение:
// Значение, полученное из переданной XML-строки.
//
Функция ЗначениеИзСтрокиXML(СтрокаXML) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Возврат СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
КонецФункции

// Счтитывает в память текстовый файл на сервере в объект "ТектовыйДокумент" для отображения на клиенте
// 
// Параметры:
// 	ПутьКФайлу - Строка - Путь к файлу на сервере
// 	Текст - ТекстовыйДокумент- Текстовый документ, в который будет считан файл на сервере
// 	ИмяФайла - Строка - Возвращаемое значение имени файла
// 	ИспользоватьКодировкуСистемы - Булево - Истина - использовать кодировку системы, 
//      Ложь - считать файл в кодировке UTF-8
Процедура ПрочитатьТекстовыйФайл(ПутьКФайлу, Текст, ИмяФайла, ИспользоватьКодировкуСистемы = Ложь) Экспорт
	
	Файл = новый Файл(ПутьКФайлу);
	ИмяФайла = Файл.Имя;
	Если Файл.Существует() Тогда
		Если ИспользоватьКодировкуСистемы Тогда
			ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
			Если ЭтоWindowsСервер Тогда
				Текст.Прочитать(ПутьКФайлу, КодировкаТекста.OEM);
			Иначе
				Текст.Прочитать(ПутьКФайлу, КодировкаТекста.Системная);
			КонецЕсли;
		Иначе
			Текст.Прочитать(ПутьКФайлу, КодировкаТекста.UTF8);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Преобразует строку таблицы значений в структуру.
// Свойства структуры и их значения совпадают с колонками переданной строки.
//
// Параметры:
//  СтрокаТаблицыЗначений - СтрокаТаблицыЗначений - строка таблицы значений.
//
// Возвращаемое значение:
//  Структура - преобразованная строка таблицы значений.
//
Функция СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений) Экспорт
	
	Структура = Новый Структура;
	Для каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл
		Структура.Вставить(Колонка.Имя, СтрокаТаблицыЗначений[Колонка.Имя]);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

// Сканирует каталог с установленными версиями платформы и возвращает список версий
// 
// Параметры:
// 	ПутьКВерсиямПлатформыНаСервере - Неопределено - Путь по которому необходимо искать спиоск версий, если не указано - получаем из константы
// 
// Возвращаемое значение:
// 	Массив из Строка - список доступных версий на сервере
Функция СписокДоступныхВерсийПлатформы(ПутьКВерсиямПлатформыНаСервере = Неопределено) Экспорт 
	
	СписокВерсий = Новый Массив;
	
	Если ПутьКВерсиямПлатформыНаСервере = Неопределено Тогда
		ПутьКВерсиямПлатформыНаСервере = Константы.ПутьКВерсиямПлатформыНаСервере.Получить();
	КонецЕсли;
	
	
	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
	
	Если ЭтоWindowsСервер Тогда
		ИмяИсполняемогоФайлаКонфигуратора = "1cv8.exe";
	Иначе
		ИмяИсполняемогоФайлаКонфигуратора = "1cv8";
	КонецЕсли;
	
	
	Если Найти(ПутьКВерсиямПлатформыНаСервере, "%ВерсияПлатформыХранилища%") > 0 Тогда
	
		НачалоПутиКВерсиямПлатформыНаСервере = Лев(ПутьКВерсиямПлатформыНаСервере, Найти(ПутьКВерсиямПлатформыНаСервере, "%ВерсияПлатформыХранилища%")-1);
		ОкончаниеПутиКВерсиямПлатформыНаСервере = СтрЗаменить(ПутьКВерсиямПлатформыНаСервере, НачалоПутиКВерсиямПлатформыНаСервере, "");
		ОкончаниеПутиКВерсиямПлатформыНаСервере = СтрЗаменить(ОкончаниеПутиКВерсиямПлатформыНаСервере, "%ВерсияПлатформыХранилища%", "");
		
		Для каждого Файл Из НайтиФайлы(НачалоПутиКВерсиямПлатформыНаСервере, "*") Цикл
		
			Если Файл.ЭтоКаталог() Тогда
			
				ПолныйПуть = СтрЗаменить(ПутьКВерсиямПлатформыНаСервере, "%ВерсияПлатформыХранилища%", Файл.Имя);
				ФайлКонфигуратора = Новый Файл(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолныйПуть) + ИмяИсполняемогоФайлаКонфигуратора);
				Если ФайлКонфигуратора.Существует() И ФайлКонфигуратора.ЭтоФайл() Тогда
				
					СписокВерсий.Добавить(Файл.Имя);
				
				КонецЕсли; 
			
			КонецЕсли; 
		
		КонецЦикла; 
	
	КонецЕсли;
	
	Возврат СписокВерсий;
	
КонецФункции

// Создает полную копию структуры, соответствия, массива, списка или таблицы значений, рекурсивно,
// с учетом типов дочерних элементов. При этом содержимое значений объектных типов
// (СправочникОбъект, ДокументОбъект и т.п.) не копируются, а возвращаются ссылки на исходный объект.
//
// Параметры:
//  Источник - Структура
//           - ФиксированнаяСтруктура
//           - Соответствие
//           - ФиксированноеСоответствие
//           - Массив
//           - ФиксированныйМассив
//           - СписокЗначений - объект, который необходимо скопировать.
//  ФиксироватьДанные - Булево
//                    - Неопределено - если Истина - фиксировать,
//                          если Ложь - снять фиксацию, если Неопределено - не изменять.
//
// Возвращаемое значение:
//  Структура - , ФиксированнаяСтруктура,
//  Соответствие
//  ФиксированноеСоответствие
//  Массив
//  ФиксированныйМассив
//  СписокЗначений - копия объекта, переданного в параметре Источник.
//
Функция СкопироватьРекурсивно(Источник, ФиксироватьДанные = Неопределено) Экспорт
	
	Перем Приемник;
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("ТаблицаЗначений") Тогда
		Приемник = Источник.Скопировать();
	Иначе
		Приемник = ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(Источник, ФиксироватьДанные);
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции

#Область Коллекции

// Получает значения свойств. Если свойство отсутствует, то в значении будет Неопределено.
//
// Параметры:
//   Объект - Произвольный
//   ИменаСвойств - Строка - Имена получаемых свойств.
//
// Возвращаемое значение:
//   Структура - Значения свойств.
//
Функция ЗначенияСвойств(Объект, ИменаСвойств) Экспорт
	Структура = Новый Структура(ИменаСвойств);
	Если Объект <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Структура, Объект);
	КонецЕсли;
	Возврат Структура;
КонецФункции

#КонецОбласти

#Область РаботаСФайлами

// Проверяет существование файла.
Функция ФайлСуществует(ПолноеИмяФайла) Экспорт
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда
		Возврат Ложь;
	КонецЕсли;
	Файл = Новый Файл(ПолноеИмяФайла);
	Возврат Файл.Существует() И Не Файл.ЭтоКаталог();
КонецФункции

// Проверяет существование файла.
Функция КаталогСуществует(ПолноеИмяКаталога) Экспорт
	Если ПустаяСтрока(ПолноеИмяКаталога) Тогда
		Возврат Ложь;
	КонецЕсли;
	Файл = Новый Файл(ПолноеИмяКаталога);
	Возврат Файл.Существует() И Файл.ЭтоКаталог();
КонецФункции

Функция КаталогиРазмещеныНаОдномУстройстве(ПутьККаталогу1, ПутьККаталогу2) Экспорт
	//Юнит-тест:
	//  Сообщить(ФайлыСервер.КаталогиРазмещеныНаОдномУстройстве("C:\1\2\3", "C:\2\3\4"));
	//  > Да
	//  Сообщить(ФайлыСервер.КаталогиРазмещеныНаОдномУстройстве("C:\1\2\3", "D:\1\2\3"));
	//  > Нет
	//  Сообщить(ФайлыСервер.КаталогиРазмещеныНаОдномУстройстве("\\server\shara1\papka1", "\\server\shara1\papka2"));
	//  > Да
	//  Сообщить(ФайлыСервер.КаталогиРазмещеныНаОдномУстройстве("\\server\shara1\papka1", "\\server\shara2\papka1"));
	//  > Нет
	МассивИмен1 = СтрРазделить(ПутьККаталогу1, "\/", Ложь);
	МассивИмен2 = СтрРазделить(ПутьККаталогу2, "\/", Ложь);
	Возврат МассивИмен1[0] = МассивИмен2[0]
		И ?(СтрНачинаетсяС(ПутьККаталогу1, "\\"), МассивИмен1[1] = МассивИмен2[1], Истина);
КонецФункции

Функция КаталогФайловойИБ() Экспорт
	Строка = СтрокаСоединенияИнформационнойБазы();
	Если СтрНачинаетсяС(ВРег(Строка), ВРег("File=""")) Тогда
		Возврат Сред(Строка, СтрДлина("File=""") + 1, СтрДлина(Строка) - СтрДлина("File=""") - 2);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция РодительскийКаталог(ПутьКФайлуИлиКаталогу) Экспорт
	Если ПутьКФайлуИлиКаталогу = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ФайлИлиКаталог = Новый Файл(ПутьКФайлуИлиКаталогу);
	Если ФайлИлиКаталог.Существует() Тогда
		Возврат ФайлИлиКаталог.Путь;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Канонизирует полное имя каталога. При необходимости, добавляет слеш и создает каталог.
//
// Параметры:
//   ПолноеИмя - Строка - Полное имя каталога.
//   ТерминирующийСлеш - Булево - Добавлять конечный разделитель пути.
//   Создавать - Булево - Создавать в случае отсутствия.
//
// Возвращаемое значение:
//   Строка - Настоящее полное имя каталога.
//
Функция ПолноеИмяКаталога(Знач ПолноеИмя, ТерминирующийСлеш = Ложь, Создавать = Ложь) Экспорт
	РазделительПути = ПолучитьРазделительПути();
	ОбратныйРазделительПути = ?(РазделительПути = "/", "\", "/");
	// Канонизация.
	ПолноеИмяКаталога = СтрЗаменить(СокрЛП(ПолноеИмя), ОбратныйРазделительПути, РазделительПути);
	// Добавление разделителя.
	ЗаканчиваетсяНаРазделительПути = СтрЗаканчиваетсяНа(ПолноеИмяКаталога, РазделительПути);
	Если ЗаканчиваетсяНаРазделительПути <> ТерминирующийСлеш Тогда
		Если ТерминирующийСлеш Тогда
			ПолноеИмяКаталога = ПолноеИмяКаталога + РазделительПути;
		Иначе
			ПолноеИмяКаталога = Лев(ПолноеИмяКаталога, СтрДлина(ПолноеИмяКаталога) - 1);
		КонецЕсли;
	КонецЕсли;
	// Создание в случае отсутствия.
	Если Создавать И Не КаталогСуществует(ПолноеИмяКаталога) Тогда
		ЗаписатьПримечание("ru = 'ОбщегоНазначения.РаботаСФайлами'",
			СтрШаблон("ru = 'Создание каталога ""%1""...'", ПолноеИмяКаталога));
		СоздатьКаталог(ПолноеИмяКаталога);
	КонецЕсли;
	Возврат ПолноеИмяКаталога;
КонецФункции

// Создает временный каталог. После окончания работы с временным каталогом его необходимо удалить 
// с помощью ОбщегоНазначения.УдалитьВременныйКаталог.
//
// Параметры:
//   Расширение - Строка - Расширение каталога, которое идентифицирует назначение временного каталога
//                         и подсистему, которая его создала.
//                         Рекомендуется указывать на английском языке.
//
// Возвращаемое значение:
//   Строка - Полный путь к каталогу с разделителем пути.
//
Функция СоздатьВременныйКаталог(Знач Расширение = "") Экспорт
	Возврат ПолноеИмяКаталога(ПолучитьИмяВременногоФайла(Расширение), Истина, Истина);
КонецФункции

// Удаляет временный каталог вместе с его содержимым, если возможно.
// Если временный каталог не может быть удален (например, он занят каким-то процессом),
// то в журнал регистрации записывается соответствующее предупреждение, а процедура завершается.
//
// Для совместного использования с ОбщегоНазначения.СоздатьВременныйКаталог, 
// после окончания работы с временным каталогом.
//
// Параметры:
//   ПутьККаталогу - Строка - Полный путь к временному каталогу.
//
Процедура УдалитьВременныйКаталог(Знач ПолноеИмя) Экспорт
	
	Если ЭтоИмяВременногоФайла(ПолноеИмя) Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверное значение параметра Путь в ФайловаяСистема.УдалитьВременныйКаталог:
				       |Каталог не является временным ""%1""'"), 
			ПолноеИмя);
	КонецЕсли;
	
	УдалитьФайл(ПолноеИмя);
	
КонецПроцедуры

// Удаляет временный файл. Если временный файл не может быть удален (например, он занят каким-то процессом),
//   то в журнал регистрации записывается соответствующая ошибка.
//
// Параметры:
//   ПолноеИмя - Строка - полный путь к временному файлу.
//
Функция УдалитьФайл(Знач ПолноеИмя) Экспорт
	Попытка
		УдалитьФайлы(ПолноеИмя);
		Возврат Истина;
	Исключение
		ТекстОшибки = СтрШаблон(
			"ru = 'Не удалось удалить временный файл ""%1"" по причине:
			|%2'",
			ПолноеИмя,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписатьОшибку("ru = 'ОбщегоНазначения.РаботаСФайлами'", ТекстОшибки);
	КонецПопытки;
	
	Возврат Не ФайлСуществует(ПолноеИмя);
КонецФункции

// Возвращает Истина если переданное полное имя - имя временного файла.
Функция ЭтоИмяВременногоФайла(Путь) Экспорт
	
	// Ожидается, что Путь получен методом ПолучитьИмяВременногоФайла().
	// Перед проверкой разворачиваем слэши в одну сторону.
	Возврат Не СтрНачинаетсяС(СтрЗаменить(Путь, "/", "\"), СтрЗаменить(КаталогВременныхФайлов(), "/", "\"));
	
КонецФункции

// Возвращает хеш-сумму файла.
Функция ХешФайла(ПолноеИмя) Экспорт
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.CRC32);
	ХешированиеДанных.ДобавитьФайл(ПолноеИмя);
	Возврат СтроковыеФункции.УбратьПробелы(Строка(ХешированиеДанных.ХешСумма));
КонецФункции

#КонецОбласти

#Область ЖурналРегистрации

// Записывает событие в журнал регистрации.
//
// Параметры:
//   Уровень - Число, Строка, УровеньЖурналаРегистрации - Уровень критичности события.
//   ИмяСобытия - Строка - Имя события журнала. Передается в формате 1го параметра функции НСтр.
//   ТекстЖурнала - Строка - Текст для записи в журнал.
//   Объект - ОбъектМетаданных, ЛюбаяСсылка, ЛюбойОбъект, Неопределено - Объект соответствующий контексту события.
//
Процедура ЗаписатьВЖурнал(Знач Уровень, Знач ИмяСобытия = "", Знач ТекстЖурнала = "", Знач Объект = Неопределено) Экспорт
	
	КодЯзыкаЖурнала = Метаданные.ОсновнойЯзык.КодЯзыка;
	
	УровеньЖурнала = УровеньЖурнала(Уровень);
	
	Если Объект = Неопределено Тогда
		ОбъектДанных = СокрП(СтрПолучитьСтроку(ТекстЖурнала, 1));
		ОбъектМетаданных = Неопределено;
	ИначеЕсли ТипЗнч(Объект) = Тип("ОбъектМетаданных") Тогда
		ОбъектДанных = СокрП(СтрПолучитьСтроку(ТекстЖурнала, 1));
		ОбъектМетаданных = Объект;
	Иначе
		ОбъектДанных = Объект;
		ОбъектМетаданных = ОбъектДанных.Метаданные();
	КонецЕсли;
	
	Если ИмяСобытия = "" Тогда
		Если ОбъектМетаданных <> Неопределено Тогда
			ИмяСобытияЖурнала = ОбъектМетаданных.ПолноеИмя();
		Иначе
			ИмяСобытияЖурнала = НСтр("ru = 'Не определено'", КодЯзыкаЖурнала);
			ЗаписатьОшибку("ru = 'ОбщегоНазначения.ЖурналРегистрации'",
				СтрШаблон("ru = 'Ошибка при вызове процедуры ЗаписатьВЖурнал(): параметр ИмяСобытия не заполнен.'",
				ИмяСобытия));
		КонецЕсли;
	Иначе
		ИмяСобытияЖурнала = НСтр(ИмяСобытия, КодЯзыкаЖурнала);
		Если ИмяСобытияЖурнала = "" И ИмяСобытия <> "" Тогда
			ИмяСобытияЖурнала = ИмяСобытия;
			ЗаписатьОшибку("ru = 'ОбщегоНазначения.ЖурналРегистрации'",
				СтрШаблон("ru = 'Ошибка при вызове процедуры ЗаписатьВЖурнал(): в параметр ИмяСобытия передано значение ""%1"", которое не может быть использовано в функции НСтр.'",
				ИмяСобытия));
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурнала,
		УровеньЖурнала,
		ОбъектМетаданных,
		ОбъектДанных,
		ТекстЖурнала);
	
КонецПроцедуры

// Регистрирует ошибку в журнале регистрации.
//
// Параметры:
//   ИмяСобытия - Строка - Имя события журнала. Передается в формате 1го параметра функции НСтр.
//   Текст - Строка, ИнформацияОбОшибке - Текст или информация об ошибке для записи в журнал.
//   Объект - ОбъектМетаданных, ЛюбаяСсылка, ЛюбойОбъект, Неопределено - Объект соответствующий контексту события.
//
Процедура ЗаписатьОшибку(Знач ИмяСобытия = "", Знач Текст = "", Знач Объект = Неопределено) Экспорт
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка, ТекстЖурнала(Текст), ИмяСобытия, Объект);
КонецПроцедуры

// Регистрирует предупреждение в журнале регистрации.
//
// Параметры:
//   ИмяСобытия - Строка - Имя события журнала. Передается в формате 1го параметра функции НСтр.
//   Текст - Строка, ИнформацияОбОшибке - Текст или информация об ошибке для записи в журнал.
//   Объект - ОбъектМетаданных, ЛюбаяСсылка, ЛюбойОбъект, Неопределено - Объект соответствующий контексту события.
//
Процедура ЗаписатьПредупреждение(Знач ИмяСобытия = "", Знач Текст = "", Знач Объект = Неопределено) Экспорт
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Предупреждение, ТекстЖурнала(Текст), ИмяСобытия, Объект);
КонецПроцедуры

// Регистрирует информацию в журнале регистрации.
//
// Параметры:
//   ИмяСобытия - Строка - Имя события журнала. Передается в формате 1го параметра функции НСтр.
//   Текст - Строка, ИнформацияОбОшибке - Текст или информация об ошибке для записи в журнал.
//   Объект - ОбъектМетаданных, ЛюбаяСсылка, ЛюбойОбъект, Неопределено - Объект соответствующий контексту события.
//
Процедура ЗаписатьИнформацию(Знач ИмяСобытия = "", Знач Текст = "", Знач Объект = Неопределено) Экспорт
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Информация, ТекстЖурнала(Текст), ИмяСобытия, Объект);
КонецПроцедуры

// Регистрирует примечание в журнале регистрации.
//
// Параметры:
//   ИмяСобытия - Строка - Имя события журнала. Передается в формате 1го параметра функции НСтр.
//   Текст - Строка, ИнформацияОбОшибке - Текст или информация об ошибке для записи в журнал.
//   Объект - ОбъектМетаданных, ЛюбаяСсылка, ЛюбойОбъект, Неопределено - Объект соответствующий контексту события.
//
Процедура ЗаписатьПримечание(Знач ИмяСобытия = "", Знач Текст = "", Знач Объект = Неопределено) Экспорт
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Примечание, ТекстЖурнала(Текст), ИмяСобытия, Объект);
КонецПроцедуры

// Превращает строковый или числовой уровень критичности события в уровень журнала регистрации.
//
// Параметры:
//   Уровень - Число, Строка, УровеньЖурналаРегистрации - Уровень критичности события.
//
// Возвращаемое значение:
//   УровеньЖурналаРегистрации
//
Функция УровеньЖурнала(Знач Уровень) Экспорт
	Если ТипЗнч(Уровень) = Тип("УровеньЖурналаРегистрации") Тогда
		Возврат Уровень;
	ИначеЕсли Уровень = 1 Тогда
		Возврат УровеньЖурналаРегистрации.Ошибка;
	ИначеЕсли Уровень = 2 Тогда
		Возврат УровеньЖурналаРегистрации.Предупреждение;
	ИначеЕсли Уровень = 3 Тогда
		Возврат УровеньЖурналаРегистрации.Информация;
	ИначеЕсли Уровень = 4 Тогда
		Возврат УровеньЖурналаРегистрации.Примечание;
	Иначе
		Возврат УровеньЖурналаРегистрации[Уровень];
	КонецЕсли;
КонецФункции

// Превращает текст или информацию об ошибке в строку для записи в журнал регистрации.
//
// Параметры:
//   Текст - Строка, ИнформацияОбОшибке - Текст или информация об ошибке для записи в журнал.
//
// Возвращаемое значение:
//   Строка
//
Функция ТекстЖурнала(Текст) Экспорт
	Если ТипЗнч(Текст) = Тип("ИнформацияОбОшибке") Тогда
		ТекстЖурнала = ПодробноеПредставлениеОшибки(Текст);
	ИначеЕсли Текст <> "" Тогда
		ТекстЖурнала = НСтр(СокрЛП(Текст), Метаданные.ОсновнойЯзык.КодЯзыка);
		Если ТекстЖурнала = "" Тогда
			ТекстЖурнала = СокрЛП(Текст);
		КонецЕсли;
	Иначе
		ТекстЖурнала = "";
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область Лог

// Формирует полное имя файла лога конвертации хранилища
//
// Параметры:
//   ПолноеИмяКаталога - Строка - Каталог выгрузки версий хранилища.
//   СостояниеИлиИмяОперации - Строка, ПеречислениеСсылка.СостоянияВерсии - Имя типа операции, которое будет использоваться как префикс файла.
//
// Возвращаемое значение:
//   Строка - Полное имя файла лога.
//
Функция ИмяФайлаЛога(Знач ПолноеИмяКаталога, Знач ПрефиксИмениФайла) Экспорт
	Возврат ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолноеИмяКаталога) + ПрефиксИмениФайла + "_log.txt";
КонецФункции

// Записывает событие в журнал регистрации и в лог-файл.
//
// Параметры:
//   ИмяФайлаЛога - Строка - Полное имя файла лога. См. ОбщегоНазначения.ИмяФайлаЛога.
//   Уровень - Число, Строка, УровеньЖурналаРегистрации - Уровень критичности события.
//   ИмяСобытия - Строка - Имя события журнала. Передается в формате 1го параметра функции НСтр.
//   Текст - Строка, ИнформацияОбОшибке - Текст или информация об ошибке для записи в журнал.
//   Объект - ОбъектМетаданных, ЛюбаяСсылка, ЛюбойОбъект, Неопределено - Объект соответствующий контексту события.
//
Процедура ЗаписатьВЛог(Знач ИмяФайлаЛога, Знач Уровень, Знач ИмяСобытия, Знач Текст, Знач Кодировка = Неопределено) Экспорт
	УровеньЖурнала = УровеньЖурнала(Уровень);
	ТекстЖурнала = ТекстЖурнала(Текст);
	
	ЗаписатьВЖурнал(УровеньЖурнала, ИмяСобытия, ТекстЖурнала);
	
	ЗаписатьВФайлЛога(ИмяФайлаЛога, УровеньЖурнала, ИмяСобытия, ТекстЖурнала, Кодировка);
КонецПроцедуры

Процедура ЗаписатьВФайлЛога(ИмяФайлаЛога, УровеньЖурнала, ИмяСобытия, ТекстЖурнала, Кодировка)
	Начало = "[" + Формат(ТекущаяДатаСеанса(), "ДФ=hh:mm:ss") + "] [" + ВРег(УровеньЖурнала) + "] ";
	Отступ = "    ";
	Окончание = " (" + ИмяСобытия + ")";
	
	Дописывать = ФайлСуществует(ИмяФайлаЛога);
	Если Дописывать Тогда
		Начало = Символы.ПС + Начало;
	КонецЕсли;
	ТекстЛога = Начало + СтрЗаменить(ТекстЖурнала, Символы.ПС, Символы.ПС + Отступ) + Окончание;
	
	Если Кодировка = Неопределено Тогда
		Лог = Новый ЗаписьТекста(ИмяФайлаЛога, , , Дописывать);
	Иначе
		Лог = Новый ЗаписьТекста(ИмяФайлаЛога, Кодировка, , Дописывать);
	КонецЕсли;
	Лог.ЗаписатьСтроку(ТекстЛога);
	Лог.Закрыть();
	Лог = Неопределено;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
