///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПараметрыВерсии(ВерсияХранилища) Экспорт
	Запрос = ЗапросПоЭлементам(Новый Структура("Ссылка", ВерсияХранилища), , 1);
	Если Не ЗначениеЗаполнено(ВерсияХранилища) Тогда
		Структура = ОбщегоНазначения.СтруктураПоТекстуЗапроса(Запрос.Текст);
		Структура.Код = "Common";
		Возврат Структура;
	КонецЕсли;
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 0 Тогда
		Таблица.Добавить();
	КонецЕсли;
	Структура = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Таблица[0]);
	Возврат Структура;
КонецФункции

// Возвращает структуру последней версии хранилища.
//
// Параметры:
//   Хранилище - СправочникСсылка.ХранилищаКонфигураций
//
// Возвращаемое значение:
//   Структура
//       * Версия - Число - Код последней версии.
//       * Ссылка - СправочникСсылка.ВерсииХранилища - Ссылка последней версии.
//
Функция ПоследняяВерсияХранилища(Знач Хранилище) Экспорт
	Результат = Новый Структура("Код, Ссылка", 0, Справочники.ВерсииХранилища.ПустаяСсылка());
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВерсииХранилища.Ссылка КАК Ссылка,
	|	ВерсииХранилища.Код КАК Код
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Загрузить версию отчета из файла
// 
// Параметры:
// 	Хранилище - СправочникСсылка.ХранилищаКонфигураций - ссылка на хранилище
// 	ИмяФайлаОтчета - Строка - Имя файла отчета
Процедура ЗагрузитьВерсииИзОтчета(Знач Хранилище, ИмяФайлаОтчета) Экспорт 
	
	Файл = Новый Файл(ИмяФайлаОтчета);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	Отчет = Новый  ТабличныйДокумент;
	Отчет.Прочитать(ИмяФайлаОтчета);
	
	ВерсииХранилища = Новый Массив;
	
	ПоляВерсии = Новый Соответствие;
	ПоляВерсии.Вставить("Версия:", "Версия");
	ПоляВерсии.Вставить("Дата создания:", "ДатаСоздания");
	ПоляВерсии.Вставить("Время создания:", "ВремяСоздания");
	ПоляВерсии.Вставить("Пользователь:", "Пользователь");
	ПоляВерсии.Вставить("Комментарий:", "Комментарий");
	ПоляВерсии.Вставить("Добавлены:", "Добавлены");
	ПоляВерсии.Вставить("Изменены:", "Изменены");
	ПоляВерсии.Вставить("Удалены:", "Удалены");
	ПоляВерсии.Вставить("Version:", "Версия");
	ПоляВерсии.Вставить("Creation date:", "ДатаСоздания");
	ПоляВерсии.Вставить("Creation time:", "ВремяСоздания");
	ПоляВерсии.Вставить("User:", "Пользователь");
	ПоляВерсии.Вставить("Comment:", "Комментарий");
	ПоляВерсии.Вставить("Added:", "Добавлены");
	ПоляВерсии.Вставить("Changed:", "Изменены");
	ПоляВерсии.Вставить("Deleted:", "Удалены");
	
	КолонкаПоиска = Отчет.Область("C1");
	ОбластьСтроки = Неопределено;
	ОбластьСтроки = Отчет.НайтиТекст("Версия:", ОбластьСтроки, КолонкаПоиска, Ложь, Истина, Истина, Истина);
	Если ОбластьСтроки = Неопределено Тогда
		ОбластьСтроки = Отчет.НайтиТекст("Version:", ОбластьСтроки, КолонкаПоиска, Ложь, Истина, Истина, Истина);
	КонецЕсли;
	Пока ОбластьСтроки <> Неопределено Цикл
		
		ВерсияХранилища = Новый Структура("Версия, ДатаСоздания, ВремяСоздания, Пользователь, Комментарий, Добавлены, Изменены, Удалены", "", "", "", "", "", Новый Массив, Новый Массив, Новый Массив);
		
		СтрокаНачалаВерсии = ОбластьСтроки.Верх;
		ОбластьСтрокиНаРусском = Отчет.НайтиТекст("Версия:", ОбластьСтроки, КолонкаПоиска, Ложь, Истина, Истина, Истина);
		Если ОбластьСтрокиНаРусском = Неопределено Тогда
			ОбластьСтроки = Отчет.НайтиТекст("Version:", ОбластьСтроки, КолонкаПоиска, Ложь, Истина, Истина, Истина);
		Иначе
			ОбластьСтроки = ОбластьСтрокиНаРусском;
		КонецЕсли;
		Если ОбластьСтроки = Неопределено Тогда
			
			// Это последняя версия в файле, получаем конец документа
			СтрокаОкончанияВерсии = Отчет.ВысотаТаблицы;
		
		Иначе
		
			СтрокаОкончанияВерсии = ОбластьСтроки.Верх-1;
		
		КонецЕсли; 
		
		ИмяТекущегоМассиваСтрок = "";
		
		Пока СтрокаНачалаВерсии <= СтрокаОкончанияВерсии Цикл
			
			Имя = "R"+Формат(СтрокаНачалаВерсии, "ЧДЦ=; ЧГ=0") + "C1";
			Ключ = ПоляВерсии.Получить(Отчет.Область(Имя).Текст);
			Имя = "R"+Формат(СтрокаНачалаВерсии, "ЧДЦ=; ЧГ=0") + "C2";
			Значение = Отчет.Область(Имя).Текст;
			Если ЗначениеЗаполнено(Значение) Тогда
				Если Ключ = Неопределено Тогда
					
					Если ЗначениеЗаполнено(ИмяТекущегоМассиваСтрок) И ЗначениеЗаполнено(Значение) Тогда
						ВерсияХранилища[ИмяТекущегоМассиваСтрок].Добавить(Значение);
					КонецЕсли; 
				Иначе
					Если ТипЗнч(ВерсияХранилища[Ключ]) = Тип("Массив") Тогда
						ИмяТекущегоМассиваСтрок = Ключ;
						ВерсияХранилища[ИмяТекущегоМассиваСтрок].Добавить(Значение);
					Иначе
						ВерсияХранилища[Ключ] = Значение;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
			
			СтрокаНачалаВерсии = СтрокаНачалаВерсии + 1;
		
		КонецЦикла; 
		
		ВерсииХранилища.Добавить(ВерсияХранилища);
		
	КонецЦикла;
	
	// Сохраняем версии
	Если ВерсииХранилища.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Если в отчете есть пустые пользователи - не загружаем
	Для Каждого ВерсияХранилища Из ВерсииХранилища Цикл
		Если Не ЗначениеЗаполнено(ВерсияХранилища.Пользователь) Тогда

			ЗаписьЖурналаРегистрации(НСтр("ru = 'Некорректный отчет из хранилища'", Метаданные.ОсновнойЯзык.КодЯзыка), 
			                         УровеньЖурналаРегистрации.Ошибка,
			                         ,
			                         ,
			                         ЗначениеВСтрокуВнутр(Отчет));						
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	МассивКодов = Новый Массив;
	Для каждого ВерсияХранилища Из ВерсииХранилища Цикл
		Версия = Число(ВерсияХранилища.Версия);
		Если Версия = 0 Тогда
			Продолжить;
		КонецЕсли; 
		МассивКодов.Добавить(Версия);
	
	КонецЦикла;
	
	Если МассивКодов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ВерсииХранилища");
		ЭлементБлокировки.УстановитьЗначение("Владелец", Хранилище);
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииХранилища.Ссылка,
		|	ВерсииХранилища.Код
		|ИЗ
		|	Справочник.ВерсииХранилища КАК ВерсииХранилища
		|ГДЕ
		|	ВерсииХранилища.Владелец = &Хранилище
		|	И ВерсииХранилища.Код В(&Коды)";
		
		Запрос.УстановитьПараметр("Коды", МассивКодов);
		Запрос.УстановитьПараметр("Хранилище", Хранилище);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТаблицаВерсий = РезультатЗапроса.Выгрузить();
		ТаблицаВерсий.Индексы.Добавить("Код");
		
		Для каждого ВерсияХранилища Из ВерсииХранилища Цикл
			Версия = Число(ВерсияХранилища.Версия);
			Если Версия = 0 Тогда
				Продолжить;
			КонецЕсли; 
			НайденнаяСтрока = ТаблицаВерсий.Найти(Версия, "Код");
			Если НайденнаяСтрока = Неопределено Тогда
				
				Объект = Справочники.ВерсииХранилища.СоздатьЭлемент();
				
			Иначе
				
				Объект = НайденнаяСтрока.Ссылка.ПолучитьОбъект();
				Объект.ЗначенияРеквизитовДоЗаписи(Ложь); // Кэширование значений "до записи" сразу после чтения из СУБД.
				
			КонецЕсли; 
			
			Объект.Владелец = Хранилище;
			Объект.Код = Версия;
			
			Попытка
				ВремяСоздания = СтрЗаменить(ВерсияХранилища.ВремяСоздания, ":", "");
				Если СтрДлина(ВремяСоздания) = 5 Тогда
					ВремяСоздания = "0" + ВремяСоздания;
				КонецЕсли; 
				Объект.ДатаСоздания = Дата(Прав(СокрЛП(ВерсияХранилища.ДатаСоздания), 4) + Сред(ВерсияХранилища.ДатаСоздания,4,2) + Лев(ВерсияХранилища.ДатаСоздания, 2) + ВремяСоздания);
			Исключение
				
			КонецПопытки; 
			
			Объект.Пользователь = ВерсияХранилища.Пользователь;
			Объект.Комментарий  = ВерсияХранилища.Комментарий;
			
			Объект.Состав.Очистить();
			Для каждого ОбъектМетаданных Из ВерсияХранилища.Добавлены Цикл
				
				НоваяСтрока = Объект.Состав.Добавить();
				НоваяСтрока.Тип = "Добавлено";
				НоваяСтрока.ОбъектМетаданных = ОбъектМетаданных;
				
			КонецЦикла;
			Для каждого ОбъектМетаданных Из ВерсияХранилища.Изменены Цикл
				
				НоваяСтрока = Объект.Состав.Добавить();
				НоваяСтрока.Тип = "Изменено";
				НоваяСтрока.ОбъектМетаданных = ОбъектМетаданных;
				
			КонецЦикла;
			Для каждого ОбъектМетаданных Из ВерсияХранилища.Удалены Цикл
				
				НоваяСтрока = Объект.Состав.Добавить();
				НоваяСтрока.Тип = "Удалено";
				НоваяСтрока.ОбъектМетаданных = ОбъектМетаданных;
				
			КонецЦикла;
			Объект.Записать();
			
		КонецЦикла; 
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОписаниеОшибки();
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Загрузка версий хранилища конфигурации'", Метаданные.ОсновнойЯзык.КодЯзыка),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ХранилищаКонфигураций,
			Хранилище,
			ТекстОшибки);
			
		ВызватьИсключение ТекстОшибки;
	КонецПопытки; 
	
КонецПроцедуры

// Фиксирует ошибку обработки версии хранилища.
//
// Параметры:
//   ВерсияХранилища - СправочникСсылка.ВерсииХранилища - Версия хранилища.
//   Ошибка - Строка, ИнформацияОбОшибке - Ошибка.
//
Функция ВозниклаОшибка(Знач ВерсияХранилища, Знач Ошибка) Экспорт
	НачатьТранзакцию();
	ВерсияОбъект = ЗаблокироватьИПолучитьОбъект(ВерсияХранилища);
	Если ВерсияОбъект = Неопределено Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	Если ВерсияОбъект.ВозниклаОшибка
		И ВерсияОбъект.КоличествоОшибок > КонвертацияХранилища.МаксимальноеКоличествоОшибокВерсии() Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	
	ВерсияОбъект.ВозниклаОшибка = Истина;
	ВерсияОбъект.КоличествоОшибок = ВерсияОбъект.КоличествоОшибок + 1;
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		ТекстОшибки = Строка(Ошибка);
	КонецЕсли;
	ВерсияОбъект.ТекстОшибки =
		Лев(
			Формат(ВерсияОбъект.КоличествоОшибок, "ЧГ=")
			+ ". "
			+ ТекстОшибки
			+ Символы.ПС
			+ Символы.ПС
			+ ВерсияОбъект.ТекстОшибки,
			25000);
	
	ВерсияОбъект.ДополнительныеСвойства.Вставить("ОчищатьКаталогВерсииВТекущемСеансе", Ложь);
	ВерсияОбъект.Записать();
	ЗафиксироватьТранзакцию();
	
	// После этого регламентным заданием ОчисткаОтМусора вызывается процедура СброситьОшибку (см. ниже).
	
	Возврат Истина;
КонецФункции

// Останавливает коммиты в хранилище при наличии критичной ошибки.
//
// Параметры:
//   ВерсияХранилища - СправочникСсылка.ВерсииХранилища - Версия хранилища.
//
Функция ОстановитьКонвертацию(Знач ВерсияХранилища) Экспорт
	ЗначенияРеквизитов = Новый Структура;
	ЗначенияРеквизитов.Вставить("ВозниклаОшибка", Истина);
	ЗначенияРеквизитов.Вставить("КоличествоОшибок", Макс(4107, КонвертацияХранилища.МаксимальноеКоличествоОшибокВерсии()));
	Возврат УстановитьЗначенияРеквизитов(ВерсияХранилища, ЗначенияРеквизитов);
КонецФункции

// Устанавливает новое состояние для версии хранилища.
//
// Параметры:
//   ВерсияХранилища - СправочникСсылка.ВерсииХранилища - Ссылка на версию.
//   ПараметрыВерсии - Неопределено, Структура, СтрокаТаблицыЗначений
//       - См. Справочники.ВерсииХранилища.ПараметрыВерсии или КонвертацияХранилища.КонтекстРаботыСВерсией.
//   ОжидаемоеСостояние - ПеречислениеСсылка.СостоянияВерсии -
//       Значение реквизита Состояние которое ожидается у объекта после получения его из базы данных.
//       Если состояние отличается от ожидаемого, то транзакция отменяется и возвращется Ложь.
//   СостояниеВПроцессе - ПеречислениеСсылка.СостоянияВерсии -
//       Значение реквизита Состояние которое будет установлено версии на период обработки.
//   ЗначенияРеквизитов - Неопределено, Структура - 
//       Дополнительные значения реквизитов, которые необходимо изменить у версии.
//
// Возвращаемое значение:
//   Булево - Истина, если удалось начать обработку версии, Ложь - если не удалось.
//
Функция НачатьОбработкуВерсии(Знач ВерсияХранилища, ПараметрыВерсии, Знач ОжидаемоеСостояние, Знач СостояниеВПроцессе, Знач ЗначенияРеквизитов = Неопределено) Экспорт
	Если ПараметрыВерсии <> Неопределено
		И ПараметрыВерсии.Состояние <> ОжидаемоеСостояние Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	ВерсияОбъект = ЗаблокироватьИПолучитьОбъект(ВерсияХранилища);
	Если ВерсияОбъект = Неопределено
		Или ВерсияОбъект.ВозниклаОшибка
		Или ВерсияОбъект.Состояние <> ОжидаемоеСостояние Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	ВерсияОбъект.ДатаНачалаОбработкиСостояния = ТекущаяДата();
	ВерсияОбъект.Состояние = СостояниеВПроцессе;
	Если ЗначенияРеквизитов <> Неопределено Тогда
		Для Каждого КлючИЗначение Из ЗначенияРеквизитов Цикл
			ВерсияОбъект[КлючИЗначение.Ключ] = КлючИЗначение.Значение; // Явно проверяется наличие реквизита.
		КонецЦикла;
	КонецЕсли;
	ВерсияОбъект.Записать();
	ЗафиксироватьТранзакцию();
	
	Если ПараметрыВерсии <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыВерсии, ВерсияОбъект);
		Если ТипЗнч(ПараметрыВерсии) = Тип("Структура") И ПараметрыВерсии.Свойство("ИмяФайлаЛога") Тогда
			КонвертацияХранилища.ДополнитьКонтекстРаботыСВерсией(ПараметрыВерсии);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

// Устанавливает новые значения реквизитов.
Функция УстановитьЗначенияРеквизитов(Знач ВерсияХранилища, Знач ЗначенияРеквизитов, Знач ДопСвойства = Неопределено) Экспорт
	НачатьТранзакцию();
	ВерсияОбъект = ЗаблокироватьИПолучитьОбъект(ВерсияХранилища);
	Если ВерсияОбъект = Неопределено Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	ЕстьИзменения = Ложь;
	Для Каждого КлючИЗначение Из ЗначенияРеквизитов Цикл // Явно проверяется наличие реквизита.
		Если ВерсияОбъект[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
			ЕстьИзменения = Истина;
			ВерсияОбъект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьИзменения Или ДопСвойства <> Неопределено Тогда
		Если ДопСвойства <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВерсияОбъект.ДополнительныеСвойства, ДопСвойства, Истина);
		КонецЕсли;
		ВерсияОбъект.Записать();
	КонецЕсли;
	ЗафиксироватьТранзакцию();
	Возврат Истина;
КонецФункции

Функция ЗаблокироватьИПолучитьОбъект(ВерсияХранилища)
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ВерсииХранилища");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ВерсияХранилища);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		ВерсияОбъект = ВерсияХранилища.ПолучитьОбъект();
		ВерсияОбъект.ЗначенияРеквизитовДоЗаписи(Ложь); // Кэширование значений "до записи" сразу после чтения из СУБД.
		Возврат ВерсияОбъект;
	Исключение
		Подробно = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Блокировка версии для изменения'"),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Справочники.ВерсииХранилища,
			ВерсияХранилища,
			Подробно);
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось заблокировать версию %1 для изменения:%2'"),
			ВерсияХранилища,
			Символы.ПС + Подробно);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция СледующаяВерсия(Хранилище, КодТекущейВерсии) Экспорт
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", Хранилище);
	Отбор.Вставить("ПерваяВерсия", КодТекущейВерсии);
	
	Запрос = ЗапросПоЭлементам(Отбор, "Код", 1);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() > 0 Тогда
		Структура = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Таблица[0]);
		Возврат Структура;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПредыдущаяВерсия(Хранилище, КодТекущейВерсии) Экспорт
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", Хранилище);
	Отбор.Вставить("ПоследняяВерсия", КодТекущейВерсии - 1);
	
	Запрос = ЗапросПоЭлементам(Отбор, "Код УБЫВ", 1);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() > 0 Тогда
		Структура = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Таблица[0]);
		Возврат Структура;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция КодПредыдущейВерсииПолностьюВыгруженнойВXML(Хранилище, КодТекущейВерсии) Экспорт
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", Хранилище);
	Отбор.Вставить("ПоследняяВерсия", КодТекущейВерсии - 1);
	Отбор.Вставить("ВыгруженыТолькоИзменения", Ложь);
	Отбор.Вставить("Состояние", Перечисления.СостоянияВерсии.СостоянияВКоторыхЕстьXML());
	
	Запрос = ЗапросПоЭлементам(Отбор, "Код УБЫВ", 1);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() > 0 Тогда
		Возврат Таблица[0].Код;
	Иначе
		Возврат 1;
	КонецЕсли;
КонецФункции

Функция СостоянияПодготавливаемыхВерсий(Знач ПараметрыХранилища, Знач ДополнительныйОтбор = Неопределено, Знач КоличествоПервых = Неопределено) Экспорт
	Если КоличествоПервых = Неопределено Тогда
		КоличествоПервых = ПараметрыХранилища.МаксимальноеКоличествоПодготавливаемыхВерсий;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", ПараметрыХранилища.Ссылка);
	Отбор.Вставить("ПерваяВерсия", ПараметрыХранилища.ПерваяВерсия);
	Отбор.Вставить("ПоследняяВерсия", ПараметрыХранилища.ПоследняяВерсия);
	Отбор.Вставить("ПомещенаВGit", Ложь);
	
	Если ДополнительныйОтбор <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Отбор, ДополнительныйОтбор, Ложь);
	КонецЕсли;
	
	Запрос = ЗапросПоЭлементам(Отбор, "Код", КоличествоПервых);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Возвращает запрос по справочнику по указанному отборы и параметрам.
Функция ЗапросПоЭлементам(Отбор, ПоляУпорядочивания = "Код", КоличествоПервых = 10) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.Код КАК Код,
	|	Таблица.ПометкаУдаления КАК ПометкаУдаления,
	|	Таблица.Владелец КАК Владелец,
	|	Таблица.ВозниклаОшибка КАК ВозниклаОшибка,
	|	Таблица.ВыгруженыТолькоИзменения КАК ВыгруженыТолькоИзменения,
	|	Таблица.ДатаНачалаОбработкиСостояния КАК ДатаНачалаОбработкиСостояния,
	|	Таблица.ДатаСоздания КАК ДатаСоздания,
	|	Таблица.Источник КАК Источник,
	|	Таблица.КаталогВременныхФайлов КАК КаталогВременныхФайлов,
	|	Таблица.КоличествоМетаданных КАК КоличествоМетаданных,
	|	Таблица.КоличествоОшибок КАК КоличествоОшибок,
	|	Таблица.Комментарий КАК Комментарий,
	|	Таблица.Пользователь КАК Пользователь,
	|	Таблица.Состояние КАК Состояние,
	|	Таблица.ТребуетсяПолнаяВыгрузка КАК ТребуетсяПолнаяВыгрузка,
	|	Таблица.Хеш КАК Хеш
	|ПОМЕСТИТЬ ОтобранныеВерсии
	|ИЗ
	|	Справочник.ВерсииХранилища КАК Таблица
	|ГДЕ
	|	&ФрагментыУсловий
	|
	|УПОРЯДОЧИТЬ ПО
	|	&ПоляУпорядочивания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтобранныеВерсии.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Изменения.Тип ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			КОГДА Изменения.Тип В (&ТипыДопускающиеВыгрузкуИзменений)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьИзмененияПрепятствующиеИнкрементальнойВыгрузке
	|ПОМЕСТИТЬ ИнформацияОСоставе
	|ИЗ
	|	ОтобранныеВерсии КАК ОтобранныеВерсии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВерсииХранилища.Состав КАК Изменения
	|		ПО ОтобранныеВерсии.Ссылка = Изменения.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтобранныеВерсии.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтобранныеВерсии.Ссылка КАК Ссылка,
	|	ОтобранныеВерсии.Код КАК Код,
	|	ОтобранныеВерсии.ПометкаУдаления КАК ПометкаУдаления,
	|	ОтобранныеВерсии.Владелец КАК Владелец,
	|	ОтобранныеВерсии.ВозниклаОшибка КАК ВозниклаОшибка,
	|	ОтобранныеВерсии.ВыгруженыТолькоИзменения КАК ВыгруженыТолькоИзменения,
	|	ОтобранныеВерсии.ДатаНачалаОбработкиСостояния КАК ДатаНачалаОбработкиСостояния,
	|	ОтобранныеВерсии.ДатаСоздания КАК ДатаСоздания,
	|	ОтобранныеВерсии.Источник КАК Источник,
	|	ОтобранныеВерсии.КаталогВременныхФайлов КАК КаталогВременныхФайлов,
	|	ОтобранныеВерсии.КоличествоМетаданных КАК КоличествоМетаданных,
	|	ОтобранныеВерсии.КоличествоОшибок КАК КоличествоОшибок,
	|	ОтобранныеВерсии.Комментарий КАК Комментарий,
	|	ОтобранныеВерсии.Пользователь КАК Пользователь,
	|	ОтобранныеВерсии.Состояние КАК Состояние,
	|	ОтобранныеВерсии.ТребуетсяПолнаяВыгрузка КАК ТребуетсяПолнаяВыгрузка,
	|	ОтобранныеВерсии.Хеш КАК Хеш,
	|	ИнформацияОСоставе.ЕстьИзмененияПрепятствующиеИнкрементальнойВыгрузке КАК ЕстьИзмененияПрепятствующиеИнкрементальнойВыгрузке
	|ИЗ
	|	ОтобранныеВерсии КАК ОтобранныеВерсии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИнформацияОСоставе КАК ИнформацияОСоставе
	|		ПО ОтобранныеВерсии.Ссылка = ИнформацияОСоставе.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	&ПоляУпорядочивания";
	
	Запрос.УстановитьПараметр("ТипыДопускающиеВыгрузкуИзменений", 
		ОбщегоНазначения.МассивЗначений("Изменено", "Добавлено"));
	
	Если КоличествоПервых > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 1000", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоПервых, "ЧГ="));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 1000", "ВЫБРАТЬ");
	КонецЕсли;
	
	// Отборы.
	ФрагментыУсловий = Новый Массив;
	Для Каждого КлючИЗначение Из Отбор Цикл
		ИмяРеквизита = КлючИЗначение.Ключ;
		ЗначениеОтбора = КлючИЗначение.Значение;
		
		Если ИмяРеквизита = "ПерваяВерсия" Тогда
			Если ЗначениеОтбора > 0 Тогда
				ФрагментыУсловий.Добавить("Таблица.Код > &ПерваяВерсия");
				Запрос.УстановитьПараметр("ПерваяВерсия", ЗначениеОтбора);
			КонецЕсли;
			
		ИначеЕсли ИмяРеквизита = "ПоследняяВерсия" Тогда
			Если ЗначениеОтбора > 0 Тогда
				ФрагментыУсловий.Добавить("Таблица.Код <= &ПоследняяВерсия");
				Запрос.УстановитьПараметр("ПоследняяВерсия", ЗначениеОтбора);
			КонецЕсли;
			
		ИначеЕсли ИмяРеквизита = "ПомещенаВGit" Тогда
			Если ЗначениеОтбора Тогда
				ФрагментыУсловий.Добавить("Таблица.Состояние = &СостояниеПомещенаВGitВGit");
			Иначе
				ФрагментыУсловий.Добавить("Таблица.Состояние <> &СостояниеПомещенаВGitВGit");
			КонецЕсли;
			Запрос.УстановитьПараметр("СостояниеПомещенаВGitВGit", Перечисления.СостоянияВерсии.ПомещенаВGit);
			
		ИначеЕсли ИмяРеквизита = "КаталогВременныхФайловУказан" Тогда
			Если ЗначениеОтбора Тогда
				ФрагментыУсловий.Добавить("Таблица.КаталогВременныхФайлов <> """"");
			Иначе
				ФрагментыУсловий.Добавить("Таблица.КаталогВременныхФайлов = """"");
			КонецЕсли;
			
		ИначеЕсли ИмяРеквизита = "ДатаНачалаОбработкиСостоянияМеньшеИлиРавно" Тогда
			ФрагментыУсловий.Добавить("Таблица.ДатаНачалаОбработкиСостояния > &ПустаяДата");
			ФрагментыУсловий.Добавить("Таблица.ДатаНачалаОбработкиСостояния <= &ДатаНачалаОбработкиСостояния");
			Запрос.УстановитьПараметр("ПустаяДата", '00010101');
			Запрос.УстановитьПараметр("ДатаНачалаОбработкиСостояния", ЗначениеОтбора);
			
		ИначеЕсли ИмяРеквизита = "КоличествоОшибокМеньше" Тогда
			ФрагментыУсловий.Добавить("Таблица.КоличествоОшибок < &КоличествоОшибок");
			Запрос.УстановитьПараметр("КоличествоОшибок", ЗначениеОтбора);
			
		Иначе // Стандартный отбор по реквизитам.
			
			// Фиксированный массив преобразуется в обычный.
			Если ТипЗнч(ЗначениеОтбора) = Тип("ФиксированныйМассив") Тогда
				ЗначениеОтбора = Новый Массив(ЗначениеОтбора);
			КонецЕсли;
			// Добавляется отбор.
			Если ТипЗнч(ЗначениеОтбора) = Тип("Массив") Тогда
				ФрагментыУсловий.Добавить(СтрШаблон("Таблица.%1 В (&%1)", ИмяРеквизита))
			Иначе
				ФрагментыУсловий.Добавить(СтрШаблон("Таблица.%1 = &%1", ИмяРеквизита))
			КонецЕсли;
			// Устанавливается значение отбора.
			Запрос.УстановитьПараметр(ИмяРеквизита, ЗначениеОтбора);
			
		КонецЕсли;
		
	КонецЦикла;
	Если ФрагментыУсловий.Количество() = 0 Тогда
		ФрагментыУсловий.Добавить("ИСТИНА"); // Выбор всех версий без ограничений выглядит ошибкой.
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФрагментыУсловий", СтрСоединить(ФрагментыУсловий, Символы.ПС + Символы.Таб + Символы.Таб + "И "));
	
	// Порядок.
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляУпорядочивания", ПоляУпорядочивания);
	
	Возврат Запрос;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОчисткаМусора

Процедура ПередЗаписьюВерсииОчиститьКаталогПриНеобходимости(ВерсияОбъект) Экспорт
	// Быстрая проверка для оптимизации (чтобы не получать параметры хранилища).
	Если Не ВерсияОбъект.ВозниклаОшибка
		И ЗначениеЗаполнено(ВерсияОбъект.Состояние)
		И ВерсияОбъект.Состояние <> Перечисления.СостоянияВерсии.ПомещенаВGit Тогда
		Возврат; // Версия в работе.
	КонецЕсли;
	
	Кэш = ВерсияОбъект.ДополнительныеСвойства;
	
	Если Кэш.Свойство("ПараметрыХранилища") Тогда
		ПараметрыХранилища = Кэш.ПараметрыХранилища;
	Иначе
		ПараметрыХранилища = КонвертацияХранилища.ПараметрыХранилища(ВерсияОбъект.Владелец);
	КонецЕсли;
	
	ТребуетсяАрхивацияИОчисткаКаталога = Ложь;
	Если ВерсияОбъект.ВозниклаОшибка
		И ЗначениеЗаполнено(ПараметрыХранилища.КаталогДляАрхивацииОшибок)
		И Константы.АрхивироватьОшибки.Получить() Тогда
		Если ВерсияОбъект.Состояние = Перечисления.СостоянияВерсии.ЗагружаетсяВEDT
			Или ВерсияОбъект.Состояние = Перечисления.СостоянияВерсии.ВыгружаетсяВXML
			Или ВерсияОбъект.Состояние = Перечисления.СостоянияВерсии.ПолучаетсяCF Тогда
			ТребуетсяАрхивацияИОчисткаКаталога = Истина;
		Иначе
			// Если включен флажок АрхивироватьОшибки и возникла ошибка при помещени в гит (Состояние = ПомещаетсяВGit),
			// то архивация невозможна - для расследования требуется сохранить текущее состояние хранилища.
			// В других состояниях (в состояниях успешного завершения - ПолученCF, ВыгруженаВXML, ЗагруженаВEDT, ПомещенаВGit)
			// флажок ВозниклаОшибка не должен быть установлен. Если так получилось, это тоже требует расследования вручную.
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТребуетсяОчисткаКаталога = Ложь;
	Если Не ЗначениеЗаполнено(ВерсияОбъект.Состояние) Тогда
		ТребуетсяОчисткаКаталога = Истина; // Состояние версии очищено.
	ИначеЕсли ВерсияОбъект.Состояние = Перечисления.СостоянияВерсии.ПомещенаВGit
		И ПараметрыХранилища.УдалятьВременныеДанныеВерсииПослеКоммита Тогда
		// Коммит завершен и включена настройка удаления файлов после коммита.
		Если ПараметрыХранилища.ВыгружатьИзменения Тогда
			ТребуетсяОчисткаКаталога = СледующаяВерсияПомещенаВGit(ВерсияОбъект); // Ждем пока следующая версия поместится в гит.
		Иначе
			ТребуетсяОчисткаКаталога = Истина; // Без выгрузки изменений не требуется ждать следующую версию - можно очищать сразу.
		КонецЕсли;
	КонецЕсли;
	
	Если Не ТребуетсяОчисткаКаталога И Не ТребуетсяАрхивацияИОчисткаКаталога Тогда
		Возврат;
	КонецЕсли;
	
	ОчищатьВТекущемСеансе = ОбщегоНазначения.ЗначениеСвойства(Кэш, "ОчищатьКаталогВерсииВТекущемСеансе");
	Если ТипЗнч(ОчищатьВТекущемСеансе) <> Тип("Булево") Тогда
		ОчищатьВТекущемСеансе = Ложь;
	КонецЕсли;
	Если Не ОчищатьВТекущемСеансе Тогда
		ОбщегоНазначения.ВыполнитьВФоне(
			Строка(ВерсияОбъект.Ссылка.УникальныйИдентификатор()),
			"Справочники.ВерсииХранилища.ДождатьсяОкончанияЗаписиВерсииИОчиститьКаталог",
			СтрШаблон(НСтр("ru = 'Удаление файлов версии %1'"), ВерсияОбъект.Код),
			ВерсияОбъект.Ссылка);
		Возврат;
	КонецЕсли;
	
	Если ТребуетсяАрхивацияИОчисткаКаталога Тогда
		
		КаталогДляАрхивацииОшибок = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПараметрыХранилища.КаталогДляАрхивацииОшибок);
		Попытка
			Если Не ОбщегоНазначения.КаталогСуществует(КаталогДляАрхивацииОшибок) Тогда
				СоздатьКаталог(КаталогДляАрхивацииОшибок);
			КонецЕсли;
			ШаблонПолноеИмениФайла = КаталогДляАрхивацииОшибок + Формат(ВерсияОбъект.Код, "ЧДЦ=0; ЧН=; ЧГ=") + "_bug%1.zip";
			Для НомерОшибки = 0 По 3 Цикл
				ФайлАрхива = Новый Файл(СтрШаблон(ШаблонПолноеИмениФайла, ?(НомерОшибки = 0, "", Строка(НомерОшибки))));
				Если ФайлАрхива.Существует() Тогда
					Продолжить;
				КонецЕсли;
				// Архивация каталога с логами и исходниками для воспроизведения возможной ошибки.
				ЗаписьZipФайла = Новый ЗаписьZipФайла(ФайлАрхива.ПолноеИмя);
				ЗаписьZipФайла.Добавить(
					ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ВерсияОбъект.КаталогВременныхФайлов),
					РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
					РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
				ЗаписьZipФайла.Записать();
				Прервать;
			КонецЦикла;
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Архивация каталога файлов версии'", Метаданные.ОсновнойЯзык.КодЯзыка),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.ВерсииХранилища,
				ВерсияОбъект.Ссылка,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
	
	ОчиститьКаталогВерсии(ВерсияОбъект, ПараметрыХранилища);
	
КонецПроцедуры

Функция СледующаяВерсияПомещенаВGit(ВерсияОбъект)
	СледующаяВерсия = Справочники.ВерсииХранилища.СледующаяВерсия(ВерсияОбъект.Владелец, ВерсияОбъект.Код);
	Возврат СледующаяВерсия <> Неопределено И СледующаяВерсия.Состояние = Перечисления.СостоянияВерсии.ПомещенаВGit;
КонецФункции

// Запускается при записи версии - при необходимости очистки ее каталога. Дожидается снятия объектной блокировки
//   (завершения записи версии), получает объект и перезаписывает версию. При записи каталог версии очищается
//   в той же процедуре, из которой вызывался данный метод - в процедуре ПередЗаписьюВерсииОчиститьКаталогПриНеобходимости.
//
// Параметры:
//   ВерсияХранилища - СправочникСсылка.ВерсииХранилища
//
Процедура ДождатьсяОкончанияЗаписиВерсииИОчиститьКаталог(Знач ВерсияХранилища) Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	ДопСвойства = Новый Структура("ОчищатьКаталогВерсииВТекущемСеансе", Истина);
	Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(ВерсияХранилища, Новый Структура, ДопСвойства);
КонецПроцедуры

// Удаление файлов версии.
Процедура ОчиститьКаталогВерсии(ВерсияОбъект, ПараметрыХранилища) Экспорт
	ВсеКаталогиОчищены = Истина;
	
	Если ЗначениеЗаполнено(ВерсияОбъект.КаталогВременныхФайлов) Тогда
		// Удаление каталога версии.
		Попытка
			УдалитьФайлы(ВерсияОбъект.КаталогВременныхФайлов);
		Исключение
			ВсеКаталогиОчищены = Ложь;
			ОбщегоНазначения.ЗаписатьОшибку(
				"ru = 'Очистка каталога файлов версии'",
				ИнформацияОбОшибке(),
				ВерсияОбъект.Ссылка);
		КонецПопытки;
		
		// Удаление "внешних" файлов Git.
		Попытка
			Каталог = Новый Файл(ВерсияОбъект.КаталогВременныхФайлов);
			Для Каждого НайденныйФайл Из НайтиФайлы(Каталог.Путь, Каталог.Имя + "*", Ложь) Цикл
				Если СтрНайти(НайденныйФайл.Имя, "_git_log") = 0 Тогда
					ОбщегоНазначения.УдалитьФайлИлиКаталог(НайденныйФайл.ПолноеИмя);
				КонецЕсли;
			КонецЦикла;
		Исключение
			ВсеКаталогиОчищены = Ложь;
			ОбщегоНазначения.ЗаписатьОшибку(
				"ru = 'Очистка файлов Git'",
				ИнформацияОбОшибке(),
				ВерсияОбъект.Ссылка);
		КонецПопытки;
	КонецЕсли;
	
	// Удаление кэшей 1С.
	Если ПолучитьФункциональнуюОпцию("ДобавлятьВременныеБазыВСписок") Тогда
		Попытка
			// https://its.1c.ru/db/v8327doc#bookmark:adm:TI000000368
			КаталогAppData = ОбщегоНазначения.СистемныйКаталог(26);
			КаталогLocalAppData = ОбщегоНазначения.СистемныйКаталог(28);
			Если ЗначениеЗаполнено(КаталогAppData) Тогда
				Если Не ЗначениеЗаполнено(КаталогLocalAppData) Тогда
					КаталогLocalAppData = КаталогAppData;
				КонецЕсли;
				
				КолонкиФайлаБаз = Новый Структура;
				КолонкиФайлаБаз.Вставить("ID", "Идентификатор");
				НайденныеФайлы = НайтиФайлы(КаталогAppData, "ibases.v8i", Истина);
				Для Каждого ФайлСпискаИБ Из НайденныеФайлы Цикл
					
					ТаблицаБаз = ОбщегоНазначения.ТаблицаИзIniФайла(ФайлСпискаИБ.ПолноеИмя, "UTF-8", КолонкиФайлаБаз);
					ЕстьИзменения = Ложь;
					
					ОбратныйИндекс = ТаблицаБаз.Количество();
					Пока ОбратныйИндекс > 0 Цикл
						ОбратныйИндекс = ОбратныйИндекс - 1;
						СтрокаТаблицыБаз = ТаблицаБаз[ОбратныйИндекс];
						Если СтрНачинаетсяС(СтрокаТаблицыБаз.СекцияНРег, НРег(ВерсияОбъект.КаталогВременныхФайлов)) Тогда
							НайденныеКаталоги = НайтиФайлы(КаталогLocalAppData, СтрокаТаблицыБаз.Идентификатор, Истина);
							Для Каждого НайденныйКаталог Из НайденныеКаталоги Цикл
								ОбщегоНазначения.УдалитьФайлИлиКаталог(НайденныйКаталог.ПолноеИмя);
							КонецЦикла;
							ТаблицаБаз.Удалить(ОбратныйИндекс);
							ЕстьИзменения = Истина;
						КонецЕсли;
					КонецЦикла;
					
					Если ЕстьИзменения Тогда
						ОбщегоНазначения.ТаблицаВIniФайл(ТаблицаБаз, ФайлСпискаИБ.ПолноеИмя, "UTF-8");
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
		Исключение
			ВсеКаталогиОчищены = Ложь;
			ОбщегоНазначения.ЗаписатьОшибку(
				"ru = 'Очистка временных баз версии'",
				ИнформацияОбОшибке(),
				ВерсияОбъект.Ссылка);
		КонецПопытки;
	КонецЕсли;
	
	// Фиксация результата.
	Если ВсеКаталогиОчищены Тогда
		ВерсияОбъект.КаталогВременныхФайлов = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли