///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(Состояние) Тогда
		ЭтоНачалоОперации = (Перечисления.СостоянияВерсии.СостоянияПриНачалеОпераций().Найти(Состояние) <> Неопределено);
		Если ВозниклаОшибка И Не ЭтоНачалоОперации Тогда
			Текст = СтрШаблон(НСтр("ru = 'При включенном флажке ""Возникла ошибка"" у версии не может быть состояние %1.'"), Состояние);
			ОбщегоНазначения.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "Состояние");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитовДоЗаписи = ЗначенияРеквизитовДоЗаписи();
	ЭтоНачалоОперации = (Перечисления.СостоянияВерсии.СостоянияПриНачалеОпераций().Найти(Состояние) <> Неопределено);
	
	Если Не ОбщегоНазначения.КаталогСуществует(КаталогВременныхФайлов) Тогда
		КаталогВременныхФайлов = "";
	ИначеЕсли Не ЭтоНовый() Тогда
		Справочники.ВерсииХранилища.ПередЗаписьюВерсииОчиститьКаталогПриНеобходимости(ЭтотОбъект);
	КонецЕсли;
	
	// При очистке состояния также очищаются и другие реквизиты.
	Если Не ЗначениеЗаполнено(Состояние) Тогда
		КоличествоМетаданных = 0;
		Источник = Неопределено;
		ВозниклаОшибка = Ложь;
	КонецЕсли;
	
	// Каталог временных файлов должен быть заполнен в тот момент, когда версия поступает в обработку.
	Если Не ВозниклаОшибка И ЭтоНачалоОперации И Не ЗначениеЗаполнено(КаталогВременныхФайлов) Тогда
		ЗаполнитьКаталогВременныхФайлов();
	КонецЕсли;
	
	ЗаполнитьДатуНачалаОбработки = (ВозниклаОшибка Или ЭтоНачалоОперации);
	Если ЗаполнитьДатуНачалаОбработки <> ЗначениеЗаполнено(ДатаНачалаОбработки) Тогда
		Если ЗаполнитьДатуНачалаОбработки Тогда
			ДатаНачалаОбработки = ТекущаяДата();
		Иначе
			ДатаНачалаОбработки = '00010101';
		КонецЕсли;
	КонецЕсли;
	
	Если Состояние <> Перечисления.СостоянияВерсии.ПомещенаВGit Тогда
		Хеш = "";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Состояние)
		Или Состояние = Перечисления.СостоянияВерсии.ПолучаетсяCF
		Или Состояние = Перечисления.СостоянияВерсии.ПолученCF Тогда
		ВыгруженыТолькоИзменения = Ложь;
	КонецЕсли;
	
	Комментарий = СокрЛП(Комментарий);
	Если Комментарий <> "" Тогда
		ЗаполнитьАвтораКоммита();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитовДоЗаписи = ЗначенияРеквизитовДоЗаписи();
	
	Если ЗначенияРеквизитовДоЗаписи.ЭтоНовый Или Состояние <> ЗначенияРеквизитовДоЗаписи.Состояние Тогда
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		
		НаборЗаписей = РегистрыСведений.СостоянияВерсий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияХранилища.Установить(Ссылка);
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДатаСеанса);
		
		Сеанс = ПолучитьТекущийСеансИнформационнойБазы();
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекущаяДатаСеанса;
		Запись.ВерсияХранилища = Ссылка;
		Запись.Состояние = Состояние;
		Запись.НомерСеанса = Сеанс.НомерСеанса;
		Запись.НачалоСеанса = Сеанс.НачалоСеанса;
		
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначенияРеквизитовДоЗаписи(ЧитатьИзСУБД = Неопределено) Экспорт
	Результат = Неопределено;
	Если ДополнительныеСвойства.Свойство("ЗначенияРеквизитовДоЗаписи", Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЭтоНовый = ЭтоНовый();
	Если ЧитатьИзСУБД = Неопределено Тогда
		ЧитатьИзСУБД = Не ЭтоНовый;
	КонецЕсли;
	
	ИменаРеквизитов = "Состояние, ВозниклаОшибка, Комментарий";
	Если ЧитатьИзСУБД Тогда
		Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
	Иначе
		Результат = ОбщегоНазначения.ЗначенияСвойств(ЭтотОбъект, ИменаРеквизитов);
	КонецЕсли;
	Результат.Вставить("ЭтоНовый", ЭтоНовый);
	
	ДополнительныеСвойства.Вставить("ЗначенияРеквизитовДоЗаписи", Результат);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьКаталогВременныхФайлов()
	
	КаталогВыгрузкиВерсий = "";
	Если ЗначениеЗаполнено(Источник) Тогда
		КаталогВыгрузкиВерсий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "КаталогВыгрузкиВерсий");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КаталогВыгрузкиВерсий) Тогда
		КаталогВыгрузкиВерсий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "КаталогВыгрузкиВерсий");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КаталогВыгрузкиВерсий) Тогда
		КаталогВременныхФайлов = ОбщегоНазначения.ПолноеИмяКаталога(КаталогВыгрузкиВерсий, Истина, Ложь)
			+ Формат(Код, "ЧДЦ=0; ЧН=; ЧГ=") + ПолучитьРазделительПути();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьАвтораКоммита()
	
	СтандартнаяОбработка = Истина;
	КонвертацияХранилищаПереопределяемый.ПриОпределенииАвтораКоммита(ЭтотОбъект, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ПерваяСтрока = СтрПолучитьСтроку(Комментарий, 1);
	Массив = СтрРазделить(ПерваяСтрока, ":", Истина);
	Если Массив.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	ПредполагаемыйАвтор = Массив[0];
	
	Если СтрНайти(ПредполагаемыйАвтор, " ") > 0 Или СтрСравнить(Пользователь, ПредполагаемыйАвтор) = 0 Тогда
		Возврат; // Не имя пользователя, либо имя автора совпадает с именем коммиттера.
	КонецЕсли;
	Информация = КонвертацияХранилищаПовтИсп.ИнформацияОПользователе(Владелец, ПредполагаемыйАвтор);
	Если СтрНайти(Информация.EMail, "@") = 0 Тогда
		Возврат; // Не электронная почта.
	КонецЕсли;
	
	Автор = ПредполагаемыйАвтор;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли