#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(МассивСсылок, ПараметрыВыполненияКоманды)
	ТекстВопроса = НСтр("ru = 'Изменения по версиям не будут отражены в репозитории.
						|Вы уверены, что необходимо установить состояние ""Версия помещена""?'");
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("УстановитьСостояниеПомещенаВGitЗавершение", ЭтотОбъект, МассивСсылок);
	
	Кнопки = Новый СписокЗначений();
	Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Уверен, установить ""Версия помещена""'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, Кнопки);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеПомещенаВGitЗавершение(Ответ, МассивСсылок) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаКомандыНаСервере(МассивСсылок);
	Для Каждого Ссылка Из МассивСсылок Цикл
		ОповеститьОбИзменении(Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОбработкаКомандыНаСервере(МассивСсылок)
	Возврат Справочники.ВерсииХранилища.УстановитьСостояние(МассивСсылок, Перечисления.СостоянияВерсии.ПомещенаВGit);
КонецФункции

#КонецОбласти