///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
	
	Элементы.ВерсияПлатформы.ПодсказкаВвода = ОбщегоНазначения.ВерсияПлатформы();
	
	Элементы.ШаблонКаталогаПлатформы.ПодсказкаВвода = КонвертацияХранилища.ШаблонКаталогаПлатформыПоУмолчанию();
	СписокВыбораКаталогов = Элементы.ШаблонКаталогаПлатформы.СписокВыбора;
	Если СписокВыбораКаталогов.Количество() = 0 Тогда
		СписокВыбораКаталогов.Добавить(Элементы.ШаблонКаталогаПлатформы.ПодсказкаВвода);
		Если ЭтоWindowsСервер Тогда
			СписокВыбораКаталогов.Добавить("C:\Program files\1cv8\%ВерсияПлатформы%\bin");
			СписокВыбораКаталогов.Добавить("C:\Program files (x86)\1cv8\%ВерсияПлатформы%\bin");
		Иначе
			СписокВыбораКаталогов.Добавить("/opt/1cv8/x86_64/%ВерсияПлатформы%/");
			СписокВыбораКаталогов.Добавить("/opt/1C/v8.3/x86_64/");
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент)
	
	ИмяКонстанты = ИзменитьЗначениеРеквизита(Элемент.Имя);
	ОбновитьПовторноИспользуемыеЗначения();
	
	ОбновитьИнтерфейс = Истина;
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	
	Оповестить("Запись_НаборКонстант", Новый Структура, ИмяКонстанты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ИзменитьЗначениеРеквизита(Знач ИмяЭлемента)
	ИмяКонстанты = СохранитьЗначениеРеквизита(Элементы[ИмяЭлемента].ПутьКДанным);
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьФорму(ИмяКонстанты);
	Возврат ИмяКонстанты;
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(ПутьКДанным)
	Если ПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	ЧастиИмени = СтрРазделить(ПутьКДанным, ".");
	Если ЧастиИмени.Количество() <> 2 Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяКонстанты = ЧастиИмени[1];
	Если Константы[ИмяКонстанты].Получить() <> НаборКонстант[ИмяКонстанты] Тогда
		Константы[ИмяКонстанты].Установить(НаборКонстант[ИмяКонстанты]);
	КонецЕсли;
	
	Возврат ИмяКонстанты;
КонецФункции

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьФорму(ИмяКонстанты = "")
	Если ИмяКонстанты = "" Или ИмяКонстанты = "ШаблонКаталогаПлатформы" Тогда
		Элементы.ДоступныеПлатформы.Заголовок = СтрШаблон(НСтр("ru = 'Доступные версии: %1'"),
			СтрСоединить(ОбщегоНазначения.ДоступныеВерсииПлатформы(НаборКонстант.ШаблонКаталогаПлатформы), ", "));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НаборКонстант.КаталогEDT) Тогда
		Элементы.КаталогEDT.ОтметкаНезаполненного = Истина;
	Иначе
		Элементы.КаталогEDT.ОтметкаНезаполненного = Ложь;
		ФайлCLI = КонвертацияХранилищаПовтИсп.ФайлПрограммногоИнтерфейсаEDT(, НаборКонстант.КаталогEDT);
		Если ОбщегоНазначения.ФайлСуществует(ФайлCLI) Тогда
			Элементы.КаталогEDT.ЦветФона = ЦветаСтиля.ЦветФонаУспех;
		Иначе
			Элементы.КаталогEDT.ЦветФона = ЦветаСтиля.ЦветФонаПредупреждения;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаборКонстант.ШаблонКаталогаПлатформы) Тогда
		Шаблон = НаборКонстант.ШаблонКаталогаПлатформы;
	Иначе
		Шаблон = КонвертацияХранилища.ШаблонКаталогаПлатформыПоУмолчанию();
	КонецЕсли;
	Если ЗначениеЗаполнено(НаборКонстант.ВерсияПлатформы) Тогда
		ВерсияПлатформы = НаборКонстант.ВерсияПлатформы;
	Иначе
		ВерсияПлатформы = ОбщегоНазначения.ВерсияПлатформы();
	КонецЕсли;
	КаталогПлатформы = СтрЗаменить(Шаблон, "%ВерсияПлатформы%", ВерсияПлатформы);
	Если ОбщегоНазначения.КаталогСуществует(КаталогПлатформы) Тогда
		Элементы.ШаблонКаталогаПлатформы.ЦветФона = ЦветаСтиля.ЦветФонаУспех;
		Элементы.ВерсияПлатформы.ЦветФона = ЦветаСтиля.ЦветФонаУспех;
	Иначе
		Элементы.ШаблонКаталогаПлатформы.ЦветФона = ЦветаСтиля.ЦветФонаПредупреждения;
		Элементы.ВерсияПлатформы.ЦветФона = ЦветаСтиля.ЦветФонаПредупреждения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
