///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИБ

Процедура ЗаполнитьПредставленияРасписаний() Экспорт
	Выборка = Выбрать();
	Пока Выборка.Следующий() Цикл
		Выборка.Ссылка.ПолучитьОбъект().Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

// Возвращает запрос по справочнику по указанному отборы и параметрам.
Функция ЗапросПоЭлементам(Отбор, ПоляУпорядочивания = "", КоличествоПервых = 0) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.ПометкаУдаления КАК ПометкаУдаления,
	|	Таблица.Наименование КАК Наименование,
	|	Таблица.Адрес КАК Адрес,
	|	Таблица.АдресРепозиторияGit КАК АдресРепозиторияGit,
	|	Таблица.БазовыйПроект КАК БазовыйПроект,
	|	Таблица.ВерсияEDT КАК ВерсияEDT,
	|	Таблица.ВерсияEDTCLI КАК ВерсияEDTCLI,
	|	Таблица.ВерсияВGit КАК ВерсияВGit,
	|	Таблица.ВерсияПлатформыВыгрузки КАК ВерсияПлатформыВыгрузки,
	|	Таблица.ВерсияПлатформыХранилища КАК ВерсияПлатформыХранилища,
	|	Таблица.ВерсияПроектаEDT КАК ВерсияПроектаEDT,
	|	Таблица.ВозниклаОшибка КАК ВозниклаОшибка,
	|	Таблица.ВыгружатьИзменения КАК ВыгружатьИзменения,
	|	Таблица.ВыполнятьКоммиты КАК ВыполнятьКоммиты,
	|	Таблица.ДобавлятьМеткиСВерсиейКонфигурации КАК ДобавлятьМеткиСВерсиейКонфигурации,
	|	Таблица.ЗапретитьИспользованиеОбщихОчередей КАК ЗапретитьИспользованиеОбщихОчередей,
	|	Таблица.ИдентификаторЗадания КАК ИдентификаторЗадания,
	|	Таблица.ИмяВетки КАК ИмяВетки,
	|	Таблица.ИмяПользователяХранилища КАК ИмяПользователяХранилища,
	|	Таблица.ИмяПроектаEDT КАК ИмяПроектаEDT,
	|	Таблица.ИмяРасширения КАК ИмяРасширения,
	|	Таблица.ИспользованиеЗадания КАК ИспользованиеЗадания,
	|	Таблица.ИспользуетсяCLI КАК ИспользуетсяCLI,
	|	Таблица.КаталогВыгрузкиВерсий КАК КаталогВыгрузкиВерсий,
	|	Таблица.КаталогДляАрхивацииОшибок КАК КаталогДляАрхивацииОшибок,
	|	Таблица.КоличествоКоммитов КАК КоличествоКоммитов,
	|	Таблица.КоличествоОшибок КАК КоличествоОшибок,
	|	Таблица.ЛокальныйКаталогGit КАК ЛокальныйКаталогGit,
	|	Таблица.МаксимальноеКоличествоПодготавливаемыхВерсий КАК МаксимальноеКоличествоПодготавливаемыхВерсий,
	|	Таблица.МинимальноеКоличествоМетаданных КАК МинимальноеКоличествоМетаданных,
	|	Таблица.ОбрабатыватьВсеОчереди КАК ОбрабатыватьВсеОчереди,
	|	Таблица.Описание КАК Описание,
	|	Таблица.ОтключитьЛогирование КАК ОтключитьЛогирование,
	|	Таблица.ОтправлятьКоммитыВРепозиторийGit КАК ОтправлятьКоммитыВРепозиторийGit,
	|	Таблица.ПарольПользователяХранилища КАК ПарольПользователяХранилища,
	|	Таблица.ПарольСервераGit КАК ПарольСервераGit,
	|	Таблица.ПерваяВерсия КАК ПерваяВерсия,
	|	Таблица.ПользовательСервераGit КАК ПользовательСервераGit,
	|	Таблица.ПоследняяВерсия КАК ПоследняяВерсия,
	|	Таблица.ПредставлениеРасписания КАК ПредставлениеРасписания,
	|	Таблица.РазрешитьПомещатьАнонимноЕслиНеНайденПользователь КАК РазрешитьПомещатьАнонимноЕслиНеНайденПользователь,
	|	Таблица.ТекстОшибки КАК ТекстОшибки,
	|	Таблица.ТипХранилища КАК ТипХранилища,
	|	Таблица.УдалятьВременныеДанныеВерсииПослеКоммита КАК УдалятьВременныеДанныеВерсииПослеКоммита,
	|	Таблица.УдалятьКонфигурацииПоставщиков КАК УдалятьКонфигурацииПоставщиков
	|ИЗ
	|	Справочник.ХранилищаКонфигураций КАК Таблица";
	
	Если КоличествоПервых > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 1000", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоПервых, "ЧГ="));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 1000", "ВЫБРАТЬ");
	КонецЕсли;
	
	// Отборы.
	ФрагментыУсловий = Новый Массив;
	Для Каждого КлючИЗначение Из Отбор Цикл
		ИмяРеквизита = КлючИЗначение.Ключ;
		ЗначениеОтбора = КлючИЗначение.Значение;
		// Фиксированный массив преобразуем в обычный.
		Если ТипЗнч(ЗначениеОтбора) = Тип("ФиксированныйМассив") Тогда
			ЗначениеОтбора = Новый Массив(ЗначениеОтбора);
		КонецЕсли;
		Запрос.УстановитьПараметр(ИмяРеквизита, ЗначениеОтбора);
		Если ТипЗнч(ЗначениеОтбора) = Тип("Массив") Тогда
			ФрагментыУсловий.Добавить(СтрШаблон("Таблица.%1 В (&%1)", ИмяРеквизита))
		Иначе
			ФрагментыУсловий.Добавить(СтрШаблон("Таблица.%1 = &%1", ИмяРеквизита))
		КонецЕсли;
	КонецЦикла;
	Если ФрагментыУсловий.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|	" + СтрСоединить(ФрагментыУсловий, Символы.ПС + Символы.Таб + Символы.Таб + "И ");
	КонецЕсли;
	
	// Порядок.
	Если ЗначениеЗаполнено(ПоляУпорядочивания) Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	" + ПоляУпорядочивания;
	КонецЕсли;
	
	Возврат Запрос;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Фиксирует ошибку обработки версии хранилища.
//
// Параметры:
//   Хранилище - СправочникСсылка.ХранилищаКонфигураций - Хранилище.
//   Ошибка - Строка, ИнформацияОбОшибке - Ошибка.
//
Функция ВозниклаОшибка(Знач Хранилище, Знач Ошибка) Экспорт
	НачатьТранзакцию();
	ХранилищеОбъект = ЗаблокироватьИПолучитьОбъект(Хранилище);
	Если ХранилищеОбъект = Неопределено Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	
	ХранилищеОбъект.ВозниклаОшибка = Истина;
	ХранилищеОбъект.КоличествоОшибок = ХранилищеОбъект.КоличествоОшибок + 1;
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		ТекстОшибки = Строка(Ошибка);
	КонецЕсли;
	ХранилищеОбъект.ТекстОшибки =
		Лев(
			Строка(ХранилищеОбъект.КоличествоОшибок)
			+ ". "
			+ ТекстОшибки
			+ Символы.ПС
			+ Символы.ПС
			+ ХранилищеОбъект.ТекстОшибки,
			25000);
	
	ХранилищеОбъект.Записать();
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
КонецФункции

Процедура СброситьОшибку(Знач Хранилище) Экспорт
	
	СтруктураРеквизитов = Новый Структура("ВозниклаОшибка,КоличествоОшибок,ТекстОшибки");
	СтруктураРеквизитов.ВозниклаОшибка = Ложь;
	СтруктураРеквизитов.КоличествоОшибок = 0;
	СтруктураРеквизитов.ТекстОшибки = "";
	
	УстановитьЗначенияРеквизитов(Хранилище, СтруктураРеквизитов);
	
КонецПроцедуры

// Устанавливает новые значения реквизитов.
Функция УстановитьЗначенияРеквизитов(Знач Хранилище, Знач ЗначенияРеквизитов)
	НачатьТранзакцию();
	ХранилищеОбъект = ЗаблокироватьИПолучитьОбъект(Хранилище);
	Если ХранилищеОбъект = Неопределено Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	ЕстьИзменения = Ложь;
	Для Каждого КлючИЗначение Из ЗначенияРеквизитов Цикл // Явно проверяется наличие реквизита.
		Если ХранилищеОбъект[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
			ЕстьИзменения = Истина;
			ХранилищеОбъект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьИзменения Тогда
		ХранилищеОбъект.Записать();
	КонецЕсли;
	ЗафиксироватьТранзакцию();
	Возврат Истина;
КонецФункции

Функция ЗаблокироватьИПолучитьОбъект(Хранилище) Экспорт
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ХранилищаКонфигураций");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Хранилище);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		ХранилищеОбъект = Хранилище.ПолучитьОбъект();
		Возврат ХранилищеОбъект;
	Исключение
		Подробно = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Блокировка версии для изменения'"),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Справочники.ХранилищаКонфигураций,
			Хранилище,
			Подробно);
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось заблокировать версию %1 для изменения:%2'"),
			Хранилище,
			Символы.ПС + Подробно);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

#КонецОбласти

#КонецЕсли



