///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИБ

Процедура ЗаполнитьПредставленияРасписаний() Экспорт
	Выборка = Выбрать();
	Пока Выборка.Следующий() Цикл
		Выборка.Ссылка.ПолучитьОбъект().Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

// Возвращает запрос по справочнику по указанному отборы и параметрам.
Функция ЗапросПоЭлементам(Отбор, ПоляУпорядочивания = "", КоличествоПервых = 0) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.ПометкаУдаления КАК ПометкаУдаления,
	|	Таблица.Наименование КАК Наименование,
	|	Таблица.Адрес КАК Адрес,
	|	Таблица.АдресРепозиторияGit КАК АдресРепозиторияGit,
	|	Таблица.ВерсияВGit КАК ВерсияВGit,
	|	Таблица.ВерсияПлатформыХранилища КАК ВерсияПлатформыХранилища,
	|	Таблица.ВыгружатьИзменения КАК ВыгружатьИзменения,
	|	Таблица.ВыполнятьКоммиты КАК ВыполнятьКоммиты,
	|	Таблица.ЗапретитьИспользованиеОбщихОчередей КАК ЗапретитьИспользованиеОбщихОчередей,
	|	Таблица.ИмяВетки КАК ИмяВетки,
	|	Таблица.ИмяПользователяХранилища КАК ИмяПользователяХранилища,
	|	Таблица.КаталогВыгрузкиВерсий КАК КаталогВыгрузкиВерсий,
	|	Таблица.ИмяПроектаEDT КАК ИмяПроектаEDT,
	|	Таблица.КаталогДляАрхивацииОшибок КАК КаталогДляАрхивацииОшибок,
	|	Таблица.КоличествоКоммитов КАК КоличествоКоммитов,
	|	Таблица.ЛокальныйКаталогGit КАК ЛокальныйКаталогGit,
	|	Таблица.МаксимальноеКоличествоПодготавливаемыхВерсий КАК МаксимальноеКоличествоПодготавливаемыхВерсий,
	|	Таблица.МинимальноеКоличествоМетаданных КАК МинимальноеКоличествоМетаданных,
	|	Таблица.ОбрабатыватьВсеОчереди КАК ОбрабатыватьВсеОчереди,
	|	Таблица.Описание КАК Описание,
	|	Таблица.ОтправлятьКоммитыВРепозиторийGit КАК ОтправлятьКоммитыВРепозиторийGit,
	|	Таблица.ПарольПользователяХранилища КАК ПарольПользователяХранилища,
	|	Таблица.ПарольСервераGit КАК ПарольСервераGit,
	|	Таблица.ПерваяВерсия КАК ПерваяВерсия,
	|	Таблица.ПользовательСервераGit КАК ПользовательСервераGit,
	|	Таблица.ПоследняяВерсия КАК ПоследняяВерсия,
	|	Таблица.РазрешитьПомещатьАнонимноЕслиНеНайденПользователь КАК РазрешитьПомещатьАнонимноЕслиНеНайденПользователь,
	|	Таблица.ИдентификаторЗадания КАК ИдентификаторЗадания,
	|	Таблица.УдалятьВременныеДанныеВерсииПослеКоммита КАК УдалятьВременныеДанныеВерсииПослеКоммита,
	|	Таблица.УдалятьКонфигурацииПоставщиков КАК УдалятьКонфигурацииПоставщиков,
	|	Таблица.ВерсияВGit.Код КАК КодВерсииВGit,
	|	Таблица.ВозниклаОшибка КАК ВозниклаОшибка,
	|	Таблица.КоличествоОшибок КАК КоличествоОшибок
	|ИЗ
	|	Справочник.ХранилищаКонфигураций КАК Таблица";
	
	Если КоличествоПервых > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 1000", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоПервых, "ЧГ="));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 1000", "ВЫБРАТЬ");
	КонецЕсли;
	
	// Отборы.
	ФрагментыУсловий = Новый Массив;
	Для Каждого КлючИЗначение Из Отбор Цикл
		ИмяРеквизита = КлючИЗначение.Ключ;
		ЗначениеОтбора = КлючИЗначение.Значение;
		// Фиксированный массив преобразуем в обычный.
		Если ТипЗнч(ЗначениеОтбора) = Тип("ФиксированныйМассив") Тогда
			ЗначениеОтбора = Новый Массив(ЗначениеОтбора);
		КонецЕсли;
		Запрос.УстановитьПараметр(ИмяРеквизита, ЗначениеОтбора);
		Если ТипЗнч(ЗначениеОтбора) = Тип("Массив") Тогда
			ФрагментыУсловий.Добавить(СтрШаблон("Таблица.%1 В (&%1)", ИмяРеквизита))
		Иначе
			ФрагментыУсловий.Добавить(СтрШаблон("Таблица.%1 = &%1", ИмяРеквизита))
		КонецЕсли;
	КонецЦикла;
	Если ФрагментыУсловий.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|	" + СтрСоединить(ФрагментыУсловий, Символы.ПС + Символы.Таб + Символы.Таб + "И ");
	КонецЕсли;
	
	// Порядок.
	Если ЗначениеЗаполнено(ПоляУпорядочивания) Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	" + ПоляУпорядочивания;
	КонецЕсли;
	
	Возврат Запрос;
КонецФункции

#КонецОбласти

#КонецЕсли



