///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Отбор = Новый Структура();
	Если ЗначениеЗаполнено(ТекущийОбъект.Источник) Тогда
		Отбор.Вставить("Ключ", Строка(ТекущийОбъект.Источник.УникальныйИдентификатор()));
	Иначе
		Отбор.Вставить("Ключ", Строка(ТекущийОбъект.Ссылка.УникальныйИдентификатор()));
	КонецЕсли; 
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	
	Если МассивФоновыхЗаданий.Количество() > 0 Тогда
		Задание = МассивФоновыхЗаданий[0];
		СостояниеЗадания = НСтр("ru = 'Выполняется обработка с %Дата%'");
		СостояниеЗадания = СтрЗаменить(СостояниеЗадания, "%Дата%", Задание.Начало);
		
		Элементы.ГруппаСостояние.Видимость = Истина;
		ФоновоеЗаданиеПрочитатьПромежуточныйРезультат(Задание.УникальныйИдентификатор);
		
	Иначе
		СостояниеЗадания = "";
		Элементы.ГруппаСостояние.Видимость = Ложь;
	КонецЕсли;
	
	ПрефиксИмениФайла = Перечисления.СостоянияВерсии.ПрефиксИмениФайла(ТекущийОбъект.Состояние);
	ИмяФайлаЛога = ОбщегоНазначения.ИмяФайлаЛога(ТекущийОбъект.КаталогВременныхФайлов, ПрефиксИмениФайла);
	
	Если ТекущийОбъект.Состояние = Перечисления.СостоянияВерсии.ПомещаетсяВGit
		Или ТекущийОбъект.Состояние = Перечисления.СостоянияВерсии.ПомещенаВGit Тогда
		КаталогВременныхФайловБезСлеша = ОбщегоНазначения.УдалитьКонечныйРазделительПути(ТекущийОбъект.КаталогВременныхФайлов);
		ИмяФайлаЛогаGit = КаталогВременныхФайловБезСлеша + "_git_log.txt";
	Иначе
		ИмяФайлаЛогаGit = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьОбработкуВерсии(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьОбработкуВерсииНаСервере(Объект.Ссылка);
	
	Прочитать();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояние(Команда)
	
	Прочитать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФайлаЛогаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ИмяФайлаЛога) Тогда
		Возврат;
	КонецЕсли;
	
	Текст = Новый ТекстовыйДокумент();
	
	ИмяФайла = "";
	ПрочитатьТекстовыйФайлНаСервере(ИмяФайлаЛога, Текст, ИмяФайла);
	
	Текст.Показать(ИмяФайла, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаЛогаGitОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ИмяФайлаЛогаGit) Тогда
		Возврат;
	КонецЕсли;
	Текст = Новый ТекстовыйДокумент();
	ИмяФайла = "";
	ПрочитатьТекстовыйФайлНаСервере(ИмяФайлаЛогаGit, Текст, ИмяФайла);
	Текст.Показать(ИмяФайла, ИмяФайла);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗапуститьОбработкуВерсииНаСервере(ВерсияХранилища)
	
	ОбщегоНазначения.ВыполнитьВФоне(
		Строка(ВерсияХранилища.УникальныйИдентификатор()),
		"КонвертацияХранилища.ВыгрузитьВерсиюВXMLИЗагрузитьВEDT",
		СтрШаблон(НСтр("ru = 'Обработка версии %1'"), ВерсияХранилища),
		ВерсияХранилища);
	
КонецПроцедуры

&НаСервере
Процедура ФоновоеЗаданиеПрочитатьПромежуточныйРезультат(ФоновоеЗаданиеИдентификатор)
	Прогресс = ДлительныеОперации.ПрочитатьПрогресс(ФоновоеЗаданиеИдентификатор);
	Если Прогресс <> Неопределено Тогда
		ФоновоеЗаданиеПроцент   = Прогресс.Процент;
		ФоновоеЗаданиеСостояние = Прогресс.Текст;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьТекстовыйФайлНаСервере(ПутьКФайлу, Текст, ИмяФайла, КодировкаСистемы = Ложь)
	
	ОбщегоНазначения.ПрочитатьТекстовыйФайл(ПутьКФайлу, Текст, ИмяФайла, КодировкаСистемы);
	
КонецПроцедуры

#КонецОбласти
