///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СостоянияПриНачалеОпераций = Перечисления.СостоянияВерсии.СостоянияПриНачалеОпераций();
	ЭтоНачалоОперации = (СостоянияПриНачалеОпераций.Найти(ТекущийОбъект.Состояние) <> Неопределено);
	Если ЗначениеЗаполнено(ТекущийОбъект.ДатаНачалаОбработки) И ЭтоНачалоОперации Тогда
		ДлительностьВСекундах = ТекущаяДата() - ТекущийОбъект.ДатаНачалаОбработки;
		ДлительностьОбработки = ОбщегоНазначения.ПредставлениеДлительностиКраткое(ДлительностьВСекундах);
	Иначе
		ДлительностьОбработки = "";
	КонецЕсли;
	Элементы.ДлительностьОбработки.Видимость = ЗначениеЗаполнено(ДлительностьОбработки);
	Элементы.ДлительностьОбработки.Заголовок = ДлительностьОбработки;
	
	ФоновоеЗаданиеПрочитатьПромежуточныйРезультат();
	
	ИмяФайлаЛога = "";
	ФайлЛогаGit = "";
	Если ЗначениеЗаполнено(ТекущийОбъект.КаталогВременныхФайлов) Тогда
		ПрефиксИмениФайла = Перечисления.СостоянияВерсии.ПрефиксИмениФайла(ТекущийОбъект.Состояние);
		ИмяФайлаЛога = ОбщегоНазначения.ИмяФайлаЛога(ТекущийОбъект.КаталогВременныхФайлов, ПрефиксИмениФайла);
		КаталогВременныхФайловБезСлеша = ОбщегоНазначения.УдалитьКонечныйРазделительПути(ТекущийОбъект.КаталогВременныхФайлов);
		ФайлЛогаGit = КонвертацияХранилища.ПолноеИмяФайлаЛогаGit(КаталогВременныхФайловБезСлеша);
	КонецЕсли;
	Элементы.ИмяФайлаЛога.Видимость = ОбщегоНазначения.ФайлСуществует(ИмяФайлаЛога);
	Элементы.ФайлЛогаGit.Видимость = ОбщегоНазначения.ФайлСуществует(ФайлЛогаGit);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьОбработкуВерсии(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьОбработкуВерсииНаСервере(Объект.Ссылка);
	
	Прочитать();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояние(Команда)
	
	Прочитать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФайлаЛогаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ИмяФайлаЛога) Тогда
		Возврат;
	КонецЕсли;
	
	Текст = СтрокаИзФайла(ИмяФайлаЛога);
	Если ЗначениеЗаполнено(Текст) Тогда
		ОбщегоНазначенияКлиент.ПоказатьТекст(Текст, ИмяФайлаЛога, ИмяФайлаЛога);
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Лог пустой'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаЛогаGitОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ФайлЛогаGit) Тогда
		Возврат;
	КонецЕсли;
	Текст = СтрокаИзФайла(ФайлЛогаGit);
	Если ЗначениеЗаполнено(Текст) Тогда
		ОбщегоНазначенияКлиент.ПоказатьТекст(Текст, ФайлЛогаGit, ФайлЛогаGit);
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Лог пустой'"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗапуститьОбработкуВерсииНаСервере(ВерсияХранилища)
	
	ОбщегоНазначения.ВыполнитьВФоне(
		Строка(ВерсияХранилища.УникальныйИдентификатор()),
		"КонвертацияХранилища.ВыгрузитьВерсиюВXMLИЗагрузитьВEDT",
		СтрШаблон(НСтр("ru = 'Обработка версии %1'"), ВерсияХранилища),
		ВерсияХранилища);
	
КонецПроцедуры

&НаСервере
Процедура ФоновоеЗаданиеПрочитатьПромежуточныйРезультат()
	Элементы.ФоновоеЗаданиеГруппа.Видимость = Ложь;
	СостояниеВерсии = КонвертацияХранилища.СостояниеВерсии(Объект.Ссылка);
	СеансВерсии = КонвертацияХранилища.СеансВерсии(СостояниеВерсии);
	Если СеансВерсии <> Неопределено Тогда
		Задание = СеансВерсии.ПолучитьФоновоеЗадание();
		Если Задание <> Неопределено Тогда
			Прогресс = ДлительныеОперации.ПрочитатьПрогресс(Задание.УникальныйИдентификатор);
			Если Прогресс <> Неопределено Тогда
				ФоновоеЗаданиеПроцент = Прогресс.Процент;
				ФоновоеЗаданиеСостояние = Прогресс.Текст;
				Элементы.ФоновоеЗаданиеГруппа.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтрокаИзФайла(ПолноеИмяФайла, Кодировка = Неопределено)
	Возврат СтроковыеФункции.СтрокаИзФайла(ПолноеИмяФайла, Кодировка);
КонецФункции

&НаКлиенте
Процедура ПодробнееНажатие(Элемент)
	ЗаголовокТекста = СтрШаблон(НСтр("ru = 'Ошибки обработки версии %1'"), Формат(Объект.Код, "ЧН=; ЧГ="));
	ОбщегоНазначенияКлиент.ПоказатьТекст(Объект.ТекстОшибки, ЗаголовокТекста);
КонецПроцедуры

#КонецОбласти
