///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьИсполняемыйФайл(Знач СтрокаКоманды, Знач КаталогВременныхФайлов, Знач ИмяСобытия, Знач ИмяФайлаЛога, ВКонсоли = Истина, ИмяФайлаЛогаВКодировкеANSI = Неопределено) Экспорт
	Если ВКонсоли Тогда
		ПолноеИмяКоманды = ?(ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер(), "cmd /C ", "bash -c ") + СтрокаКоманды;
	Иначе
		ПолноеИмяКоманды = СтрокаКоманды;
	КонецЕсли;
	
	ТекстЛога = СтрШаблон("ru='Запуск исполняемого файла %1'", + КаталогВременныхФайлов + ПолноеИмяКоманды);
	ОбщегоНазначения.ЗаписатьВЛог(ИмяФайлаЛога, 3, ИмяСобытия, ТекстЛога);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(ПолноеИмяКоманды, КаталогВременныхФайлов, Истина, КодВозврата);
	
	Если ИмяФайлаЛогаВКодировкеANSI <> Неопределено И ОбщегоНазначения.ФайлСуществует(ИмяФайлаЛогаВКодировкеANSI) Тогда
		Текст = СтроковыеФункции.СтрокаИзФайла(ИмяФайлаЛогаВКодировкеANSI, КодировкаТекста.ANSI);
		Если ЗначениеЗаполнено(Текст) Тогда
			Лог = Новый ЗаписьТекста(ИмяФайлаЛога, , , Истина);
			Лог.ЗаписатьСтроку(Текст);
			Лог.Закрыть();
			Лог = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ТекстЛога = СтрШаблон("ru='Завершение исполняемого файла. Код возврата: %1'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
	ОбщегоНазначения.ЗаписатьВЛог(ИмяФайлаЛога, ?(ЗначениеЗаполнено(КодВозврата), 1, 3), ИмяСобытия, ТекстЛога);
	
	Возврат КодВозврата;
КонецФункции

Функция ЗапущенныеПроцессы(ИмяКомпьютера = ".") Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИмяВРег", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПутьКФайлу", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ИдентификаторРодителя", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("КоманднаяСтрока", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИмяПользователя", Новый ОписаниеТипов("Строка"));
	
	ИменаСвойствПроцесса = "Name,CommandLine,CreationDate,CSName,ExecutablePath,ParentProcessID,ProcessID";
	ШаблонОписанияПроцесса = Новый ФиксированнаяСтруктура(ИменаСвойствПроцесса);
	
	// TODO: Поддержка linux.
	Попытка
		
		WMIService = ПолучитьCOMОбъект("winmgmts:{impersonationLevel=impersonate}!\\" + ИмяКомпьютера + "\root\cimv2");
		ProcessList = WMIService.ExecQuery("Select * from Win32_Process");
		
		// См. https://docs.microsoft.com/ru-ru/windows/desktop/CIMWin32Prov/win32-process.
		Для Каждого Win32_Process Из ProcessList Цикл
			ОписаниеПроцесса = Новый Структура(ШаблонОписанияПроцесса);
			ЗаполнитьЗначенияСвойств(ОписаниеПроцесса, Win32_Process, ИменаСвойствПроцесса);
			
			СтрокаТаблицы = Результат.Добавить();
			СтрокаТаблицы.Имя = ОписаниеПроцесса.Name;
			СтрокаТаблицы.ИмяВРег = ВРег(СокрЛП(СтрокаТаблицы.Имя));
			СтрокаТаблицы.ПутьКФайлу = ОписаниеПроцесса.ExecutablePath;
			СтрокаТаблицы.Идентификатор = ОписаниеПроцесса.ProcessID;
			СтрокаТаблицы.ИдентификаторРодителя = ОписаниеПроцесса.ParentProcessID;
			СтрокаТаблицы.КоманднаяСтрока = ОписаниеПроцесса.CommandLine;
			Если ЗначениеЗаполнено(ОписаниеПроцесса.CreationDate) Тогда
				СтрокаТаблицы.ДатаНачала = Дата(Лев(ОписаниеПроцесса.CreationDate, 14));
			КонецЕсли;
			ИмяПользователя = "";
			ИмяДомена = "";
			Win32_Process.GetOwner(ИмяПользователя, ИмяДомена);
			Если ЗначениеЗаполнено(ИмяПользователя) Или ЗначениеЗаполнено(ИмяДомена) Тогда
				СтрокаТаблицы.ИмяПользователя = ИмяДомена + "\" + ИмяПользователя;
			Иначе
				СтрокаТаблицы.ИмяПользователя = "System";
			КонецЕсли;
		КонецЦикла;
		
	Исключение
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗавершитьЗависшийПроцесс(КаталогВременныхФайлов, ВерсияХранилища, ОписаниеПроцесса) Экспорт
	
	ИдентификаторСтрокой = Формат(ОписаниеПроцесса.Идентификатор, "ЧН=; ЧГ=");
	ПредставлениеПроцесса = ОписаниеПроцесса.Имя + " (" + ИдентификаторСтрокой + ")";
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"ru = 'Процесс %1 будет снят, поскольку завис: выполняется с %2 (сейчас %3).'",
		ПредставлениеПроцесса,
		ОписаниеПроцесса.ДатаНачала,
		ТекущаяДатаСеанса());
	ОбщегоНазначения.ЗаписатьОшибку("ru = 'Очистка мусора'", ТекстОшибки, ВерсияХранилища);
	
	ИмяФайлаЛога = ОбщегоНазначения.ИмяФайлаЛога(КаталогВременныхФайлов, "PKill");
	
	// TODO: Поддержка linux.
	Если ОписаниеПроцесса.ИмяВРег = ВРег("java.exe") Тогда
		// Собрать дамп при помощи утилиты jstack.
		ПредставлениеОперации = "ru = 'Сбор дампа java при помощи jstack'";
		
		ВыполняемаяКоманда = "JStack -l [PID] > [Catalog][PID]_threaddump.txt";
		ВыполняемаяКоманда = СтрЗаменить(ВыполняемаяКоманда, "[PID]", ИдентификаторСтрокой);
		ВыполняемаяКоманда = СтрЗаменить(ВыполняемаяКоманда, "[Catalog]", КаталогВременныхФайлов);
		
		ВыполнитьИсполняемыйФайл(ВыполняемаяКоманда, КаталогВременныхФайлов, ПредставлениеОперации, ИмяФайлаЛога);
	КонецЕсли;
	
	// Снять процесс.
	ПредставлениеОперации = СтрШаблон("ru = 'Снятие процесса %1'", ОписаниеПроцесса.Имя);
	
	ВыполняемаяКоманда = "TaskKill /PID [PID] /T /F";
	ВыполняемаяКоманда = СтрЗаменить(ВыполняемаяКоманда, "[PID]", ИдентификаторСтрокой);
	
	ВыполнитьИсполняемыйФайл(ВыполняемаяКоманда, КаталогВременныхФайлов, ПредставлениеОперации, ИмяФайлаЛога);
	
КонецПроцедуры

#КонецОбласти