Процедура ЗаписатьНачалоОбработки(Знач Хранилище) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Хранилище.Установить(Хранилище);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Хранилище = Хранилище;
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	Сеанс = ПолучитьТекущийСеансИнформационнойБазы();
	
	Запись.НомерСеанса = Сеанс.НомерСеанса;
	Запись.НачалоСеанса = Сеанс.НачалоСеанса;
	Запись.НачалоОбработки = ТекущаяДатаСеанса();
	Запись.ЗавершениеОбработки = Неопределено;
	
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ЗарегистрироватьОшибку(Знач Хранилище, Знач Ошибка) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Хранилище.Установить(Хранилище);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Хранилище = Хранилище;
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	Запись.ВозниклаОшибка = Истина;
	Запись.КоличествоОшибок = Запись.КоличествоОшибок + 1;
	
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		ТекстОшибки = Строка(Ошибка);
	КонецЕсли;
	Запись.ТекстыОшибок =
		Лев(
			Строка(Запись.КоличествоОшибок)
			+ ". " + Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd HH:mm:ss'") + " "
			+ ТекстОшибки
			+ Символы.ПС
			+ Символы.ПС
			+ Запись.ТекстыОшибок,
			25000);
	
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ЗаписатьУспешноеЗавершениеОбработки(Знач Хранилище) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Хранилище.Установить(Хранилище);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Хранилище = Хранилище;
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	Запись.ВозниклаОшибка = Ложь;
	Запись.КоличествоОшибок = 0;
	Запись.ТекстыОшибок = "";
	Запись.ЗавершениеОбработки = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();
КонецПроцедуры

