///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
	Элементы.ВерсияПлатформыВыгрузки.ПодсказкаВвода = КонвертацияХранилищаПовтИсп.ВерсияПлатформыПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ОграничитьДиапазонВерсий Тогда
		ТекущийОбъект.ПерваяВерсия = 0;
		ТекущийОбъект.ПоследняяВерсия = 0;
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Расписание", Расписание);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Использование", Объект.ИспользованиеЗадания);
	Если ТекущийОбъект.Наименование = ТекущийАдрес Тогда
		ТекущийОбъект.Наименование = ТекущийОбъект.Адрес;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьСостояниеНаКлиенте();
	ТекущийАдрес = Объект.Адрес;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Возврат; // Действие не требуется.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВерсияПлатформыВыгрузкиПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПлатформыХранилищаПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеЗаданияПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	ДиалогРасписания.Показать(Новый ОписаниеОповещения("РасписаниеСтрокойНажатиеЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаЛогаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ИмяФайлаЛога) Тогда
		Возврат;
	КонецЕсли;
	
	Текст = Новый ТекстовыйДокумент();
	
	ИмяФайла = "";
	ПрочитатьТекстовыйФайлНаСервере(ИмяФайлаЛога, Текст, ИмяФайла);
	
	Текст.Показать(ИмяФайла, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛокальныйКаталогGitПриИзменении(Элемент)
	
	ПроверитьНаличиеРепозитория();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресРепозиторияGitПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	ЗадатьВопросПроверкиДоступаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательСервераGitПриИзменении(Элемент)
	
	ЗадатьВопросПроверкиДоступаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольСервераGitПриИзменении(Элемент)
	
	ЗадатьВопросПроверкиДоступаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипХранилищаПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантGitПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьДиапазонВерсийПриИзменении(Элемент)
	
	Если Не ОграничитьДиапазонВерсий Тогда
		Объект.ПерваяВерсия = 0;
		Объект.ПоследняяВерсия = 0;
	КонецЕсли;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеХранилищаТекстыОшибокНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗаголовокЛога = СтрШаблон(НСтр("ru = 'Конвертация хранилища %1'"), Объект.Наименование);
	ОбщегоНазначенияКлиент.ПоказатьТекст(СостояниеХранилища.ТекстыОшибок, ЗаголовокЛога, "repo_log.txt");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСостояние(Команда)
	
	ОбновитьСостояниеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьКонвертацию(Команда)
	
	ЗапуститьКонвертациюНаСервере();
	Если Не Элементы.ОбновлятьСостояниеАвтоматически.Пометка Тогда
		ОбновлятьСостояниеАвтоматически(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоммиты(Команда)
	
	ВыполнитьКоммитыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлятьСостояниеАвтоматически(Команда)
	
	Элементы.ОбновлятьСостояниеАвтоматически.Пометка = Не Элементы.ОбновлятьСостояниеАвтоматически.Пометка;
	
	Если Элементы.ОбновлятьСостояниеАвтоматически.Пометка Тогда
		ПодключитьОбработчикОжидания("ОбновитьСостояниеНаКлиенте", 10);
	Иначе
		ОтключитьОбработчикОжидания("ОбновитьСостояниеНаКлиенте");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРепозиторийGit(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ЛокальныйКаталогGit) Тогда
	
		ПоказатьПредупреждение(, НСтр("ru = 'Не указан локальный каталог репозитория Git'"));
		Возврат;
	
	КонецЕсли; 
	
	Если Модифицированность ИЛИ Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		Если НЕ Записать() Тогда
		
			Возврат;
		
		КонецЕсли; 
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.АдресРепозиторияGit) Тогда

		Результат = ПроверитьДоступКРепозиториюGitНаСервере();

		Если Не Результат.Успешно Тогда
			ПоказатьПредупреждение( , НСтр("ru = 'Ошибка доступа к репозиторию на сервере:'") + Символы.ПС
				+ Результат.ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		ОбновитьИменаВеток(Результат.Ветки);
		
		Если Результат.Ветки.Количество() > 0 Тогда

			Оповещение = Новый ОписаниеОповещения("СоздатьРепозиторийGitНаСервереОтвет", ЭтотОбъект);
			ТекстВопроса = НСтр("ru = 'Указанный репозиторий на сервере не пустой, содержит ветки.
										  |Всё равно, создать новый локальный репозиторий?'");
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Создать новый, установить адрес!'"));
			Если Результат.Ветки.Найти(Объект.ИмяВетки) <> Неопределено Тогда
				Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Клонировать эту ветку с сервера'"));
			Иначе
				Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Клонировать с сервера и создать ветку'"));
			КонецЕсли;
			Кнопки.Добавить(КодВозвратаДиалога.Отмена);
			ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Отмена, НСтр("ru = 'Внимание!'"));
			Возврат;
		КонецЕсли;
	
	КонецЕсли; 
	
	ТекстЛога = Новый ТекстовыйДокумент();
	СоздатьРепозиторийGitНаСервере(ТекстЛога);
	ТекстЛога.Показать(НСтр("ru = 'Лог операции'"), "log.txt");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВерсииИзОтчетаПоХранилищу(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Отчет по версиям хранилища(*.mxl)|*.mxl";
	Диалог.ПроверятьСуществованиеФайла = Истина;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьВерсииИзОтчетаПоХранилищуВыбор", ЭтотОбъект);
	
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАдресРепозиторияGit(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.АдресРепозиторияGit) Тогда
	
		ПоказатьПредупреждение(, НСтр("ru = 'Не указан адрес репозитория на сервере Git'"));
		Возврат;
	
	КонецЕсли; 
	
	Если Модифицированность Тогда
	
		Если НЕ Записать() Тогда
		
			Возврат;
		
		КонецЕсли; 
	
	КонецЕсли;
	
	Результат = ПроверитьДоступКРепозиториюGitНаСервере();
	
	Если НЕ Результат.Успешно Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Ошибка доступа к репозиторию на сервере:'") + Символы.ПС + Результат.ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ОбновитьИменаВеток(Результат.Ветки);
	
	Если Результат.Ветки.Найти(Объект.ИмяВетки) <> Неопределено Тогда
		
		Оповещение = Новый ОписаниеОповещения("УстановитьАдресРепозиторияGitОтвет", ЭтотОбъект);
		ТекстВопроса = СтрШаблон(НСтр("ru = 'Ветка %1 существует на сервере. При отправке изменений могут возникнуть конфилкты, которые необходимо будет разрешить вручную.
									  |Установить адрес сервера?'"), Объект.ИмяВетки);
		Кнопки = Новый СписокЗначений();
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Понимаю, установить адрес сервера!'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Выбрать другую ветку'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, ,КодВозвратаДиалога.Отмена, НСтр("ru = 'Внимание!'"));
		Возврат;
	КонецЕсли;
	
	УстановитьАдресРепозиторияGitНаКлиенте(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступКРепозиториюGit(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.АдресРепозиторияGit) Тогда
	
		ПоказатьПредупреждение(, НСтр("ru = 'Не указан адрес репозитория на сервере Git'"));
		Возврат;
	
	КонецЕсли; 
	
	Результат = ПроверитьДоступКРепозиториюGitНаСервере();
	
	Если НЕ Результат.Успешно Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Ошибка доступа к репозиторию на сервере:'") + Символы.ПС + Результат.ТекстОшибки);
		Возврат;
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Проверка доступа к репозиторию на сервере выполнена успешно.
		|На сервере веток:'") + " " + Результат.Ветки.Количество());
	КонецЕсли;
	
	ОбновитьИменаВеток(Результат.Ветки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписокВеток(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.АдресРепозиторияGit) Тогда
	
		ПоказатьПредупреждение(, НСтр("ru = 'Не указан адрес репозитория на сервере Git'"));
		Возврат;
	
	КонецЕсли;
	
	Результат = ПроверитьДоступКРепозиториюGitНаСервере();
	
	Если НЕ Результат.Успешно Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Ошибка запроса списка веток:'") + Символы.ПС + Результат.ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ОбновитьИменаВеток(Результат.Ветки);
	
	Если Результат.Ветки.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ВыборИмениВеткиОтвет", ЭтотОбъект);
		Элементы.ИмяВетки.СписокВыбора.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Выберите ветку серверного репозитория'"));
	Иначе
		ПоказатьПредупреждение( , НСтр("ru = 'На сервере 0 веток.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатистику(Команда)
	ОбновитьСтатистикуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.ТипХранилища) Тогда
		Объект.ТипХранилища = Метаданные.Справочники.ХранилищаКонфигураций.Реквизиты.ТипХранилища.ЗначениеЗаполнения;
	КонецЕсли;
	
	ФайлCLI = КонвертацияХранилищаПовтИсп.ФайлПрограммногоИнтерфейсаEDT(Объект.ВерсияEDTCLI);
	ФайлCLIСуществует = ОбщегоНазначения.ФайлСуществует(ФайлCLI);
	
	ОбновитьСостояниеНаСервере();
	
	УстановитьПривилегированныйРежим(Истина);
	Задание = РегламентныеЗаданияСервер.Задание(Объект.ИдентификаторЗадания);
	Если Задание <> Неопределено Тогда
		Объект.ИспользованиеЗадания = Задание.Использование;
		Расписание = Задание.Расписание;
		РасписаниеСтрокой = Строка(Расписание);
	Иначе
		Объект.ИспользованиеЗадания = Ложь;
		Расписание = Новый РасписаниеРегламентногоЗадания;
		РасписаниеСтрокой = РасписаниеСтрокой + Строка(Расписание);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	ПроверитьНаличиеРепозитория();
	
	ТекущийАдрес = Объект.Адрес;
	
	ОграничитьДиапазонВерсий = ЗначениеЗаполнено(Объект.ПерваяВерсия) Или ЗначениеЗаполнено(Объект.ПоследняяВерсия);
	
	Если ЗначениеЗаполнено(Объект.АдресРепозиторияGit) Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ВариантGit = "Сервер";
	Иначе
		ВариантGit = "Локально";
	КонецЕсли;
	
	КаталогВременныхФайлов = Объект.КаталогВыгрузкиВерсий + "Common" + ПолучитьРазделительПути();
	ИмяФайлаЛога = ОбщегоНазначения.ИмяФайлаЛога(КаталогВременныхФайлов, "ReportDB");
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	ОбщегоНазначения.ОбновитьСвертываемыеГруппы(ЭтотОбъект);
	
	Элементы.ВыполнятьКоммиты.Доступность = РепозиторийСоздан;
	
	ЭтоРасширение = Объект.ТипХранилища = Перечисления.ТипыХранилищаКонфигураций.Расширение;
	Элементы.БазовыйПроект.Видимость = ЭтоРасширение;
	Элементы.ИмяРасширения.Видимость = ЭтоРасширение;
	
КонецПроцедуры

#Область СвертываемыеГруппы

&НаСервере
Процедура ПриОпределенииСвертываемыхГрупп(Группы) Экспорт
	Группы.Добавить(Элементы.Хранилище1СГруппа);
	Группы.Добавить(Элементы.EDTГруппа);
	Группы.Добавить(Элементы.ВыгрузкаXMLГруппа);
	Группы.Добавить(Элементы.НастройкиГруппа);
	Группы.Добавить(Элементы.GitГруппа);
	Группы.Добавить(Элементы.РезультатыГруппа);
	Группы.Добавить(Элементы.СтатистикаГруппа);
КонецПроцедуры

&НаСервере
Процедура ПослеДобавленияЭлементовСвертываемыхГрупп() Экспорт
	// Действие не требуется.
КонецПроцедуры

&НаСервере
Процедура ПриОпределенииСвойствСвертываемойГруппы(Группа, НастройкиГруппы) Экспорт
	
	Если Группа = Элементы.Хранилище1СГруппа Тогда
		ОбновитьЭлементыГруппыХранилище1С(Группа, НастройкиГруппы);
		
	ИначеЕсли Группа = Элементы.EDTГруппа Тогда
		ОбновитьЭлементыГруппыEDT(Группа, НастройкиГруппы);
		
	ИначеЕсли Группа = Элементы.ВыгрузкаXMLГруппа Тогда
		ОбновитьЭлементыГруппыВыгрузкаXML(Группа, НастройкиГруппы);
		
	ИначеЕсли Группа = Элементы.НастройкиГруппа Тогда
		ОбновитьЭлементыГруппыНастройки(Группа, НастройкиГруппы);
		
	ИначеЕсли Группа = Элементы.GitГруппа Тогда
		ОбновитьЭлементыГруппыGit(Группа, НастройкиГруппы);
		
	ИначеЕсли Группа = Элементы.РезультатыГруппа Тогда
		ОбновитьЭлементыГруппыРезультаты(Группа, НастройкиГруппы);
		
	ИначеЕсли Группа = Элементы.СтатистикаГруппа Тогда
		ОбновитьЭлементыГруппыСтатистика(Группа, НастройкиГруппы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвернутьРазвернутьГруппу(Элемент) Экспорт
	СвернутьРазвернутьГруппу(Элемент.Имя);
КонецПроцедуры

&НаСервере
Процедура СвернутьРазвернутьГруппу(ИмяЭлемента)
	ОбщегоНазначения.СвернутьРазвернутьГруппу(ЭтотОбъект, ИмяЭлемента);
КонецПроцедуры

#КонецОбласти

#Область Хранилище1С

&НаСервере
Процедура ОбновитьЭлементыГруппыХранилище1С(Группа, НастройкиГруппы)
	НастройкиГруппы.Обязательная = Истина;
	НастройкиГруппы.Заполнена = ЗначениеЗаполнено(Объект.Адрес) И ЗначениеЗаполнено(Объект.ИмяПользователяХранилища);
	Если НастройкиГруппы.Развернута Тогда
		Если ЗначениеЗаполнено(Объект.ВерсияПлатформыВыгрузки) Тогда
			Элементы.ВерсияПлатформыХранилища.ПодсказкаВвода = Объект.ВерсияПлатформыВыгрузки;
		Иначе
			Элементы.ВерсияПлатформыХранилища.ПодсказкаВвода = КонвертацияХранилищаПовтИсп.ВерсияПлатформыПоУмолчанию();
		КонецЕсли;
		Элементы.ПерваяВерсия.Видимость = ОграничитьДиапазонВерсий;
		Элементы.ПоследняяВерсия.Видимость = ОграничитьДиапазонВерсий;
	ИначеЕсли НастройкиГруппы.Заполнена Тогда
		Представления = Новый Массив;
		Представления.Добавить(Объект.Адрес);
		Представления.Добавить(Объект.ИмяПользователяХранилища);
		Если ЗначениеЗаполнено(Объект.ВерсияПлатформыХранилища) Тогда
			Представления.Добавить(СтрШаблон(НСтр("ru = 'Платформа %1'"), Объект.ВерсияПлатформыХранилища));
		КонецЕсли;
		Если ОграничитьДиапазонВерсий Тогда
			Если ЗначениеЗаполнено(Объект.ПерваяВерсия) Тогда
				Представления.Добавить(СтрШаблон(НСтр("ru = 'с коммита %1'"), Формат(Объект.ПерваяВерсия, "ЧГ=")));
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.ПоследняяВерсия) Тогда
				Представления.Добавить(СтрШаблон(НСтр("ru = 'до коммита %1'"), Формат(Объект.ПоследняяВерсия, "ЧГ=")));
			КонецЕсли;
		Иначе
			Представления.Добавить(НСтр("ru = 'без ограничений по номеру'"));
		КонецЕсли;
		НастройкиГруппы.Представление = СтрСоединить(Представления, ", ");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаXML

&НаСервере
Процедура ОбновитьЭлементыГруппыВыгрузкаXML(Группа, НастройкиГруппы)
	НастройкиГруппы.Заполнена = Истина;
	Если НастройкиГруппы.Развернута Тогда
		Если ЗначениеЗаполнено(Объект.ВерсияПлатформыХранилища) Тогда
			Элементы.ВерсияПлатформыВыгрузки.ПодсказкаВвода = Объект.ВерсияПлатформыХранилища;
		Иначе
			Элементы.ВерсияПлатформыВыгрузки.ПодсказкаВвода = КонвертацияХранилищаПовтИсп.ВерсияПлатформыПоУмолчанию();
		КонецЕсли;
	Иначе
		Представления = Новый Массив;
		Если ЗначениеЗаполнено(Объект.ВерсияПлатформыВыгрузки) Тогда
			Представления.Добавить(СтрШаблон(НСтр("ru = 'Платформа %1'"), Объект.ВерсияПлатформыВыгрузки));
		КонецЕсли;
		Если Объект.ВыгружатьИзменения Тогда
			Представления.Добавить(НСтр("ru = 'Выгружать изменения'"));
		КонецЕсли;
		Если Объект.УдалятьКонфигурацииПоставщиков Тогда
			Представления.Добавить(НСтр("ru = 'Удалять конфигурации поставщиков'"));
		КонецЕсли;
		НастройкиГруппы.Представление = СтрСоединить(Представления, ", ");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область EDT

&НаСервере
Процедура ОбновитьЭлементыГруппыEDT(Группа, НастройкиГруппы)
	НастройкиГруппы.Обязательная = Истина;
	НастройкиГруппы.Заполнена = ФайлCLIСуществует;
	Если НастройкиГруппы.Развернута Тогда
		Если ФайлCLIСуществует Тогда
			Элементы.ФайлEDTПодсказка.Заголовок = ФайлCLI;
		Иначе
			Элементы.ФайлEDTПодсказка.Заголовок = СтрШаблон(НСтр("ru = 'На сервере не найден файл EDT по пути ""%1"".'"), ФайлCLI);
		КонецЕсли;
	ИначеЕсли НастройкиГруппы.Заполнена Тогда
		Представления = Новый Массив;
		Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВерсийEDT")
			И ЗначениеЗаполнено(Объект.ВерсияEDTCLI) Тогда
			Представления.Добавить(Объект.ВерсияEDTCLI);
		ИначеЕсли ФайлCLIСуществует Тогда
			Представления.Добавить(ФайлCLI);
		КонецЕсли;
		НастройкиГруппы.Представление = СтрСоединить(Представления, ", ");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Git

&НаСервере
Процедура ОбновитьЭлементыГруппыGit(Группа, НастройкиГруппы)
	НастройкиГруппы.Обязательная = Истина;
	НастройкиГруппы.Заполнена = ЗначениеЗаполнено(Объект.ЛокальныйКаталогGit) И ЗначениеЗаполнено(Объект.ИмяВетки);
	Если НастройкиГруппы.Развернута Тогда
		
		Элементы.СоздатьРепозиторийGit.Доступность = Не РепозиторийСоздан;
		Элементы.ФормаСоздатьРепозиторийGit.Доступность = Не РепозиторийСоздан;
		
		ЕстьАдрес = ЗначениеЗаполнено(Объект.АдресРепозиторияGit);
		
		ЭтоHTTPАдрес = ЭтоHTTPАдрес(Объект.АдресРепозиторияGit);
		
		Элементы.ПользовательСервераGit.АвтоОтметкаНезаполненного = ЭтоHTTPАдрес;
		Элементы.ПарольСервераGit.АвтоОтметкаНезаполненного = ЭтоHTTPАдрес;
		Элементы.ЗагрузитьСписокВеток.Доступность = ЕстьАдрес;
		Элементы.УстановитьАдресРепозиторияGit.Доступность = ЕстьАдрес И РепозиторийСоздан;
		Элементы.ПроверитьДоступКРепозиториюGit.Доступность = ЕстьАдрес;
		
		ЭтоСервер = ВариантGit = "Сервер";
		
		Элементы.Группа9.Видимость = ЭтоСервер;
		Элементы.Группа10.Видимость = ЭтоСервер;
		
		
	Иначе
		Представления = Новый Массив;
		Если ЗначениеЗаполнено(Объект.АдресРепозиторияGit) Тогда
			Представления.Добавить(Объект.АдресРепозиторияGit);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ИмяВетки) Тогда
			Представления.Добавить(Объект.ИмяВетки);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ПользовательСервераGit) Тогда
			Представления.Добавить(Объект.ПользовательСервераGit);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ЛокальныйКаталогGit) Тогда
			Представления.Добавить(Объект.ЛокальныйКаталогGit);
		КонецЕсли;
		НастройкиГруппы.Представление = СтрСоединить(Представления, ", ");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Настройки

&НаСервере
Процедура ОбновитьЭлементыГруппыНастройки(Группа, НастройкиГруппы)
	НастройкиГруппы.Заполнена = Истина;
	Если Не НастройкиГруппы.Развернута Тогда
		Представления = Новый Массив;
		Если Объект.УдалятьВременныеДанныеВерсииПослеКоммита Тогда
			Представления.Добавить(НСтр("ru = 'Удалять временные файлы'"));
		КонецЕсли;
		Если Объект.ОтключитьЛогирование Тогда
			Представления.Добавить(НСтр("ru = 'Отключить логирование'"));
		Иначе
			Представления.Добавить(НСтр("ru = 'Включить логирование'"));
		КонецЕсли;
		Если Объект.МаксимальноеКоличествоПодготавливаемыхВерсий > 0 Тогда
			Представления.Добавить(СтрШаблон(НСтр("ru = 'Ограничение пула: %1 версий'"),
				Формат(Объект.МаксимальноеКоличествоПодготавливаемыхВерсий, "ЧГ=")));
		КонецЕсли;
		НастройкиГруппы.Представление = СтрСоединить(Представления, ", ");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Результаты

&НаСервере
Процедура ОбновитьЭлементыГруппыРезультаты(Группа, НастройкиГруппы)
	НастройкиГруппы.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
	Если Не НастройкиГруппы.Видимость Тогда
		Возврат;
	КонецЕсли;
	НастройкиГруппы.Заполнена = Истина;
	Если Не НастройкиГруппы.Развернута Тогда
		Представления = Новый Массив;
		Если ЗначениеЗаполнено(Объект.ВерсияВGit) Тогда
			Представления.Добавить(СтрШаблон(НСтр("ru = 'Версия в Git: %1'"), Объект.ВерсияВGit));
		КонецЕсли;
		Если СостояниеХранилища.ВозниклаОшибка Тогда
			Представления.Добавить(НСтр("ru = 'Возникла ошибка'"));
		КонецЕсли;
		Если СостояниеХранилища.КоличествоОшибок > 0 Тогда
			Представления.Добавить(СтрШаблон(НСтр("ru = 'Количество ошибок: %1'"), СостояниеХранилища.КоличествоОшибок));
		КонецЕсли;
		НастройкиГруппы.Представление = СтрСоединить(Представления, ", ");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеНаКлиенте()
	ОбновитьСостояниеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Чтение регистра. РегистрСведенийМенеджерЗаписи.<Имя регистра сведений>.
	МенеджерЗаписи = РеквизитФормыВЗначение("СостояниеХранилища");
	МенеджерЗаписи.Хранилище = Объект.Ссылка;
	МенеджерЗаписи.Прочитать();
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "СостояниеХранилища");
КонецПроцедуры

#КонецОбласти

#Область Статистика

&НаСервере
Процедура ОбновитьЭлементыГруппыСтатистика(Группа, НастройкиГруппы)
	НастройкиГруппы.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
	Если Не НастройкиГруппы.Видимость Тогда
		Возврат;
	КонецЕсли;
	НастройкиГруппы.Заполнена = Истина;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатистикуНаСервере()
	Для Каждого Элемент1 Из Элементы.СтатистикаГруппа.ПодчиненныеЭлементы Цикл
		Элемент1.Видимость = Истина;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВерсииХранилища.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВерсииХранилища.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|	И ВерсииХранилища.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ПомещенаВGit)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВерсииХранилища.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|	И ВерсииХранилища.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ЗагруженаВEDT),
	|		ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ПомещаетсяВGit))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВерсииХранилища.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|	И
	|	НЕ ВерсииХранилища.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ПустаяСсылка),
	|		ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ПомещаетсяВGit), ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ПомещенаВGit))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВерсииХранилища.Ссылка) КАК Количество,
	|	МАКСИМУМ(СостоянияВерсииСрезПоследних.Период) КАК Окончание,
	|	МИНИМУМ(СостоянияВерсииСрезПоследних.Период) КАК Начало
	|ПОМЕСТИТЬ ОбщаяСкорость
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВерсий.СрезПоследних КАК СостоянияВерсииСрезПоследних
	|		ПО ВерсииХранилища.Ссылка = СостоянияВерсииСрезПоследних.ВерсияХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|	И ВерсииХранилища.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ПомещенаВGit)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ОбщаяСкорость.Начало, ОбщаяСкорость.Окончание, ЧАС) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ОбщаяСкорость.Количество / РАЗНОСТЬДАТ(ОбщаяСкорость.Начало, ОбщаяСкорость.Окончание, ЧАС)
	|	КОНЕЦ КАК Скорость
	|ИЗ
	|	ОбщаяСкорость КАК ОбщаяСкорость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВерсииХранилища.Ссылка) КАК Количество,
	|	МАКСИМУМ(СостоянияВерсииСрезПоследних.Период) КАК Окончание,
	|	МИНИМУМ(СостоянияВерсииСрезПоследних.Период) КАК Начало
	|ПОМЕСТИТЬ ТекущаяСкорость
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВерсий.СрезПоследних КАК СостоянияВерсииСрезПоследних
	|		ПО ВерсииХранилища.Ссылка = СостоянияВерсииСрезПоследних.ВерсияХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|	И ВерсииХранилища.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ПомещенаВGit)
	|	И СостоянияВерсииСрезПоследних.Период >= &ПредыдущаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ТекущаяСкорость.Начало, ТекущаяСкорость.Окончание, ЧАС) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ТекущаяСкорость.Количество / РАЗНОСТЬДАТ(ТекущаяСкорость.Начало, ТекущаяСкорость.Окончание, ЧАС)
	|	КОНЕЦ КАК Скорость
	|ИЗ
	|	ТекущаяСкорость КАК ТекущаяСкорость";
	
	Запрос.УстановитьПараметр("ПредыдущаяДата", ТекущаяДатаСеанса() - 86400);
	Запрос.УстановитьПараметр("Хранилище", Объект.Ссылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[0].Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	ВсегоВерсий = ВыборкаДетальныеЗаписи.Количество;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[1].Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	ВыполненоКоммитов = ВыборкаДетальныеЗаписи.Количество;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[2].Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	КоличествоВерсийОбработано = ВыборкаДетальныеЗаписи.Количество;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[3].Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	КоличествоПодготавливаемыхВерсий = ВыборкаДетальныеЗаписи.Количество;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[5].Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	СредняяСкорость = ВыборкаДетальныеЗаписи.Скорость;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[7].Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	СредняяСкоростьЗаСутки = ВыборкаДетальныеЗаписи.Скорость;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗапуститьКонвертациюНаСервере()
	
	ОбщегоНазначения.ВыполнитьВФоне(
		Строка(Объект.Ссылка.УникальныйИдентификатор()),
		"КонвертацияХранилища.ВыполнитьКонвертацию",
		Лев(СтрШаблон(НСтр("ru = 'Конвертация хранилища: %1'"), СокрЛП(Объект.Адрес)), 120),
		Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКоммитыНаСервере()
	
	КонвертацияХранилища.ЗапуститьКоммитыВФоне(Объект.Ссылка);
	
	ОбновитьСостояниеНаСервере();
	
КонецПроцедуры

// Параметры:
// 	Расписание1 - РасписаниеРегламентногоЗадания, Неопределено -
// 	ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура РасписаниеСтрокойНажатиеЗавершение(Расписание1, ДополнительныеПараметры) Экспорт
	
	Если Расписание1 <> Неопределено Тогда
		
		Модифицированность = Истина;
		Расписание         = Расписание1;
		РасписаниеСтрокой  = Строка(Расписание);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеРепозитория()

	РепозиторийСоздан = Ложь;
	Если ЗначениеЗаполнено(Объект.ЛокальныйКаталогGit) Тогда
		
		НайденныеФайлы = НайтиФайлы(Объект.ЛокальныйКаталогGit, "*");
		Для Каждого Файл Из НайденныеФайлы Цикл

			Если НРег(Файл.Имя) = ".git" Тогда

				РепозиторийСоздан = Истина;
				Прервать;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли; 
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

// Параметры:
// 	ВыбранныеФайлы - Неопределено, Массив из Строка -
// 	ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура ЗагрузитьВерсииИзОтчетаПоХранилищуВыбор(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныеФайлы = Неопределено ИЛИ ВыбранныеФайлы.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли; 
	
	ПолноеИмяФайла = ВыбранныеФайлы[0];
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьВерсииИзОтчетаПоХранилищуПослеПомещения", ЭтотОбъект);
	
	НачатьПомещениеФайла(Оповещение, , ПолноеИмяФайла, Ложь, УникальныйИдентификатор);
	
	
КонецПроцедуры


// Параметры:
// 	Результат - Булево
// 	АдресФайла - Строка
// 	ВыбранноеИмяФайла - Строка
// 	ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура ЗагрузитьВерсииИзОтчетаПоХранилищуПослеПомещения(Результат, АдресФайла, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли; 
	
	ЗагрузитьВерсииИзОтчетаПоХранилищуНаСервере(АдресФайла);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВерсииИзОтчетаПоХранилищуНаСервере(АдресФайла)
	
	Файл = ПолучитьИзВременногоХранилища(АдресФайла); // ДвоичныеДанные - 
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("mxl");
	Файл.Записать(ИмяВременногоФайла);
	
	Справочники.ВерсииХранилища.ЗагрузитьВерсииИзОтчета(Объект.Ссылка, ИмяВременногоФайла);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьАдресРепозиторияGitНаКлиенте(ВеткаСуществует)
	Результат = УстановитьАдресРепозиторияGitНаСервере(Истина);
	Если ЗначениеЗаполнено(Результат.Лог) Тогда
		Если Результат.Успех Тогда
			ЗаголовокЛога = НСтр("ru = 'Успешно установлен адрес репозитория git'");
		Иначе
			ЗаголовокЛога = НСтр("ru = 'Возникла ошибка при установке адреса репозитория git'");
		КонецЕсли;
		ОбщегоНазначенияКлиент.ПоказатьТекст(Результат.Лог, ЗаголовокЛога, "git_origin_connect_log.txt");
	ИначеЕсли Результат.Успех Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Адрес репозитория git успешно установлен'"));
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестная ошибка и лог пустой'");
	КонецЕсли;
КонецФункции

&НаСервере
Функция УстановитьАдресРепозиторияGitНаСервере(Знач ВеткаСуществует)
	Возврат КонвертацияХранилища.УстановитьАдресРепозиторияGit(Объект.Ссылка, ВеткаСуществует);
КонецФункции

&НаСервереБезКонтекста
Процедура ПрочитатьТекстовыйФайлНаСервере(ПутьКФайлу, Текст, ИмяФайла, КодировкаСистемы = Ложь)
	
	ОбщегоНазначения.ПрочитатьТекстовыйФайл(ПутьКФайлу, Текст, ИмяФайла, КодировкаСистемы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРепозиторийGitНаСервереОтвет(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Клонировать = Ложь;
		СоздатьВетку = Ложь;
	ИначеЕсли Ответ = КодВозвратаДиалога.ОК Тогда
		Клонировать = Истина;
		СоздатьВетку = Ложь;
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Клонировать = Истина;
		СоздатьВетку = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	Результат = СоздатьРепозиторийGitНаСервере(Клонировать, СоздатьВетку);
	ОбщегоНазначенияКлиент.ПоказатьТекст(Результат.Лог, НСтр("ru = 'Лог создания репозитория'"), "GitRepoInit_log.txt");
КонецПроцедуры

&НаСервере
Функция СоздатьРепозиторийGitНаСервере(Знач Клонировать = Ложь, Знач СоздатьВетку = Ложь, Знач ОднуВетку = Ложь)
	Результат = КонвертацияХранилища.СоздатьРепозиторийGit(Объект.Ссылка, Клонировать, СоздатьВетку, ОднуВетку);
	ПроверитьНаличиеРепозитория();
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура УстановитьАдресРепозиторияGitОтвет(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УстановитьАдресРепозиторияGitНаКлиенте(Истина);
	ИначеЕсли  Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.ИмяВетки = "";
		Модифицированность = Истина;
		ЭтотОбъект.ТекущийЭлемент = Элементы.ИмяВетки;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросПроверкиДоступаПриИзменении()
	
	Если ЗначениеЗаполнено(Объект.АдресРепозиторияGit) 
		И НЕ РепозиторийСоздан
		И (НЕ ЭтоHTTPАдрес(Объект.АдресРепозиторияGit) 
		ИЛИ ЗначениеЗаполнено(Объект.ПользовательСервераGit)
		И ЗначениеЗаполнено(Объект.ПарольСервераGit)) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ЗадатьВопросПроверкиДоступаПриИзмененииОтвет", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Проверить доступ к репозиторию на сервере и загрузить список веток?'");
		Кнопки = Новый СписокЗначений();
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Проверить и загрузить список веток'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, ,КодВозвратаДиалога.Да, НСтр("ru = 'Внимание!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросПроверкиДоступаПриИзмененииОтвет(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ИмяВетки = "";
		Модифицированность = Истина;
		
		Результат = ПроверитьДоступКРепозиториюGitНаСервере();
		Если Не Результат.Успешно Тогда
			ПоказатьПредупреждение( , НСтр("ru = 'Ошибка запроса списка веток:'") + Символы.ПС + Результат.ТекстОшибки);
			Возврат;
		КонецЕсли;

		ОбновитьИменаВеток(Результат.Ветки);

		ЭтотОбъект.ТекущийЭлемент = Элементы.ИмяВетки;
		Если Результат.Ветки.Количество() > 0 Тогда
			Оповещение = Новый ОписаниеОповещения("ВыборИмениВеткиОтвет", ЭтотОбъект);
			Элементы.ИмяВетки.СписокВыбора.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Выберите ветку серверного репозитория'"));
		Иначе
			ПоказатьПредупреждение( , НСтр("ru = 'На сервере 0 веток.'"));
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборИмениВеткиОтвет(Ответ, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Ответ) = Тип("ЭлементСпискаЗначений") Тогда
		Объект.ИмяВетки = Ответ.Значение;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
// 	Адрес - Строка - адрес для проверки
// Возвращаемое значение:
// 	Булево - Истина, если это адресс HTTP или HTTPS
&НаКлиентеНаСервереБезКонтекста
функция ЭтоHTTPАдрес(Адрес)
	Возврат СтрНачинаетсяС(Адрес, "http://") ИЛИ СтрНачинаетсяС(Адрес, "https://");
КонецФункции

&НаКлиенте
Процедура ОбновитьИменаВеток(Ветки)
	
	Элементы.ИмяВетки.СписокВыбора.Очистить();
	Если Ветки.Найти("master") = Неопределено Тогда
		Элементы.ИмяВетки.СписокВыбора.Добавить("master", "master (?)");
	КонецЕсли;
	
	Для Каждого Ветка Из Ветки Цикл
		Элементы.ИмяВетки.СписокВыбора.Добавить(Ветка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДоступКРепозиториюGitНаСервере()
	
	ЭтоHTTPАдрес = ЭтоHTTPАдрес(Объект.АдресРепозиторияGit);
	
	АдресРепозиторияGit =  Объект.АдресРепозиторияGit;
	Если ЭтоHTTPАдрес Тогда
		ПозицияРазделителя = СтрНайти(АдресРепозиторияGit, "://");
		Если ПозицияРазделителя > 0 и ЗначениеЗаполнено(Объект.ПользовательСервераGit) Тогда
			АдресРепозиторияGit = Лев(АдресРепозиторияGit, ПозицияРазделителя + 2)
				+ Объект.ПользовательСервераGit + ":"
				+ Объект.ПарольСервераGit + "@"
				+ Прав(АдресРепозиторияGit, СтрДлина(АдресРепозиторияGit)
				- ПозицияРазделителя - 2);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонвертацияХранилища.ПолучитьИнформациюРепозиторияGitНаСервере(АдресРепозиторияGit);
	
КонецФункции

#КонецОбласти
