///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// @strict-types

////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции общего назначения для "Конвертации хранилища в Git"
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбработчикиЗаданий

// Запускается из РегламентныеЗадания.КонвертацияХранилища.
//   Строит отчет по коммитам в хранилище 1С и заполняет список версий.
//   Запускает задания по коммитам в гит и получению CF.
//
// Параметры:
//  Хранилище - СправочникСсылка.ХранилищаКонфигураций
//
Процедура ВыполнитьКонвертацию(Знач Хранилище) Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Хранилище) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ПараметрыХранилища = ПараметрыХранилища(Хранилище);
		
		Таблица = Справочники.ВерсииХранилища.СостоянияПодготавливаемыхВерсий(ПараметрыХранилища);
		
		// Получение списка новых коммитов в хранилище 1С с учетом установленных ограничений хранилища.
		Если ПараметрыХранилища.ПоследняяВерсия = 0
			И Таблица.Количество() < ПараметрыХранилища.МаксимальноеКоличествоПодготавливаемыхВерсий Тогда
			ПостроитьОтчетПоХранилищуИЗаполнитьСписокВерсий(Хранилище, ПараметрыХранилища);
			Таблица = Справочники.ВерсииХранилища.СостоянияПодготавливаемыхВерсий(ПараметрыХранилища);
		КонецЕсли;
		
		// Запуск коммитов в Git.
		ВерсииДляПомещенияВGit = Таблица.НайтиСтроки(Новый Структура("ВозниклаОшибка, Состояние", Ложь, Перечисления.СостоянияВерсии.ЗагруженаВEDT));
		Если ВерсииДляПомещенияВGit.Количество() > 0 Тогда
			ЗапуститьКоммитыВФоне(Хранилище);
		КонецЕсли;
		
		// Получение CF.
		ВерсииДляПолученияВБазу = Таблица.НайтиСтроки(Новый Структура("ВозниклаОшибка, Состояние", Ложь, Перечисления.СостоянияВерсии.ПустаяСсылка()));
		Для Каждого СтрокаТаблицы Из ВерсииДляПолученияВБазу Цикл
			Если ПолучитьВерсиюХранилищаВБазу(Хранилище, СтрокаТаблицы.Ссылка) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Справочники.ХранилищаКонфигураций.СброситьОшибку(Хранилище);
		
	Исключение
		
		Справочники.ХранилищаКонфигураций.ВозниклаОшибка(Хранилище, ИнформацияОбОшибке());
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Запускается из РегламентныеЗадания.ОбработкаОчереди.
//   Для очередей типа ВыгрузкаВXML находятся версии в состоянии ПолученCF и запускается выгрузка в XML.
//   Для очередей типа ЗагрузкаВEDT находятся версии в состоянии ВыгруженаВXML и запускается загрузка в EDT.
//
// Параметры:
//   Очередь - СправочникСсылка.ОчередиВыполнения
//
Процедура ОбработатьОчередь(Знач Очередь) Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	ИменаРеквизитов =
	"Хранилище, Операция, МаксимальноеКоличествоОпераций, ПрефиксНачалаНомераВерсии, ПрефиксОкончанияНомераВерсии";
	РеквизитыОчереди = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Очередь, ИменаРеквизитов);
	
	Если РеквизитыОчереди.Операция = Перечисления.ОперацииОчереди.ВыгрузкаВXML Тогда
		СостояниеДоНачала = Перечисления.СостоянияВерсии.ПолученCF;
	ИначеЕсли РеквизитыОчереди.Операция = Перечисления.ОперацииОчереди.ЗагрузкаВEDT Тогда
		СостояниеДоНачала = Перечисления.СостоянияВерсии.ВыгруженаВXML;
	Иначе
		Возврат;
	КонецЕсли;
	
	МаксимальноеКоличествоОпераций = РеквизитыОчереди.МаксимальноеКоличествоОпераций;
	Выполнено = 0;
	
	Если ЗначениеЗаполнено(РеквизитыОчереди.Хранилище) Тогда
		
		// Обработка очереди конкретного хранилища.
		Пока Истина Цикл
			
			// После обработки очередной версии:
			// - Конвертация может быть остановлена.
			// - Параметры хранилища могут измениться.
			// - Состояния версий могут измениться.
			Если Константы.КонвертацияОстановлена.Получить() Тогда
				Возврат;
			КонецЕсли;
			ПараметрыХранилища = ПараметрыХранилища(РеквизитыОчереди.Хранилище);
			ПараметрыВерсии = ВыбратьВерсиюДляОбработки(ПараметрыХранилища, СостояниеДоНачала, ПараметрыВерсии);
			Если ПараметрыВерсии = Неопределено Тогда
				Возврат;
			КонецЕсли;
			Выполнено = Выполнено + 1;
			ДлительныеОперации.СообщитьПрогресс(10, НСтр("ru = 'Обработка версии в очереди:'") + " " + Выполнено);
			Если РеквизитыОчереди.Операция = Перечисления.ОперацииОчереди.ВыгрузкаВXML Тогда
				ВыгрузитьВерсиюВXML(ПараметрыВерсии, ПараметрыХранилища);
			ИначеЕсли РеквизитыОчереди.Операция = Перечисления.ОперацииОчереди.ЗагрузкаВEDT Тогда
				ЗагрузитьВерсиюВEDT(ПараметрыВерсии, ПараметрыХранилища);
			КонецЕсли;
			Если МаксимальноеКоличествоОпераций > 0 И Выполнено >= МаксимальноеКоличествоОпераций Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		// Обработка общей очереди.
		ОтборПоХранилищам = Новый Структура("ЗапретитьИспользованиеОбщихОчередей", Ложь);
		ЗапросПоХранилищам = Справочники.ХранилищаКонфигураций.ЗапросПоЭлементам(ОтборПоХранилищам);
		ВыборкаХранилищ = ЗапросПоХранилищам.Выполнить().Выбрать();
		Пока ВыборкаХранилищ.Следующий() Цикл
			
			// После обработки очередной версии:
			// - Конвертация может быть остановлена.
			// - Параметры хранилища могут измениться.
			// - Состояния версий могут измениться.
			Если Константы.КонвертацияОстановлена.Получить() Тогда
				Возврат;
			КонецЕсли;
			ПараметрыХранилища = ПараметрыХранилища(ВыборкаХранилищ.Ссылка);
			ПараметрыВерсии = ВыбратьВерсиюДляОбработки(ПараметрыХранилища, СостояниеДоНачала, ПараметрыВерсии);
			Если ПараметрыВерсии = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Выполнено = Выполнено + 1;
			Если РеквизитыОчереди.Операция = Перечисления.ОперацииОчереди.ВыгрузкаВXML Тогда
				ВыгрузитьВерсиюВXML(ПараметрыВерсии, ПараметрыХранилища);
			ИначеЕсли РеквизитыОчереди.Операция = Перечисления.ОперацииОчереди.ЗагрузкаВEDT Тогда
				ЗагрузитьВерсиюВEDT(ПараметрыВерсии, ПараметрыХранилища);
			КонецЕсли;
			Если МаксимальноеКоличествоОпераций > 0 И Выполнено >= МаксимальноеКоличествоОпераций Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Запускается из РегламентныеЗадания.ВыгрузкаВерсииИзКопииХранилища. Получает CF из копии хранилища.
//   Копии хранилищ используются только как "еще один" источник CF для снижения нагрузки на основное хранилище.
//     Нумерация коммитов в копии должна сопадать с оригиналом. Но может быть урезана по сравнению с основным.
//     Например, в период начала конвертации необходимо получить множество коммитов.
//     Основное хранилище копируют на быстрый диск сервера с гитконвертером.
//     За счет чего, скорость получения CF увеличивается в разы, а сетевая нагрузка с основного хранилища снимется.
//
// Параметры:
//   Копия - СправочникСсылка.КопииХранилищКонфигурации
//
Процедура ВыгрузитьВерсиюИзКопииХранилища(Знач Копия) Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Копия) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКопии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Копия, "Владелец, ПерваяВерсия, ПоследняяВерсия");
	
	ПараметрыХранилища = ПараметрыХранилища(ПараметрыКопии.Владелец);
	
	Если ПараметрыКопии.ПерваяВерсия > 0 Тогда
		ПараметрыХранилища.ПерваяВерсия = ПараметрыКопии.ПерваяВерсия;
	КонецЕсли;
	Если ПараметрыКопии.ПоследняяВерсия > 0 Тогда
		ПараметрыХранилища.ПоследняяВерсия = ПараметрыКопии.ПоследняяВерсия;
	КонецЕсли;
	
	Таблица = Справочники.ВерсииХранилища.СостоянияПодготавливаемыхВерсий(ПараметрыХранилища);
	
	ВерсииДляПолученияВБазу = Таблица.НайтиСтроки(Новый Структура("ВозниклаОшибка, Состояние", Ложь, Перечисления.СостоянияВерсии.ПустаяСсылка()));
	Для Каждого СтрокаТаблицы Из ВерсииДляПолученияВБазу Цикл
		Если ПолучитьВерсиюХранилищаВБазу(СтрокаТаблицы.Ссылка, Копия) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Запускается из РегламентныеЗадания.ОчисткаОтМусора.
// В целях оптимизации работы файловой системы массовое удаление выполняется в одном потоке регламентного задания.
//
Процедура ОчисткаОтМусора() Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МаксимальноеКоличествоОшибокВерсии = МаксимальноеКоличествоОшибокВерсии();
	
	СброситьСостоянияВерсийСОшибками(МаксимальноеКоличествоОшибокВерсии);
	
	ОчиститьВерсииПослеКоммитов();
	
	ЗавершитьЗависшиеПроцессы(МаксимальноеКоличествоОшибокВерсии);
	
КонецПроцедуры

#КонецОбласти

// Запускает выполнение коммитов в фоне, с проверкой что такое задание еще не запущено.
// 
// Параметры:
// 	Хранилище - СправочникСсылка.ХранилищаКонфигураций - Ссылка на хранилище, по которому выполняются коммиты
Процедура ЗапуститьКоммитыВФоне(Знач Хранилище) Экспорт

	КлючЗадания = Строка(Хранилище.УникальныйИдентификатор());
	Отбор = Новый Структура();
	Отбор.Вставить("Ключ", КлючЗадания);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	Отбор.Вставить("ИмяМетода", "КонвертацияХранилища.ВыполнитьКоммиты");

	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);

	Если МассивФоновыхЗаданий.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;

	Наименование = НСтр("ru = 'Коммит в хранилище: %Хранилище%'");
	Наименование = СтрЗаменить(Наименование, "%Хранилище%", Строка(Хранилище));

	Параметры = Новый Массив();
	Параметры.Добавить(Хранилище);

	ФоновыеЗадания.Выполнить("КонвертацияХранилища.ВыполнитьКоммиты", Параметры, КлючЗадания, Лев(Наименование, 120));

КонецПроцедуры

// Выполняет коммиты хранилища в Git
// 
// Параметры:
// 	Хранилище - СправочникСсылка.ХранилищаКонфигураций - Ссылка на хранилище, по которому выполняются коммиты
Процедура ВыполнитьКоммиты(Знач Хранилище) Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;

	РеквизитыХранилища = ПараметрыХранилищаДляКоммита(Хранилище);
	
	Файл = Новый Файл(РеквизитыХранилища.ЛокальныйКаталогGit);
	Если Не Файл.Существует() Тогда
		СоздатьКаталог(РеквизитыХранилища.ЛокальныйКаталогGit);
	КонецЕсли;
	Файл = Новый Файл(РеквизитыХранилища.ЛокальныйКаталогGit);
	Если Не Файл.Существует() Тогда
		// Что делать если не существует?
		Возврат;
	КонецЕсли;

	Файл = Новый Файл(РеквизитыХранилища.ПутьКПроекту);
	Если Не Файл.Существует() Тогда
		СоздатьКаталог(РеквизитыХранилища.ПутьКПроекту);
	КонецЕсли;
	
	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
	
	ТекущаяВерсия = РеквизитыХранилища.ВерсияВGit;

	Если ТипЗнч(РеквизитыХранилища.Код) <> Тип("Число") Тогда
		РеквизитыХранилища.Код = 0;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВерсииХранилища.Ссылка,
	|	ВерсииХранилища.Код,
	|	ВерсииХранилища.КаталогВременныхФайлов,
	|	ВерсииХранилища.Комментарий,
	|	ВерсииХранилища.ДатаСоздания,
	|	ВЫБОР
	|		КОГДА
	|		НЕ ИнформацияПользователей.Имя ЕСТЬ NULL
	|			ТОГДА ИнформацияПользователей.Имя
	|		КОГДА
	|		НЕ ОбщаяИнформацияПользователей.Имя ЕСТЬ NULL
	|			ТОГДА ОбщаяИнформацияПользователей.Имя
	|		КОГДА
	|		НЕ ИнформацияПоУмолчанию.Имя ЕСТЬ NULL
	|		И ИнформацияПоУмолчанию.Имя <> """"
	|			ТОГДА ИнформацияПоУмолчанию.Имя
	|		ИНАЧЕ ВерсииХранилища.Пользователь
	|	КОНЕЦ КАК Пользователь,
	|	ЕСТЬNULL(ИнформацияПользователей.Email, ЕСТЬNULL(ОбщаяИнформацияПользователей.Email,
	|		ЕСТЬNULL(ИнформацияПоУмолчанию.Email, """"))) КАК Email,
	|	ВерсииХранилища.Пользователь КАК ПользовательХранилища,
	|	ВерсииХранилища.КоличествоМетаданных,
	| 	ВерсииХранилища.ВыгруженыТолькоИзменения
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияПользователей КАК ИнформацияПользователей
	|		ПО ВерсииХранилища.Пользователь = ИнформацияПользователей.Пользователь
	|		И ВерсииХранилища.Владелец = ИнформацияПользователей.Хранилище
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияПользователей КАК ОбщаяИнформацияПользователей
	|		ПО ИнформацияПользователей.Имя ЕСТЬ NULL
	|		И ВерсииХранилища.Пользователь = ОбщаяИнформацияПользователей.Пользователь
	|		И ОбщаяИнформацияПользователей.Хранилище = ЗНАЧЕНИЕ(Справочник.ХранилищаКонфигураций.ПустаяСсылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияПользователей КАК ИнформацияПоУмолчанию
	|		ПО ОбщаяИнформацияПользователей.Имя ЕСТЬ NULL
	|		И (ИнформацияПоУмолчанию.Пользователь = """")
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|	И ВерсииХранилища.Код > &Код
	|	И ВерсииХранилища.Владелец.ВыполнятьКоммиты
	|УПОРЯДОЧИТЬ ПО
	|	ВерсииХранилища.Код";

	Запрос.УстановитьПараметр("Код", РеквизитыХранилища.Код);
	Запрос.УстановитьПараметр("Хранилище", Хранилище);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	// Ограничиваем количество коммитов за соединение
	КоличествоКоммитов = 0;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если Константы.КонвертацияОстановлена.Получить() Тогда
			Возврат;
		КонецЕсли;
		
		КоличествоКоммитов = КоличествоКоммитов + 1;
		Если КоличествоКоммитов > РеквизитыХранилища.КоличествоКоммитов
				И РеквизитыХранилища.КоличествоКоммитов > 0 Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ РеквизитыХранилища.РазрешитьПомещатьАнонимноЕслиНеНайденПользователь
			И НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Email) Тогда
			Возврат;
		КонецЕсли;

		ПараметрыВерсии = ПараметрыВерсииДляКоммита();
		ПараметрыВерсии.Вставить("ИмяПроектаEDT", РеквизитыХранилища.ИмяПроектаEDT);
	
		ЗаполнитьЗначенияСвойств(ПараметрыВерсии, ВыборкаДетальныеЗаписи);
		
		ВерсияХранилища = ВыборкаДетальныеЗаписи.Ссылка; // СправочникСсылка.ВерсииХранилища - 
		Объект = ВерсияХранилища.ПолучитьОбъект();
		
		// Каталог исходных файлов проекта /path_to_dump/1/p/Project/
		ПараметрыВерсии.Вставить("КаталогПроектаEDT", КаталогПроектаEDT(ПараметрыВерсии));
		// Каталог исходных файлов проекта /path_to_dump/1/p/Project/src/
		ПараметрыВерсии.Вставить("ПутьКФайламПроектаВерсии", ПутьКФайламПроектаВерсии(ПараметрыВерсии));
		Если РеквизитыХранилища.ОтключитьЛогирование Тогда
			ИмяФайлаЛога = "";
		Иначе
			ИмяФайлаЛога = ИмяФайлаЛогаКоммитаВерсии(ПараметрыВерсии.Код, РеквизитыХранилища.КаталогВыгрузкиВерсий);
			ПараметрыВерсии.Вставить("ИмяФайлаЛога", ИмяФайлаЛога);
		КонецЕсли;
		ИмяФайлаКомандыGit = ИмяФайлаКомандыКоммитаВерсии(ПараметрыВерсии.Код, РеквизитыХранилища.КаталогВыгрузкиВерсий, ЭтоWindowsСервер);
		ИмяФайлКомментария = ИмяФайлаКомментарияКоммитаВерсии(ПараметрыВерсии.Код, РеквизитыХранилища.КаталогВыгрузкиВерсий);
		
		// Если версия помещена, но не произошла запись в проект - переводим указатель на эту версию
		Если ТекущаяВерсия <> ВерсияХранилища
				И Объект.Состояние = Перечисления.СостоянияВерсии.ПомещенаВGit Тогда
			
			Объект = Хранилище.ПолучитьОбъект();
			Объект.ВерсияВGit = ВерсияХранилища;
			Объект.Записать();
			ТекущаяВерсия = ВерсияХранилища;

			Запрос.УстановитьПараметр("Код", ВыборкаДетальныеЗаписи.Код);

			РезультатЗапроса = Запрос.Выполнить();

			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Продолжить;
			
		// Если версия помещается - значит было падение процесса коммита, выясняем состояние
		ИначеЕсли ТекущаяВерсия <> ВерсияХранилища
				И Объект.Состояние = Перечисления.СостоянияВерсии.ПомещаетсяВGit Тогда
			Возврат; // Проверка зависания выполняется при очистке от мусора.
		ИначеЕсли ТекущаяВерсия = ВерсияХранилища
				ИЛИ Объект.Состояние <> Перечисления.СостоянияВерсии.ЗагруженаВEDT Тогда
			Возврат;
		КонецЕсли;

		Если РеквизитыХранилища.МинимальноеКоличествоМетаданных > 0
				И РеквизитыХранилища.МинимальноеКоличествоМетаданных > Объект.КоличествоМетаданных
				И НЕ Объект.ВыгруженыТолькоИзменения Тогда
			Возврат;
		КонецЕсли;

		Объект = Неопределено;

		Если Не Справочники.ВерсииХранилища.НачатьОбработкуВерсии(
				ВерсияХранилища,
				Неопределено,
				Перечисления.СостоянияВерсии.ЗагруженаВEDT,
				Перечисления.СостоянияВерсии.ПомещаетсяВGit) Тогда
			Возврат; // По какой-то причине версия перестала быть готовой к помещению в Git.
		КонецЕсли;
		
		ФайлКомандыGit = Новый Файл(ИмяФайлаКомандыGit);
		ФайлКомментария = Новый Файл(ИмяФайлКомментария);
		Если НЕ ФайлКомандыGit.Существует() ИЛИ ФайлКомандыGit.Размер() = 0
				ИЛИ НЕ ФайлКомментария.Существует() Тогда

			ЗаписатьФайлыКоммитаВерсии(ВерсияХранилища, ТекущаяВерсия, РеквизитыХранилища, ПараметрыВерсии, 
				ИмяФайлаКомандыGit, ИмяФайлаЛога, ИмяФайлКомментария);

		КонецЕсли;

		Файл = Новый Файл(РеквизитыХранилища.ПутьКПроекту);
		Если Не Файл.Существует() Тогда
			СоздатьКаталог(РеквизитыХранилища.ПутьКПроекту);
		КонецЕсли;

		ФайлКонфигурации = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПараметрыВерсии.ПутьКФайламПроектаВерсии 
			+ "Configuration") + "Configuration.mdo";
		Файл = Новый Файл(ФайлКонфигурации);
		
		Если Не Файл.Существует() 
			И (НЕ РеквизитыХранилища.ВыгружатьИзменения 
			ИЛИ НЕ ПараметрыВерсии.ВыгруженыТолькоИзменения) Тогда
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Коммит.Отсутствуют файлы конфигурации';", 
					Метаданные.ОсновнойЯзык.КодЯзыка), 
				УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.Справочники.ВерсииХранилища, 
				ПараметрыВерсии.Ссылка, 
				НСтр("ru = 'Отсутствует файл Configuration.* в каталоге выгрузки версии';", 
					Метаданные.ОсновнойЯзык.КодЯзыка));
			Возврат;
		КонецЕсли;

		Если ПараметрыВерсии.ВыгруженыТолькоИзменения Тогда
			ИмяФайлаИндексов = ПараметрыВерсии.ПутьКФайламПроектаВерсии + "DumpFilesIndex.txt";
			ТаблицаИндексов = ПрочитатьТаблицуИндексов(ИмяФайлаИндексов);
			ИмяФайлаИндексовПердыдущейВерсии = РеквизитыХранилища.ПутьКФайламПроекта + "DumpFilesIndex.txt";
			ТаблицаИндексовПредыдущейВерсии = ПрочитатьТаблицуИндексов(ИмяФайлаИндексовПердыдущейВерсии);
			Для Каждого СтрокаТЧ Из ТаблицаИндексов Цикл
				Отбор = Новый Структура();
				Отбор.Вставить("Уровень", СтрокаТЧ.Уровень);
				Отбор.Вставить("UUID",    СтрокаТЧ.UUID);
			
				НайденныеСтроки = ТаблицаИндексовПредыдущейВерсии.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() = 0 Тогда
					НоваяСтрока = ТаблицаИндексовПредыдущейВерсии.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				КонецЕсли;
			КонецЦикла;
			ЗаписатьТаблицуИндексов(ТаблицаИндексовПредыдущейВерсии, ИмяФайлаИндексов);
			Объект = ВерсияХранилища.ПолучитьОбъект();
			Объект.КоличествоМетаданных = ТаблицаИндексовПредыдущейВерсии.Количество();
			Объект.Записать();
		КонецЕсли;
		
		МассивПутейПриемника = СтрРазделить(РеквизитыХранилища.ПутьКПроекту, ПолучитьРазделительПути(), Ложь);
		МассивПутейИсточника = СтрРазделить(ПараметрыВерсии.КаталогПроектаEDT, ПолучитьРазделительПути(), Ложь);
		
		// Для ускорения перемещаем исходные файлы если они на одном диске
		// А если на другом - нужно копировать рекурсивно
		Если НРег(МассивПутейИсточника[0]) <> НРег(МассивПутейПриемника[0]) Тогда
			// Сначала удаляем все файлы из src
			Если НЕ ПараметрыВерсии.ВыгруженыТолькоИзменения Тогда
				УдалитьФайлы(РеквизитыХранилища.ПутьКФайламПроекта);
			КонецЕсли;
			СоздатьКаталог(РеквизитыХранилища.ПутьКФайламПроекта);
			// копируем всю директорию проекта
			СкопироватьФайлыРекурсивно(ПараметрыВерсии.КаталогПроектаEDT, РеквизитыХранилища.ПутьКПроекту);
		КонецЕсли;
		
		Если НЕ ВыполнитьДействияПередКоммитом(ПараметрыВерсии, РеквизитыХранилища) Тогда
			Объект = ВерсияХранилища.ПолучитьОбъект();
			Объект.Состояние = Перечисления.СостоянияВерсии.ЗагруженаВEDT;
			Объект.Записать();
			ДобавитьЗаписьВЛог(ПараметрыВерсии, НСтр("ru='Начало коммита в Git'", НСтр("ru='Помещение изменений версии отмененео из-за предыдущих ошибок.'")));
			Возврат;
		КонецЕсли;
		
		ДобавитьЗаписьВЛог(ПараметрыВерсии, НСтр("ru='Начало коммита в Git'"));

		КодВозврата = Неопределено;
		ЗапуститьПриложение(?(ЭтоWindowsСервер, "", "bash ")
			+ ИмяФайлаКомандыGit, РеквизитыХранилища.ЛокальныйКаталогGit, Истина, КодВозврата);
		
		ДобавитьЗаписьВЛог(ПараметрыВерсии, НСтр("ru='Окончание коммита в Git'"), "Код возврата: "
			+ ?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
		
		Если КодВозврата <> Неопределено И КодВозврата <> 0 Тогда
			ДобавитьЗаписьВЛог(ПараметрыВерсии, НСтр("ru='Окончание коммита в Git'"),
				НСтр("ru='Коммит в Git выполнен не успешно. Необходимо проанализировать лог, устранить причину и вручную завершить коммит.'"));
			Возврат;
		КонецЕсли;

		ХешКоммита = "";
		ИмяФайлаХеша = ПолучитьИмяВременногоФайла("txt");
		ТекстКоманды = "git rev-parse HEAD > " + ИмяФайлаХеша;
		ЗапуститьПриложение(?(ЭтоWindowsСервер, "cmd /C ", "") + ТекстКоманды, 
			РеквизитыХранилища.ЛокальныйКаталогGit, Истина);
		ФайлХеша = Новый Файл(ИмяФайлаХеша);
		Если ФайлХеша.Существует() Тогда
			ТекстФайлаХеша = Новый ТекстовыйДокумент();
			ТекстФайлаХеша.Прочитать(ИмяФайлаХеша);
			ХешКоммита = СокрЛП(ТекстФайлаХеша.ПолучитьТекст());
		КонецЕсли;
		
		Объект = ВерсияХранилища.ПолучитьОбъект();
		Если Объект <> Неопределено И (Объект.Состояние <> Перечисления.СостоянияВерсии.ПомещенаВGit
			ИЛИ ЗначениеЗаполнено(ХешКоммита) И Объект.Хеш <> ХешКоммита) Тогда
			Объект.Состояние = Перечисления.СостоянияВерсии.ПомещенаВGit;
			Объект.Хеш = ХешКоммита;
			Объект.Записать();
		КонецЕсли;
		
		Объект = Хранилище.ПолучитьОбъект();
		Объект.ВерсияВGit = ВерсияХранилища;
		Объект.Записать();
		ТекущаяВерсия = ВерсияХранилища;
		РеквизитыХранилища.Вставить("ВерсияВGit", ВерсияХранилища);
		РеквизитыХранилища.Вставить("Код", ВыборкаДетальныеЗаписи.Код);
		
		Если НЕ ВыполнитьДействаияПослеКоммита(ПараметрыВерсии, РеквизитыХранилища) Тогда
			Возврат;
		КонецЕсли;

		Запрос.УстановитьПараметр("Код", РеквизитыХранилища.Код);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	КонецЦикла;

КонецПроцедуры

// Выгружает версию в XML (при необходимости) и загружает в EDT (при необходимости).
//
// Параметры:
//   ВерсияХранилища - СправочникСсылка.ВерсииХранилища - Ссылка на версию хранилища.
//
Процедура ВыгрузитьВерсиюВXMLИЗагрузитьВEDT(Знач ВерсияХранилища) Экспорт
	
	ПараметрыВерсии = Справочники.ВерсииХранилища.ПараметрыВерсии(ВерсияХранилища);
	ПараметрыХранилища = ПараметрыХранилища(ПараметрыВерсии.Владелец);
	
	// Выгружаем версию в файлы
	ВыгрузитьВерсиюВXML(ПараметрыВерсии, ПараметрыХранилища);
	
	// Загружает файлы конфигурации версии в проект EDT и составляет индекс для переименований в Git-е
	ЗагрузитьВерсиюВEDT(ПараметрыВерсии, ПараметрыХранилища);
	
КонецПроцедуры

// Получает структуру параметров версии
// 
// Параметры:
// 	ВерсияХранилища - СправочникСсылка.ВерсииХранилища - ссылка на версию хранилища
// Возвращаемое значение:
// 	Структура - Параметры версии:
// 	* Хранилище - СправочникСсылка.ХранилищаКонфигураций - Ссылка на хранилище
// 	* Код - Число - Код версии
// 	* Состояние - ПеречислениеСсылка.СостоянияВерсии - Текущее состояние версии
// 	* КаталогВременныхФайлов - Строка - Каталог временных файлов версии
// 	* ВыгруженыТолькоИзменения - Булево - Признак выгрузки изменений в текущей версии
// 	* КаталогВыгрузкиВерсий - Строка - Общий каталог в котором создаются подкаталоги для каждой версии
// 	* ВерсияПлатформыХранилища - Строка - Версия Платформы
// 	* МинимальноеКоличествоМетаданных - Число - Минимальное количество метаданных
// 	* УдалятьКонфигурацииПоставщиков - Булево - Удалять ли файлы конфигураций поставщиков
// 	* ВыгружатьИзменения - Булево - Призанк необходимости выгружать изменения
// 	* ИмяПроектаEDT - Строка - Имя проекта EDT или сегмент пути в репозитории, где последний сегмент является именем проекта
// 	* ОтключитьЛогирование - Булево - Флаг отключения логирования
// 	* КаталогВыгрузкиВXML - Строка - Каталог выгрузки xml файлов версии в формате 1С:Предприятия
// 	* РабочийКаталогEDT - Строка - Путь к каталогу рабочей области EDT для версии
// 	* КаталогПроектаEDT - Строка - Путь к временному каталогу проекта в формате EDT для подготовлеваемой версии
// 	* КаталогИсходниковEDT - Строка - Путь к временному каталогу файлов в формате EDT для версии
// 	* КаталогИБ - Строка - Каталог БД для версии полученной из хранилища
// 	* Ключ - Строка - Уникальный идентификатор операции
// 	* ФайлПараметровПакетнойОперации - Строка - 
// 	* ИмяФайлаЛога - Строка - 
// 	* ИмяФайлаРезультатов - Строка - 
// 	* ВерсияEDTCLI - СправочникСсылка.ВерсииEDT -
// 	
Функция ПолучитьПараметрыОбработкиВерсии(Знач ВерсияХранилища) Экспорт

	ИменаРеквизитов = Новый Структура("Хранилище, Код, Состояние, КаталогВременныхФайлов, ВыгруженыТолькоИзменения", 
		"Владелец");
	РеквизитыВерсии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВерсияХранилища, ИменаРеквизитов);

	Хранилище = РеквизитыВерсии.Хранилище;

	Параметры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Хранилище, "КаталогВыгрузкиВерсий, ВерсияПлатформыХранилища,
		|МинимальноеКоличествоМетаданных, УдалятьКонфигурацииПоставщиков, ВыгружатьИзменения,
		|ИмяПроектаEDT, ОтключитьЛогирование,
		|ВерсияEDTCLI");
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Параметры, РеквизитыВерсии);
	
	КлючОперации = Строка(Хранилище.УникальныйИдентификатор()) + "_"
		+ Строка(ВерсияХранилища.УникальныйИдентификатор()) + "_2";

	Если НЕ ЗначениеЗаполнено(Параметры.КаталогВременныхФайлов) Тогда

		Параметры.Вставить("КаталогВременныхФайлов", ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Параметры.КаталогВыгрузкиВерсий)
			+ Формат(Параметры.Код, "ЧДЦ=; ЧГ=0"));

	КонецЕсли;

	Параметры.КаталогВременныхФайлов = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Параметры.КаталогВременныхФайлов);
	Параметры.Вставить("КаталогВыгрузкиВXML", КаталогВыгрузкиВXML(Параметры.КаталогВременныхФайлов));
	Параметры.КаталогВыгрузкиВXML = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Параметры.КаталогВыгрузкиВXML);

	Параметры.Вставить("РабочийКаталогEDT", ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Параметры.КаталогВременныхФайлов + "ws"));
	
	Параметры.Вставить("КаталогПроектаEDT", КаталогПроектаEDT(Параметры));
	Параметры.Вставить("КаталогИсходниковEDT", ПутьКФайламПроектаВерсии(Параметры));
	
	Параметры.Вставить("КаталогИБ", Параметры.КаталогВременныхФайлов + "db");
	Параметры.КаталогИБ = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Параметры.КаталогИБ);
	
	Файл = Новый Файл(Параметры.КаталогВременныхФайлов);
	Если НЕ Файл.Существует() Тогда
		СоздатьКаталог(Параметры.КаталогВременныхФайлов);
	КонецЕсли;

	Параметры.Вставить("Ключ", КлючОперации);
	Параметры.Вставить("ФайлПараметровПакетнойОперации", Параметры.КаталогВременныхФайлов
		+ "params_" + Параметры.Ключ + ".txt");
	Если НЕ Параметры.ОтключитьЛогирование Тогда
		Параметры.Вставить("ИмяФайлаЛога", ИмяФайлаЛогаОбработкиВерсии(Параметры.КаталогВременныхФайлов));
	КонецЕсли;
	Параметры.Вставить("ИмяФайлаРезультатов", Параметры.КаталогВременныхФайлов
		+ "result.txt");

	ПараметрыРасширения(Хранилище, Параметры);
	
	Возврат Параметры;

КонецФункции

// Формирует полное имя файла лога конвертации хранилища
// 
// Параметры:
// 	КаталогВременныхФайлов - Строка - Каталог временных файлов хранилища
// Возвращаемое значение:
// 	Строка - Полное имя файла лога конвертации хранилища
Функция ИмяФайлаЛогаКонвертацииХранилища(КаталогВременныхФайлов) Экспорт
	
	Возврат ОбщегоНазначения.ДобавитьКонечныйРазделительПути(КаталогВременныхФайлов) + "log.txt";
	
КонецФункции

// Формирует полное имя файла лога обработки версии
// 
// Параметры:
// 	КаталогВременныхФайлов - Строка - Каталог временных файлов версии
// Возвращаемое значение:
// 	Строка - Полное имя файла лога обработки версии
Функция ИмяФайлаЛогаОбработкиВерсии(КаталогВременныхФайлов) Экспорт
	
	Возврат ОбщегоНазначения.ДобавитьКонечныйРазделительПути(КаталогВременныхФайлов) 
			+ "log.txt";
	
КонецФункции

// Формирует полное имя файла лога коммита версии
// 
// Параметры:
// 	КодВерсии - Строка - Код версии хранилища
// 	КаталогВыгрузкиВерсий - Строка - Каталог выгрузки версий хранилища
// Возвращаемое значение:
// 	Строка - Полное имя файла лога коммита версии
Функция ИмяФайлаЛогаКоммитаВерсии(КодВерсии, КаталогВыгрузкиВерсий) Экспорт
	
	Возврат ОбщегоНазначения.ДобавитьКонечныйРазделительПути(КаталогВыгрузкиВерсий)
			+ "git_log_ver_" + Формат(КодВерсии, "ЧДЦ=; ЧГ=0") + ".txt";
КонецФункции

// Формирует полное имя файла команды коммита версии для запуска в системе
// 
// Параметры:
// 	КодВерсии - Строка - Код версии хранилища
// 	КаталогВыгрузкиВерсий - Строка - Каталог выгрузки версий хранилища
// 	ЭтоWindowsСервер - Булево - Признак текущей операционной системы, Истина - это ОС Windows, 
// 						Ложь - это ОС Linux или macOS
// Возвращаемое значение:
// 	Строка - Полное имя файла команды коммита версии
Функция ИмяФайлаКомандыКоммитаВерсии(КодВерсии, КаталогВыгрузкиВерсий, ЭтоWindowsСервер) Экспорт
	
	Возврат ОбщегоНазначения.ДобавитьКонечныйРазделительПути(КаталогВыгрузкиВерсий)
			+ "git_command_" + Формат(КодВерсии, "ЧДЦ=; ЧГ=0")
			+ ?(ЭтоWindowsСервер, ".bat", ".sh");
КонецФункции

// Формирует полное имя файла комментария коммита версии
// 
// Параметры:
// 	КодВерсии - Строка - Код версии хранилища
// 	КаталогВыгрузкиВерсий - Строка - Каталог выгрузки версий хранилища
// Возвращаемое значение:
// 	Строка - Полное имя файла комментария коммита версии
Функция ИмяФайлаКомментарияКоммитаВерсии(КодВерсии, КаталогВыгрузкиВерсий) Экспорт
	
	Возврат ОбщегоНазначения.ДобавитьКонечныйРазделительПути(КаталогВыгрузкиВерсий)
			+ "git_comment_" + Формат(КодВерсии, "ЧДЦ=; ЧГ=0") + ".txt";
КонецФункции

// Выгружает конфигурацию из базы 1С в файлы XML формата 1С:Предприятие.
//
// Параметры:
//   ПараметрыХранилища - Структура - См. КонвертацияХранилища.ПараметрыХранилища.
//   ПараметрыВерсии - Структура - См. Справочники.ВерсииХранилища.ПараметрыВерсии.
//
Процедура ВыгрузитьВерсиюВXML(ПараметрыВерсии, ПараметрыХранилища) Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	Если Не Справочники.ВерсииХранилища.НачатьОбработкуВерсии(
			ПараметрыВерсии.Ссылка,
			ПараметрыВерсии,
			Перечисления.СостоянияВерсии.ПолученCF,
			Перечисления.СостоянияВерсии.ВыгружаетсяВXML) Тогда
		Возврат;
	КонецЕсли;
	Попытка
		
		Контекст = КонтекстРаботыСВерсией(ПараметрыВерсии, ПараметрыХранилища);
		
		ЗаписатьВЛогВерсии(Контекст, 3, "ru='Выгрузка версии из базы в xml'", , 5);
		
		ОбщегоНазначения.УдалитьФайлИлиКаталог(Контекст.КаталогВыгрузкиВXML);
		СоздатьКаталог(Контекст.КаталогВыгрузкиВXML);
		
		Контекст.Вставить("СтрокаСоединенияИБ", "/F """ + Контекст.КаталогИБ + """");
		Контекст.Вставить("ИмяПользователяИБ", "");
		Контекст.Вставить("ПарольПользователяИБ", "");
		Контекст.Вставить("ФайлИзменений", Контекст.КаталогВременныхФайлов + "diff.txt");
		Контекст.Вставить("ФайлСостоянияПредыдущейВерсии", Контекст.КаталогВременныхФайлов + "PreviousState.xml");
		
		Контекст.ВыгруженыТолькоИзменения = Ложь;
		Если Не ТребуетсяПолнаяВыгрузкаВерсииВXML(ПараметрыВерсии, ПараметрыХранилища) Тогда
			ФайлНайденИСкопирован = СкопироватьФайлСостоянияПредыдущейВерсии(Контекст, Контекст.ФайлСостоянияПредыдущейВерсии);
			Если ФайлНайденИСкопирован Тогда
				// Выгрузка XML по изменениям.
				ВыгрузитьКонфигурациюВФайлы(Контекст, Истина, "", Ложь);
				// Проверка наличия файлов XML.
				ТекстОшибки = ТекстОшибкиЕслиКаталогВыгрузкиXMLПустой(Контекст);
				Если ЗначениеЗаполнено(ТекстОшибки) Тогда
					// Если в хранилище 2 версии с одинаковым состоянием ConfigDumpInfo, значит выгрузки изменений не произошло
					// и требуется полная выгрузка.
					ЗаписатьПричинуПолнойВыгрузкиВXML(ПараметрыВерсии, ТекстОшибки);
					ЗаписатьВЛогВерсии(Контекст, 1, ТекстОшибки);
				Иначе
					Контекст.ВыгруженыТолькоИзменения = Истина;
					// Довыгрузка свойств корня и языков.
					ДовыгрузитьКореньВерсииВXML(Контекст);
					// Получение списка изменений.
					ВыгрузитьКонфигурациюВФайлы(Контекст, Ложь, "", Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Не Контекст.ВыгруженыТолькоИзменения Тогда // Требуется полная выгрузка.
			ВыгрузитьКонфигурациюВФайлы(Контекст, Ложь, "", Ложь);
			ТекстОшибки = ТекстОшибкиЕслиКаталогВыгрузкиXMLПустой(Контекст);
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				ЗаписатьВЛогВерсии(Контекст, 1, ТекстОшибки);
				ВызватьИсключениеПриОбработкеВерсии(Контекст);
			КонецЕсли;
		КонецЕсли;
		
		ИмяФайлаИсточника = Контекст.КаталогВыгрузкиВXML + "ConfigDumpInfo.xml";
		ИмяФайлаПриемника = Контекст.КаталогВременныхФайлов + "ConfigDumpInfo.xml";
		ОбщегоНазначения.УдалитьФайлИлиКаталог(ИмяФайлаПриемника);
		Если ОбщегоНазначения.ФайлСуществует(ИмяФайлаИсточника) Тогда
			КопироватьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника);
			ОбщегоНазначения.УдалитьФайлИлиКаталог(ИмяФайлаИсточника);
		КонецЕсли;
		
		Если Контекст.ВыгруженыТолькоИзменения Тогда
			ТекстИзменений = СтроковыеФункции.СтрокаИзФайла(Контекст.ФайлИзменений, КодировкаТекста.UTF8);
			Если НРег(СокрЛП(ТекстИзменений)) = "fulldump" Тогда
				Контекст.ВыгруженыТолькоИзменения = Ложь;
				ЗаписатьПричинуПолнойВыгрузкиВXML(ПараметрыВерсии, НСтр("ru = 'Платформа сама так решила (fulldump в файле изменений)'"));
			КонецЕсли;
			Если Контекст.ВыгруженыТолькоИзменения Тогда
				ЗаписатьВЛогВерсии(Контекст, 3, "ru='Анализ частичной выгрузки для конвертации в EDT'", , 50);
				ОбъектыДовыгрузки = ПолучитьСписокОбъектовДовыгрузки(ТекстИзменений, ИмяФайлаПриемника);
				Если ОбъектыДовыгрузки.Количество() > 0 Тогда
					ЗаписатьВЛогВерсии(Контекст, 3, "ru='Подготовка частичной выгрузки для конвертации в EDT'", , 55);
					ФайлСписка = Контекст.КаталогВременныхФайлов + "dumplist.txt";
					СтроковыеФункции.СтрокаВФайл(СтрСоединить(ОбъектыДовыгрузки, Символы.ПС), ФайлСписка, КодировкаТекста.UTF8);
					ЗаписатьВЛогВерсии(Контекст, 3, "ru='Довыгрузка объектов для конвертации в EDT'", , 60);
					ВыгрузитьКонфигурациюВФайлы(Контекст, Ложь, ФайлСписка, Ложь);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Контекст.УдалятьКонфигурацииПоставщиков Тогда
			ЗаписатьВЛогВерсии(Контекст, 3, "ru='Удаление конфигураций поставщиков'", , 90);
			КаталогКонфигурации = Контекст.КаталогВыгрузкиВXML + "Ext" + ПолучитьРазделительПути();
			ОбщегоНазначения.УдалитьФайлИлиКаталог(КаталогКонфигурации + "ParentConfigurations.bin");
			ОбщегоНазначения.УдалитьФайлИлиКаталог(КаталогКонфигурации + "ParentConfigurations");
		КонецЕсли;
		
		ЗаписатьВЛогВерсии(Контекст, 3, "ru='Выгрузка версии из базы в xml завершена'", , 100);
		
		ЗначенияРеквизитов = Новый Структура;
		ЗначенияРеквизитов.Вставить("Состояние", Перечисления.СостоянияВерсии.ВыгруженаВXML);
		ЗначенияРеквизитов.Вставить("ВыгруженыТолькоИзменения", Контекст.ВыгруженыТолькоИзменения);
		Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(ПараметрыВерсии.Ссылка, ЗначенияРеквизитов);
		ЗаполнитьЗначенияСвойств(ПараметрыВерсии, ЗначенияРеквизитов);
		
	Исключение
		Справочники.ВерсииХранилища.ВозниклаОшибка(ПараметрыВерсии.Ссылка, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ТребуетсяПолнаяВыгрузкаВерсииВXML(ПараметрыВерсии, ПараметрыХранилища, КодПредыдущейПолнойВыгрузкиXML = Неопределено) Экспорт
	// В настройках хранилища отключен флажок "Выгружать изменения (ускорить конвертацию)".
	Если Не ПараметрыХранилища.ВыгружатьИзменения Тогда
		Возврат Истина;
	КонецЕсли;
	// В настройках версии включен флажок "Требуется полная выгрузка".
	Если ПараметрыВерсии.ТребуетсяПолнаяВыгрузка Тогда
		Возврат Истина;
	КонецЕсли;
	// Были какие-либо изменения кроме добавлений и изменений.
	Если ПараметрыВерсии.ЕстьИзмененияПрепятствующиеИнкрементальнойВыгрузке Тогда
		ЗаписатьПричинуПолнойВыгрузкиВXML(ПараметрыВерсии,
			"ru = 'В списке изменений версии есть изменения, препятствующие выгрузке изменений конфигурации (см. таблицу Состав в карточке версии).'");
		Возврат Истина;
	КонецЕсли;
	// Номер версии > Номер предыдущей опорной версии + МаксимальноеКоличествоЧастичныхВыгрузокПодряд.
	Если ПараметрыХранилища.МаксимальноеКоличествоЧастичныхВыгрузокПодряд > 0 Тогда
		Если КодПредыдущейПолнойВыгрузкиXML = Неопределено Тогда
			КодПредыдущейПолнойВыгрузкиXML = Справочники.ВерсииХранилища.КодПредыдущейВерсииПолностьюВыгруженнойВXML(
				ПараметрыВерсии.Владелец, ПараметрыВерсии.Код);
		КонецЕсли;
		Если ПараметрыВерсии.Код > КодПредыдущейПолнойВыгрузкиXML + ПараметрыХранилища.МаксимальноеКоличествоЧастичныхВыгрузокПодряд Тогда
			Текст = "ru = 'Достигнут предел количества версий, выгруженных с изменениями подряд.
			|Проверяемая версия: %1;
			|Предыдущая версия полностью выгруженная в XML: %2;
			|Константа МаксимальноеКоличествоЧастичныхВыгрузокПодряд: %3.'";
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				Текст,
				Формат(ПараметрыВерсии.Код, "ЧГ="),
				Формат(КодПредыдущейПолнойВыгрузкиXML, "ЧГ="),
				ПараметрыХранилища.МаксимальноеКоличествоЧастичныхВыгрузокПодряд);
			ЗаписатьПричинуПолнойВыгрузкиВXML(ПараметрыВерсии, Текст);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	// Версии с переименованиями должны выгружаться полностью.
	// Но пока непонятно как это проверить из отчета по конфигурации.
	Возврат Ложь;
КонецФункции

Процедура ЗаписатьПричинуПолнойВыгрузкиВXML(ПараметрыВерсии, Причина) Экспорт
	ЗаписатьВЛогВерсии(ПараметрыВерсии, 3,
		СтрШаблон("ru = 'Причина полной выгрузки XML: %1'", ОбщегоНазначения.ТекстЖурнала(Причина)));
КонецПроцедуры

Функция СкопироватьФайлСостоянияПредыдущейВерсии(Контекст, ПолноеИмяФайлаМетаданныхПредыдущейВерсии) Экспорт
	ПредыдущаяВерсия = Справочники.ВерсииХранилища.ПредыдущаяВерсия(Контекст.Владелец, Контекст.Код);
	Если ПредыдущаяВерсия = Неопределено Тогда
		ЗаписатьПричинуПолнойВыгрузкиВXML(Контекст,
			"ru = 'Не скопирован файл предыдущей версии, т.к. предыдущая версия не найдена.'");
		Возврат Ложь;
	КонецЕсли;
	Если ПредыдущаяВерсия.ВозниклаОшибка Тогда
		ЗаписатьПричинуПолнойВыгрузкиВXML(Контекст,
			"ru = 'Не скопирован файл предыдущей версии, т.к. при выгрузке предыдущей версии возникла ошибка.'");
		Возврат Ложь;
	КонецЕсли;
	
	Если ПредыдущаяВерсия.Состояние = Перечисления.СостоянияВерсии.ВыгруженаВXML
		Или ПредыдущаяВерсия.Состояние = Перечисления.СостоянияВерсии.ЗагружаетсяВEDT
		Или ПредыдущаяВерсия.Состояние = Перечисления.СостоянияВерсии.ЗагруженаВEDT Тогда
		ПолноеИмяКопируемогоФайла = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПредыдущаяВерсия.КаталогВременныхФайлов) + "ConfigDumpInfo.xml";
	ИначеЕсли ПредыдущаяВерсия.Состояние = Перечисления.СостоянияВерсии.ПомещенаВGit Тогда
		ПолноеИмяКопируемогоФайла = Контекст.РепозиторийGit_ПутьКИсходникамEDT + "ConfigDumpInfo.xml";
	Иначе
		ЗаписатьПричинуПолнойВыгрузкиВXML(Контекст,
			СтрШаблон("ru = 'Не скопирован файл предыдущей версии, т.к. состояние предыдущей версии %1.'",
				ПредыдущаяВерсия.Состояние));
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.ФайлСуществует(ПолноеИмяКопируемогоФайла) Тогда
		КопироватьФайл(ПолноеИмяКопируемогоФайла, ПолноеИмяФайлаМетаданныхПредыдущейВерсии);
		Возврат Истина;
	КонецЕсли;
	
	ЗаписатьПричинуПолнойВыгрузкиВXML(Контекст,
		СтрШаблон("ru = 'Не найден файл предыдущей версии ""%1"".'", ПолноеИмяКопируемогоФайла));
	Возврат Ложь;
КонецФункции

Функция ЕстьФайлСостоянияПредыдущейВерсии(ПараметрыПредыдущейВерсии)
	Возврат ЗначениеЗаполнено(ПараметрыПредыдущейВерсии.КаталогВременныхФайлов)
		И ОбщегоНазначения.ФайлСуществует(ПараметрыПредыдущейВерсии.КаталогВременныхФайлов + "ConfigDumpInfo.xml");
КонецФункции

Функция ТекстОшибкиЕслиКаталогВыгрузкиXMLПустой(Контекст)
	Файлы = НайтиФайлы(Контекст.КаталогВыгрузкиВXML, "*", Истина);
	Если Файлы.Количество() = 0 Или (Файлы.Количество() = 1 И Файлы[0].Имя = "ConfigDumpInfo.xml") Тогда
		Если Контекст.ВыгруженыТолькоИзменения Тогда
			Заголовок = НСтр("ru = 'Частичная выгрузка конфигурации в XML не привела к должному эффекту, каталог XML пуст.'");
		Иначе
			Заголовок = НСтр("ru = 'Полная выгрузка конфигурации в XML не привела к должному эффекту, каталог XML пуст.'");
		КонецЕсли;
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1: %2
				|  Каталог XML: %3;
				|  Каталог информационной базы: %4.'"),
			Контекст.Ссылка,
			Заголовок,
			Контекст.КаталогВыгрузкиВXML,
			Контекст.КаталогИБ);
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Процедура ДовыгрузитьКореньВерсииВXML(Контекст)
	Если ОбщегоНазначения.ФайлСуществует(Контекст.КаталогВыгрузкиВXML + "Configuration.xml") Тогда
		Возврат;
	КонецЕсли;
	
	КаталогВыгрузкиКорня = ВыгрузитьОбъектыВКаталог(Контекст, "Configuration", "configuration");
	
	ФайлыКорняККопированию = НайтиФайлы(КаталогВыгрузкиКорня, "*", Ложь);
	Для Каждого ФайлКорняККопированию Из ФайлыКорняККопированию Цикл
		Если ФайлКорняККопированию.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		КопироватьФайл(ФайлКорняККопированию.ПолноеИмя, Контекст.КаталогВыгрузкиВXML + ФайлКорняККопированию.Имя);
	КонецЦикла;
	
	КаталогРасширенныхДанныхКорняИсточник = КаталогВыгрузкиКорня + "Ext";
	КаталогРасширенныхДанныхКорняПриемник = Контекст.КаталогВыгрузкиВXML + "Ext";
	Если ОбщегоНазначения.КаталогСуществует(КаталогРасширенныхДанныхКорняИсточник) Тогда
		СкопироватьКаталогЦеликом(КаталогРасширенныхДанныхКорняПриемник, КаталогРасширенныхДанныхКорняИсточник);
	КонецЕсли;
	
	// Теперь считываем из этого корня языки
	// Если есть языки, выгружаем их и подкидываем туда в корень
	СтруктураDOM = ОбщегоНазначения.СтруктураDOM(КаталогВыгрузкиКорня + "Configuration.xml");
	ИменаЯзыков = ОбщегоНазначения.ИменаЯзыковКонфигурации(СтруктураDOM);
	Если ИменаЯзыков.Количество() > 0 Тогда
		ИменаОбъектов = "Language." + СтрСоединить(ИменаЯзыков, Символы.ПС + "Language.");
		КаталогВыгрузкиЯзыков = ВыгрузитьОбъектыВКаталог(Контекст, ИменаОбъектов, "language");
		СкопироватьКаталогЦеликом(КаталогВыгрузкиЯзыков + "Languages", Контекст.КаталогВыгрузкиВXML + "Languages");
	КонецЕсли;
	
КонецПроцедуры

// Загружает выгрузку XML формата 1С:Предприятие в проект EDT и составляет индекс.
//
// Параметры:
//   ПараметрыХранилища - Структура - См. КонвертацияХранилища.ПараметрыХранилища.
//   ПараметрыВерсии - Структура - См. Справочники.ВерсииХранилища.ПараметрыВерсии.
//
Процедура ЗагрузитьВерсиюВEDT(ПараметрыВерсии, ПараметрыХранилища) Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	Если Не Справочники.ВерсииХранилища.НачатьОбработкуВерсии(
			ПараметрыВерсии.Ссылка,
			ПараметрыВерсии,
			Перечисления.СостоянияВерсии.ВыгруженаВXML,
			Перечисления.СостоянияВерсии.ЗагружаетсяВEDT) Тогда
		Возврат;
	КонецЕсли;
	Попытка
		
		Контекст = КонтекстРаботыСВерсией(ПараметрыВерсии, ПараметрыХранилища);
		
		ИмпортироватьВерсиюВEDTCLI(Контекст);
		
		// Копируем файл дампа в каталог проекта EDT чтобы был доступен для формирования частичной выгрузки
		ИмяФайлаИсточника = Контекст.КаталогВременныхФайлов + "ConfigDumpInfo.xml";
		ИмяФайлаПриемника = Контекст.КаталогИсходниковEDT + "ConfigDumpInfo.xml";
		Если ОбщегоНазначения.ФайлСуществует(ИмяФайлаИсточника) Тогда
			СоздатьКаталогиВИерерахии(Контекст.КаталогИсходниковEDT);
			КопироватьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника);
		КонецЕсли;
		
		ПрочитатьСтруктуруВыгрузкиВерсии(Контекст);
		
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить("Состояние", Перечисления.СостоянияВерсии.ЗагруженаВEDT);
		СтруктураРеквизитов.Вставить("КоличествоМетаданных", Контекст.КоличествоМетаданных);
		Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(ПараметрыВерсии.Ссылка, СтруктураРеквизитов);
		
	Исключение
		Справочники.ВерсииХранилища.ВозниклаОшибка(ПараметрыВерсии.Ссылка, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Загружает XML-выгрузку конфигурации в проект EDT при помощи EDT cli.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
Процедура ИмпортироватьВерсиюВEDTCLI(Контекст)
	ЗаписатьВЛогВерсии(Контекст, 3, "ru='Импорт в 1C:EDT: Начало'", , 5);
	
	ОбщегоНазначения.УдалитьФайлИлиКаталог(Контекст.РабочийКаталогEDT);
	ОбщегоНазначения.УдалитьФайлИлиКаталог(Контекст.КаталогПроектаEDT);
	
	Фрагменты = Новый Массив;
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		Фрагменты.Добавить("cmd /C chcp 65001 &&");
	КонецЕсли;
	Если ЗначениеЗаполнено(Контекст.ВерсияEDTCLI) Тогда
		ПутьКCLI = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контекст.ВерсияEDTCLI, "ПутьКCLI");
	Иначе
		ПутьКCLI = "";
	КонецЕсли;
	Если ПустаяСтрока(ПутьКCLI) Тогда
		Фрагменты.Добавить("1cedtcli");
	Иначе
		Фрагменты.Добавить(Контекст.ПутьКCLI);
	КонецЕсли;
	
	// -data — Расположение рабочей области 1C:EDT. https://its.1c.ru/db/edtdoc#content:10330:hdoc.
	Фрагменты.Добавить("-data " + ОбщегоНазначения.УдалитьКонечныйРазделительПути(Контекст.РабочийКаталогEDT));
	
	// -vmargs — Аргументы JVM.
	Фрагменты.Добавить("-vmargs -Dfile.encoding=UTF-8"); // -Dosgi.nl=ru
	
	// Импортирует .xml-файлы конфигурации в проект 1C:EDT. https://its.1c.ru/db/edtdoc#content:10608:hdoc:t000608__import
	//  --version — Необязательный аргумент. Версия платформы "1С:Предприятия", которая будет назначена проекту.
	//    Например, 8.3.22. Если версия не задана, то она будет определена по версии .xml-файлов конфигурации.
	//  --base-project-name — Имя базового проекта. Для проектов расширений, внешних отчетов и обработок.
	//  --configuration-files — Обязательный аргумент. Каталог, содержащий .xml-файлы конфигурации.
	//  --build — если этот аргумент имеет значение true, то проект 1С:EDT запускается сразу после завершения импорта.
	//    Выполняется сборка объектов конфигурации и языковых модулей;
	//  Один из следующих обязательных аргументов:
	//    --project — путь к каталогу проекта 1C:EDT, в который следует импортировать .xml-файлы.
	//      Если каталог уже содержит какие-то файлы, то новые файлы будут добавлены к существующим.
	//      Если этот проект не импортирован в рабочую область, переданную в параметре -data, то перед импортом в него 
	//      .xml-файлов конфигурации будет выполнен импорт этого проекта в рабочую область.
	//    --project-name — имя проекта 1C:EDT, в который следует импортировать .xml-файлы.
	//      Если такой проект уже существует в рабочей области, переданной в параметре -data, то будет выдана ошибка.
	Фрагменты.Добавить("-command import");
	Если Контекст.ТипХранилища = Перечисления.ТипыХранилищаКонфигураций.Расширение Тогда
		Фрагменты.Добавить(СтрШаблон("--base-project-name ""%1""", Контекст.БазовыйПроект));
	КонецЕсли;
	Фрагменты.Добавить(СтрШаблон("--project ""%1""",
		ОбщегоНазначения.УдалитьКонечныйРазделительПути(Контекст.КаталогПроектаEDT)));
	Фрагменты.Добавить(СтрШаблон("--configuration-files ""%1""",
		ОбщегоНазначения.УдалитьКонечныйРазделительПути(Контекст.КаталогВыгрузкиВXML)));
	
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		Фрагменты.Добавить(СтрШаблон(">> ""%1"" 2>&1", Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрСоединить(Фрагменты, " "), Контекст.КаталогВременныхФайлов, Истина, КодВозврата);
	Успех = (КодВозврата = 0);
	
	ТекстЛога = СтрШаблон("ru='Выгрузка конфигурации в XML: Завершение. Код возврата: %1.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
	ЗаписатьВЛогВерсии(Контекст, ?(Успех, 3, 2), ТекстЛога, , 70);
	
	Если Не Успех Тогда
		ВызватьИсключениеПриОбработкеВерсии(Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Получает информацию о серверном репозитории или возвращает текст ошибки доступа
// 
// Параметры:
//	АдресРепозиторияGit - Строка - адрес репозитория Git на сервере
//	
// Возвращаемое значение:
// 	Структура - Результат запроса информации с сервера, содержит:
// 	* Успешно - Булево - Истина, если результат запроса к серверу был успешный
// 	* ТекстОшибки - Строка - текст ошибки если запрос к серверу был не успешный
// 	* Ветки - Массив из Строка - список имен веток доступных на сервере
//
Функция ПолучитьИнформациюРепозиторияGitНаСервере(АдресРепозиторияGit) Экспорт
	
	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
	
	ИмяФайлаВывода = ПолучитьИмяВременногоФайла("txt");
	
	СтрокаКоманды = "git ls-remote --heads %АдресРепозиторияGit%> ""%ИмяФайлаВывода%"" 2>&1";
	
	
	СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%ИмяФайлаВывода%", ИмяФайлаВывода);
	СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%АдресРепозиторияGit%", АдресРепозиторияGit);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(?(ЭтоWindowsСервер, "cmd /C ", "")
		+ СтрокаКоманды, КаталогВременныхФайлов(), Истина, КодВозврата);
	
	Результат = Новый Структура("Успешно, ТекстОшибки, Ветки", Ложь, "", Новый Массив());
	
	ФайлВывода = Новый ТекстовыйДокумент();
	ФайлВывода.Прочитать(ИмяФайлаВывода, КодировкаТекста.UTF8);
	
	Если КодВозврата = 0 Тогда
		Результат.Успешно = Истина;
		Для НомерСтроки = 1 По ФайлВывода.КоличествоСтрок() Цикл
			ИмяВетки = СокрЛП(ФайлВывода.ПолучитьСтроку(НомерСтроки));
			ПозицияТаб = СтрНайти(ИмяВетки, Символы.Таб);
			Если ПозицияТаб > 0 Тогда
				ИмяВетки = СокрЛП(Сред(ИмяВетки, ПозицияТаб + 1));
			КонецЕсли;
			Если СтрНачинаетсяС(ИмяВетки, "refs/heads/") Тогда
				ИмяВетки = Сред(ИмяВетки, 12);
			КонецЕсли;
			Результат.Ветки.Добавить(ИмяВетки);
		КонецЦикла;
		
	Иначе
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = ФайлВывода.ПолучитьТекст();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Считывает структуру выгрузки версии из файлов
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
Процедура ПрочитатьСтруктуруВыгрузкиВерсии(Контекст) Экспорт
	
	ЗаписатьВЛогВерсии(Контекст, 3, "ru='Чтение общего количества файлов: Начало'", , 80);
	
	ТаблицаИндексов = СозадатьТаблицуИндексов();
	ТаблицаИндексов.Индексы.Добавить("ХешПолногоИмени, Уровень, ПолноеИмя");
	ТаблицаИндексов.Колонки.Добавить("ПодчиненныеОбъекты");
	
	КвалифицированныеИменаДочернихОбъектов = ОбщегоНазначенияПовтИсп.КвалифицированныеИменаДочернихОбъектов();

	КвалифицированныеОбъекты = Новый Соответствие;
	Для каждого КлючИЗначение Из КвалифицированныеИменаДочернихОбъектов Цикл
		КвалифицированныеОбъекты.Вставить(КлючИЗначение.Значение, КлючИЗначение.Ключ);
	КонецЦикла;
	
	КоличествоОбработано = ТаблицаИндексов.Количество();
	
	ИмяФайлаИндексов = Контекст.КаталогИсходниковEDT + "DumpFilesIndex.txt";
	
	Файлы = НайтиФайлы(Контекст.КаталогИсходниковEDT, "*", Истина);
	
	КоличествоВсего = Файлы.Количество();
	Если КоличествоВсего = 0 Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"ru = '%1: После загрузки XML в EDT не найдено ни одного файла в каталоге.
			|  Каталог XML: %2;
			|  Каталог проекта EDT: %3;
			|  Искали файлы в каталоге src проекта EDT: %4.'",
			Контекст.Ссылка,
			Контекст.КаталогВыгрузкиВXML,
			Контекст.КаталогПроектаEDT,
			Контекст.КаталогИсходниковEDT);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	НачалоЗагрузки = ТекущаяДатаСеанса();
	
	ЗаписатьВЛогВерсии(Контекст, 3, "ru='Чтение хеш-сумм файлов'", , 81);
	
	Для Каждого Файл Из Файлы Цикл
		Если Файл.ПолноеИмя = ИмяФайлаИндексов Тогда
			Продолжить;
		КонецЕсли;
		
		Если Файл.ЭтоФайл() Тогда
			ПолноеИмя = СтрЗаменить(Файл.ПолноеИмя, Контекст.КаталогИсходниковEDT, "");

			Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
			Хеширование.Добавить(ПолноеИмя);
			ХешПолногоИмени = Строка(Хеширование.ХешСумма);
			ХешПолногоИмени = СтрЗаменить(ХешПолногоИмени, " ", "");
			Пути = СтрРазделить(ПолноеИмя, ПолучитьРазделительПути());
			Отбор = Новый Структура;
			Отбор.Вставить("ХешПолногоИмени", ХешПолногоИмени);
			Отбор.Вставить("ПолноеИмя", ПолноеИмя);
			Отбор.Вставить("Уровень", Пути.Количество());

			НайденныеСтроки = ТаблицаИндексов.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда

				ПодчиненныеОбъекты = Новый Массив();

				Если СтрЗаканчиваетсяНа(ПолноеИмя, ".mdo") Тогда
					Отбор.Вставить("ФайлПолноеИмя", Файл.ПолноеИмя);
					ПрочитатьСвойстваОбъектаМетаданныхEDT(Отбор, КвалифицированныеОбъекты, ПодчиненныеОбъекты);
				КонецЕсли;

				НоваяСтрока = ТаблицаИндексов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Отбор);
				НоваяСтрока.ПодчиненныеОбъекты = ПодчиненныеОбъекты;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;
	
	ЗаписатьВЛогВерсии(Контекст, 3, "ru='Расчет идентификаторов подчиненных объектов'", , 94);
	
	Для Каждого СтрокаТЧ Из ТаблицаИндексов Цикл
		Если ПустаяСтрока(СтрокаТЧ.UUID) Тогда
			СтрокаТЧ.UUID = СформироватьUUIDПоРодителюEDT(СтрокаТЧ.ПолноеИмя, ТаблицаИндексов);
		КонецЕсли;
	КонецЦикла;
	
	// Проверки.
	КоличествоМетаданных = ТаблицаИндексов.Количество();
	Если Не Контекст.ВыгруженыТолькоИзменения
		И Контекст.МинимальноеКоличествоМетаданных > 0
		И Контекст.МинимальноеКоличествоМетаданных > КоличествоМетаданных Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"ru = 'Количество метаданных в выгрузке EDT (%1) ниже установленного минимума (%2) для хранилища.'",
			КоличествоМетаданных,
			Контекст.МинимальноеКоличествоМетаданных);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Если Не ОбщегоНазначения.КаталогСуществует(Контекст.КаталогИсходниковEDT) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"ru = 'Пока создавалась ТаблицаИндексов каталог %1 исчез. Содержимое таблицы индексов: %2'",
			Контекст.КаталогИсходниковEDT,
			Символы.ПС + ОбщегоНазначения.ЗначениеВСтрокуXML(ТаблицаИндексов));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ЗаписатьВЛогВерсии(Контекст, 3, "ru='Запись файла индексов'", , 98);
	
	ЗаписатьТаблицуИндексов(ТаблицаИндексов, ИмяФайлаИндексов);
	Контекст.КоличествоМетаданных = КоличествоМетаданных;
	
КонецПроцедуры

// Выполняет поиск уникального идентификатора родителя для указанного файла и формирует UUID для файла
// 
// Параметры:
// 	ПолноеИмя - Строка - полное имя файла для которого необходимо найти UUID родителя
// 	ТаблицаИндексов - ТаблицаЗначений - Таблица индексов для поиска
// Возвращаемое значение:
// 	Строка - Уникальный идентификатор для текущего файла
Функция СформироватьUUIDПоРодителюEDT(ПолноеИмя, ТаблицаИндексов)

	UUID = ПолноеИмя;

	Пути = СтрРазделить(ПолноеИмя, ПолучитьРазделительПути());
	ПолноеИмяРодителя = "";
	Уровень = 0;
	Путь = "";
	ИмяДочернегоОбъекта = "";
	ТипДочернегоОбъекта = "";
	
	КвалифицированныеИмена = ОбщегоНазначенияПовтИсп.КвалифицированныеИменаДочернихОбъектов();

	Если Пути.Количество() > 1 И Пути[0] = "Configuration" Тогда
		Пути.Очистить();
		Пути.Добавить("Configuration");
		Пути.Добавить("Configuration");
		Уровень = Пути.Количество();
		ПолноеИмяРодителя = СтрСоединить(Пути, ПолучитьРазделительПути()) + ".mdo";
		Пути.Удалить(Пути.ВГраница());
	Иначе
		Пока Пути.Количество() > 1 Цикл
			Путь = Пути[Пути.ВГраница()];
			Пути.Удалить(Пути.ВГраница());
			Если Пути.Количество() = 2 Тогда
				Пути.Добавить(Пути[Пути.ВГраница()] + ".mdo");
				ПолноеИмяРодителя = СтрСоединить(Пути, ПолучитьРазделительПути());
				Уровень = Пути.Количество();
				Пути.Удалить(Пути.ВГраница());
				Прервать;
			ИначеЕсли Пути.Количество() > 2 И КвалифицированныеИмена.Получить(Пути[Пути.ВГраница()]) <> Неопределено Тогда
				ИмяДочернегоОбъекта = Путь;
				СегментПутиДочернегоОбъекта = Пути[Пути.ВГраница()];
				ТипДочернегоОбъекта = КвалифицированныеИмена.Получить(СегментПутиДочернегоОбъекта);
				Пути.Удалить(Пути.ВГраница());
				Пути.Добавить(Пути[Пути.ВГраница()] + ".mdo");
				ПолноеИмяРодителя = СтрСоединить(Пути, ПолучитьРазделительПути());
				Уровень = Пути.Количество();
				Пути.Удалить(Пути.ВГраница());
				Пути.Добавить(СегментПутиДочернегоОбъекта);
				Пути.Добавить(ИмяДочернегоОбъекта);
				Прервать;
			ИначеЕсли Пути[0] = "Subsystems" И Пути[Пути.ВГраница()-1] = "Subsystems" Тогда
				Пути.Добавить(Пути[Пути.ВГраница()] + ".mdo");
				ПолноеИмяРодителя = СтрСоединить(Пути, ПолучитьРазделительПути());
				Уровень = Пути.Количество();
				Пути.Удалить(Пути.ВГраница());
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПолноеИмяРодителя) Тогда
		Отбор = Новый Структура();
		Отбор.Вставить("ПолноеИмя", ПолноеИмяРодителя);
		Отбор.Вставить("Уровень", Уровень);
		Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
		Хеширование.Добавить(ПолноеИмяРодителя);
		ХешПолногоИмени = Строка(Хеширование.ХешСумма);
		ХешПолногоИмени = СтрЗаменить(ХешПолногоИмени, " ", "");
		Отбор.Вставить("ХешПолногоИмени", ХешПолногоИмени);

		Имя = СтрЗаменить(ПолноеИмя, СтрСоединить(Пути, ПолучитьРазделительПути())
			+ ПолучитьРазделительПути(), "");

		НайденныеСтроки = ТаблицаИндексов.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(ИмяДочернегоОбъекта)
					И ТипЗнч(НайденныеСтроки[0].ПодчиненныеОбъекты) = Тип("Массив") Тогда
				Для Каждого ПодчиненныйОбъект Из НайденныеСтроки[0].ПодчиненныеОбъекты Цикл
					Если ПодчиненныйОбъект.Тип = ТипДочернегоОбъекта
							И ПодчиненныйОбъект.Имя = ИмяДочернегоОбъекта Тогда
						UUID = ПодчиненныйОбъект.UUID + "_" + Имя;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ЗначениеЗаполнено(НайденныеСтроки[0].UUID) Тогда
				UUID = НайденныеСтроки[0].UUID + "_" + Имя;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат UUID;
КонецФункции

// Дополняет "Параметры" подключением к хранилищу
// Параметры:
//  Хранилище - СправочникСсылка.ХранилищаКонфигураций - Ссылка на хранилище
//  Параметры - Структура - структура, которая будет дополнена параметрами подключения к хранилищу  
Процедура ПараметрыПодключенияКХранилищу(Знач Хранилище, Параметры) Экспорт

	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;

	ИменаРеквизитов = Новый Структура("АдресХранилища, ВерсияПлатформыХранилища, ИмяПользователяХранилища, 
		| ПарольПользователяХранилища", "Адрес", "ВерсияПлатформыХранилища");
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Хранилище, ИменаРеквизитов);

	Если Параметры.Свойство("КопияХранилища") Тогда

		РеквизитыКопии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.КопияХранилища, "Адрес, ИмяПользователяХранилища, ПарольПользователяХранилища");
		Реквизиты.АдресХранилища = РеквизитыКопии.Адрес;
		Если ЗначениеЗаполнено(РеквизитыКопии.ИмяПользователяХранилища) Тогда

			Реквизиты.ИмяПользователяХранилища = РеквизитыКопии.ИмяПользователяХранилища;
			Реквизиты.ПарольПользователяХранилища = РеквизитыКопии.ПарольПользователяХранилища;

		КонецЕсли;

	КонецЕсли;

	Параметры.Вставить("АдресХранилища", Реквизиты.АдресХранилища);

	// Получаем каталог исполняемого файла
	Параметры.Вставить("ВерсияПлатформыХранилища", Реквизиты.ВерсияПлатформыХранилища);

	Параметры.Вставить("ИмяПользователяХранилища", Реквизиты.ИмяПользователяХранилища);
	Параметры.Вставить("ПарольПользователяХранилища", Реквизиты.ПарольПользователяХранилища);

КонецПроцедуры

// Дополняет "Параметры" для работы с расширением конфигурации
// 
// Параметры:
//  Хранилище - СправочникСсылка.ХранилищаКонфигураций - Ссылка на хранилище
//  Параметры - Структура - структура, которая будет дополнена параметрами расширения конфигурации  
Процедура ПараметрыРасширения(Знач Хранилище, Параметры) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;

	ИменаРеквизитов = Новый Структура("ТипХранилища,БазовыйПроект,ИмяРасширения");
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Хранилище, ИменаРеквизитов);
	
	Параметры.Вставить("ТипХранилища", Реквизиты.ТипХранилища);
	Если ТипЗнч(Реквизиты.БазовыйПроект) = Тип("СправочникСсылка.ХранилищаКонфигураций") 
		И ЗначениеЗаполнено(Реквизиты.БазовыйПроект) Тогда
		ИмяПроектаEDT = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизиты.БазовыйПроект, "ИмяПроектаEDT");
		СегментыПути = СтрРазделить(ИмяПроектаEDT, ПолучитьРазделительПути());
		Если СегментыПути.Количество() > 0 Тогда
			ИмяПроектаEDT = СегментыПути[СегментыПути.ВГраница()];
		КонецЕсли;
		Параметры.Вставить("БазовыйПроект", ИмяПроектаEDT);
	Иначе
		Параметры.Вставить("БазовыйПроект", Строка(Реквизиты.БазовыйПроект));
	КонецЕсли;
	Параметры.Вставить("ИмяРасширения", Реквизиты.ИмяРасширения);
	Параметры.Вставить("КаталогПустогоРасширения", Параметры.КаталогВременныхФайлов + "empty_ext" + ПолучитьРазделительПути());
	
КонецПроцедуры

// Выполняет инициализацию хранилища в Git
// 
// Параметры:
// 	Хранилище - СправочникСсылка.ХранилищаКонфигураций - Ссылка на хранилище, по которому выполняются коммиты
// 	ЛогОперации - ТекстовыйДокумент - документ в который будет прочитан лог выполенения операции
// 	Клонировать - Булево - клонировать с сервера существующий репозиторий
// 	СоздатьВетку - Булево - Создать новую ветку от основной ветки серверного репозитория
Процедура СоздатьРепозиторийGit(Хранилище, ЛогОперации, Клонировать = Ложь, СоздатьВетку = Ложь) Экспорт

	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();

	ИменаРеквизитов = Новый Структура("ВерсияВGit, Код, ЛокальныйКаталогGit, КаталогВыгрузкиВерсий, АдресРепозиторияGit, 
		| ИмяПроектаEDT, ПользовательСервераGit, ПарольСервераGit, ИмяВетки", 
		"ВерсияВGit", "ВерсияВGit.Код");
	РеквизитыХранилища = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Хранилище, ИменаРеквизитов);
	
	СоздатьКаталогиВИерерахии(РеквизитыХранилища.КаталогВыгрузкиВерсий);
	СоздатьКаталогиВИерерахии(РеквизитыХранилища.ЛокальныйКаталогGit);
	
	ФайлЛога = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(РеквизитыХранилища.КаталогВыгрузкиВерсий)
		+ "git_log_init" + ".txt";
	ФайлКомандыGit = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(РеквизитыХранилища.КаталогВыгрузкиВерсий)
		+ "git_command_init" + ?(ЭтоWindowsСервер, ".bat", ".sh");
	
	Параметры = Новый Структура("ИмяФайлаЛога", ФайлЛога);
	ДобавитьЗаписьВЛог(Параметры, НСтр("ru = 'Начало инициализации Git репозитория'"));
	
	ФайлКоманды = Новый ТекстовыйДокумент;

	Если ЭтоWindowsСервер Тогда
		ТекстКоманды = "chcp 65001";
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	Иначе
		ТекстКоманды = "#!/bin/bash";
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	КонецЕсли;

	ТекстКоманды = ?(ЭтоWindowsСервер, "set ", "") + "LOGFILE=""%ФайлЛога%""";
	ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ФайлЛога%", ФайлЛога);
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);

	Если ЭтоWindowsСервер Тогда
		ВыводЛога = " >> %LOGFILE% 2>&1";
	Иначе
		ВыводЛога = " >> $LOGFILE 2>&1";
	КонецЕсли;
	
	Если ЭтоWindowsСервер Тогда
		ТекстКомандыУстановкиКаталога = "cd /D ""%ЛокальныйКаталогGit%""" + ВыводЛога;
	Иначе
		ТекстКомандыУстановкиКаталога = "cd ""%ЛокальныйКаталогGit%""" + ВыводЛога;
	КонецЕсли;
	ТекстКомандыУстановкиКаталога = СтрЗаменить(ТекстКомандыУстановкиКаталога, "%ЛокальныйКаталогGit%", РеквизитыХранилища.ЛокальныйКаталогGit);

	ФайлКоманды.ДобавитьСтроку(ТекстКомандыУстановкиКаталога);

	// Инициализация репозитория
	АдресРепозиторияGit = РеквизитыХранилища.АдресРепозиторияGit;
	ПозицияРазделителя = СтрНайти(АдресРепозиторияGit, "://");
	Если ПозицияРазделителя > 0 Тогда
		АдресРепозиторияGit = Лев(АдресРепозиторияGit, ПозицияРазделителя + 2)
			+ РеквизитыХранилища.ПользовательСервераGit + ":" + РеквизитыХранилища.ПарольСервераGit + "@" + Прав(
				АдресРепозиторияGit, СтрДлина(АдресРепозиторияGit) - ПозицияРазделителя - 2);
	КонецЕсли;
	
	Если Клонировать И Не СоздатьВетку И ЗначениеЗаполнено(АдресРепозиторияGit) Тогда
		ТекстКоманды = "git clone -b ""%ИмяВетки%"" %АдресРепозиторияGit% ." + ВыводЛога;
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%АдресРепозиторияGit%", АдресРепозиторияGit);
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ИмяВетки%", РеквизитыХранилища.ИмяВетки);
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	ИначеЕсли Клонировать И СоздатьВетку И ЗначениеЗаполнено(АдресРепозиторияGit) Тогда
		ТекстКоманды = "git clone %АдресРепозиторияGit% ." + ВыводЛога;
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%АдресРепозиторияGit%", АдресРепозиторияGit);
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		ТекстКоманды = "git checkout -b ""%ИмяВетки%""" + ВыводЛога;
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ИмяВетки%", РеквизитыХранилища.ИмяВетки);
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	Иначе
		ТекстКоманды = "git init" + ВыводЛога;
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		Если ЗначениеЗаполнено(АдресРепозиторияGit) Тогда
			ТекстКоманды = "git remote add origin %АдресРепозиторияGit%" + ВыводЛога;
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%АдресРепозиторияGit%", АдресРепозиторияGit);
			ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
			ТекстКоманды = "git fetch origin" + ВыводЛога;
			ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		КонецЕсли;
	КонецЕсли;
	

	// Делаем пути к файлам русскоязычными
	ТекстКоманды = "git config --local core.quotepath false" + ВыводЛога;
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);

	// кодировка по умолчанию при просмотре
	ТекстКоманды = "git config --local gui.encoding utf-8" + ВыводЛога;
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);

	// Кодировка сообщений в коммитах
	ТекстКоманды = "git config --local i18n.commitEncoding utf-8" + ВыводЛога;
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);

	// Устанавливаем количество переименованных файлов = 0, т.к. все переименования мы делаем вручную
	ТекстКоманды = "git config --local diff.renameLimit 1" + ВыводЛога;
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);

	// Отключаем автоопределение переименования, переименования устанавливаем вручную
	ТекстКоманды = "git config --local diff.renames false" + ВыводЛога;
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	
	// Настраиваем символы окончания строк
	Если ЭтоWindowsСервер Тогда
		ТекстКоманды = "git config --local core.autocrlf true" + ВыводЛога;
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	Иначе
		ТекстКоманды = "git config --local core.autocrlf input" + ВыводЛога;
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	КонецЕсли;
	ТекстКоманды = "git config --local core.safecrlf warn" + ВыводЛога;
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	ТекстКоманды = "git status" + ВыводЛога;
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);

	Если ЭтоWindowsСервер Тогда
		ФайлКоманды.Записать(ФайлКомандыGit, "CESU-8");
	Иначе
		ФайлКоманды.Записать(ФайлКомандыGit, "CESU-8", Символы.ПС);
	КонецЕсли;

	ЗапуститьПриложение(?(ЭтоWindowsСервер, "", "bash ")
		+ ФайлКомандыGit, РеквизитыХранилища.ЛокальныйКаталогGit, Истина);
	
	СоздатьКаталогиВИерерахии(ОбщегоНазначения.ДобавитьКонечныйРазделительПути(РеквизитыХранилища.ЛокальныйКаталогGit)
		+ КаталогФайловПроектаВРепозитории(РеквизитыХранилища));
	
	ИмяФайлаИсключений = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(РеквизитыХранилища.ЛокальныйКаталогGit)
		+ ".gitignore";
	ЕстьИсключениеИндекса = Ложь;
	ЕстьИсключениеДампа = Ложь;

	Файл = Новый Файл(ИмяФайлаИсключений);
	ФайлИсключений = Новый ТекстовыйДокумент;
	Если Файл.Существует() Тогда
		ФайлИсключений.Прочитать(ИмяФайлаИсключений);
	КонецЕсли;
	Для Индекс = 1 По ФайлИсключений.КоличествоСтрок() Цикл
		СтрокаФайла = ФайлИсключений.ПолучитьСтроку(Индекс);
		Если НЕ ЕстьИсключениеИндекса И СтрокаФайла = "DumpFilesIndex.txt" Тогда
			ЕстьИсключениеИндекса = Истина;
		КонецЕсли;
		Если НЕ ЕстьИсключениеДампа И СтрокаФайла = "ConfigDumpInfo.xml" Тогда
			ЕстьИсключениеДампа = Истина;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЕстьИсключениеИндекса Тогда
		ФайлИсключений.ДобавитьСтроку("DumpFilesIndex.txt");
	КонецЕсли;
	Если НЕ ЕстьИсключениеДампа Тогда
		ФайлИсключений.ДобавитьСтроку("ConfigDumpInfo.xml");
	КонецЕсли;
	
	Если НЕ ЕстьИсключениеИндекса ИЛИ НЕ ЕстьИсключениеДампа Тогда
		ФайлИсключений.Записать(ИмяФайлаИсключений, "CESU-8");
	КонецЕсли;
	
	// В атрибуты добавляем настройки для бинарных файлов
	ИмяФайлаАтрибутов = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(РеквизитыХранилища.ЛокальныйКаталогGit) 
		+ ".gitattributes";
	Файл = Новый Файл(ИмяФайлаАтрибутов);
	Если НЕ Файл.Существует() Тогда
		ФайлАтрибутов = Новый ТекстовыйДокумент();
		ФайлАтрибутов.ДобавитьСтроку("# Binary file extensions that should not be modified.");
		ФайлАтрибутов.ДобавитьСтроку("*.bin binary");
		ФайлАтрибутов.ДобавитьСтроку("*.axdt binary");
		ФайлАтрибутов.ДобавитьСтроку("*.addin binary");
		ФайлАтрибутов.Записать(ИмяФайлаАтрибутов, "CESU-8");
	КонецЕсли;
	
	// Добавляем изменения в индекс и проверяем статус
	СтрокаКоманды = "git add --all ./ >> ""%ФайлЛога%"" 2>&1 && git status >> ""%ФайлЛога%"" 2>&1";
	СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%ФайлЛога%", ФайлЛога);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(?(ЭтоWindowsСервер, "cmd /C ", "")
		+ СтрокаКоманды, РеквизитыХранилища.ЛокальныйКаталогGit, Истина, КодВозврата);
	
	Если КодВозврата <> Неопределено И КодВозврата <> 0 Тогда
		ДобавитьЗаписьВЛог(Параметры, НСтр("ru = 'Инициализация Git репозитория выполнена с ошибкой.'"));
	КонецЕсли;
	
	ДобавитьЗаписьВЛог(Параметры, НСтр("ru = 'Окончание инициализации Git репозитория'"));
	
	Файл = Новый Файл(ФайлЛога);
	Если Файл.Существует() Тогда
		ЛогОперации.Прочитать(ФайлЛога, КодировкаТекста.UTF8);
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает адрес серверного хранилища в Git в локальный репозиторий
// 
// Параметры:
// 	Хранилище - СправочникСсылка.ХранилищаКонфигураций - Ссылка на хранилище, по которому выполняются коммиты
// 	ЛогОперации - ТабличныйДокумент - документ в который будет прочитан лог выполенения операции
// 	ВеткаСуществует - Булево - серверная ветка существует
Процедура УстановитьАдресРепозиторияGit(Хранилище, ЛогОперации, ВеткаСуществует) Экспорт

	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();

	ИменаРеквизитов = Новый Структура("ВерсияВGit, Код, ЛокальныйКаталогGit, КаталогВыгрузкиВерсий, АдресРепозиторияGit, ПользовательСервераGit, ПарольСервераGit, ИмяВетки", "ВерсияВGit", "ВерсияВGit.Код");
	РеквизитыХранилища = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Хранилище, ИменаРеквизитов);

	ФайлЛога = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(РеквизитыХранилища.КаталогВыгрузкиВерсий)
		+ "git_log_add_remote" + ".txt";
	ФайлКомандыGit = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(РеквизитыХранилища.КаталогВыгрузкиВерсий)
		+ "git_command_add_remote" + ?(ЭтоWindowsСервер, ".bat", ".sh");
	
	Параметры = Новый Структура("ИмяФайлаЛога", ФайлЛога);
	ДобавитьЗаписьВЛог(Параметры, НСтр("ru = 'Начало добавления адреса Git репозитория'"));
	
	ФайлКоманды = Новый ТекстовыйДокумент;

	Если ЭтоWindowsСервер Тогда
		ТекстКоманды = "chcp 65001";
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	Иначе
		ТекстКоманды = "#!/bin/bash";
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	КонецЕсли;

	ТекстКоманды = ?(ЭтоWindowsСервер, "set ", "") + "LOGFILE=""%ФайлЛога%""";
	ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ФайлЛога%", ФайлЛога);
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);

	Если ЭтоWindowsСервер Тогда
		ВыводЛога = " >> %LOGFILE% 2>&1";
	Иначе
		ВыводЛога = " >> $LOGFILE 2>&1";
	КонецЕсли;
	
	Если ЭтоWindowsСервер Тогда
		ТекстКомандыУстановкиКаталога = "cd /D ""%ЛокальныйКаталогGit%""" + ВыводЛога;
	Иначе
		ТекстКомандыУстановкиКаталога = "cd ""%ЛокальныйКаталогGit%""" + ВыводЛога;
	КонецЕсли;
	ТекстКомандыУстановкиКаталога = СтрЗаменить(ТекстКомандыУстановкиКаталога, "%ЛокальныйКаталогGit%", РеквизитыХранилища.ЛокальныйКаталогGit);

	ФайлКоманды.ДобавитьСтроку(ТекстКомандыУстановкиКаталога);

	Если ЭтоWindowsСервер Тогда
		ТекстКоманды = "git remote remove origin" + ВыводЛога + " || set ERRORLEVEL=0";
	Иначе
		ТекстКоманды = "git remote remove origin" + ВыводЛога + " || true";
	КонецЕсли;
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);

	// Инициализация репозитория
	АдресРепозиторияGit = РеквизитыХранилища.АдресРепозиторияGit;
	Если ЗначениеЗаполнено(АдресРепозиторияGit) Тогда
		ТекстКоманды = "git remote add origin %АдресРепозиторияGit%" + ВыводЛога;
		ПозицияРазделителя = СтрНайти(АдресРепозиторияGit, "://");
		Если ПозицияРазделителя > 0 и ЗначениеЗаполнено(РеквизитыХранилища.ПользовательСервераGit) Тогда
			АдресРепозиторияGit = Лев(АдресРепозиторияGit, ПозицияРазделителя + 2)
				+ РеквизитыХранилища.ПользовательСервераGit + ":"
				+ РеквизитыХранилища.ПарольСервераGit + "@"
				+ Прав(АдресРепозиторияGit, СтрДлина(АдресРепозиторияGit)
				- ПозицияРазделителя - 2);
		КонецЕсли;
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%АдресРепозиторияGit%", АдресРепозиторияGit);
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		ТекстКоманды = "git fetch origin" + ВыводЛога;
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		Если ВеткаСуществует Тогда
			ТекстКоманды = "git branch --set-upstream-to=origin/%ИмяВетки% %ИмяВетки%" + ВыводЛога;
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ИмяВетки%", РеквизитыХранилища.ИмяВетки);
			ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		КонецЕсли;
	КонецЕсли;

	Если ЭтоWindowsСервер Тогда
		ФайлКоманды.Записать(ФайлКомандыGit, "CESU-8");
	Иначе
		ФайлКоманды.Записать(ФайлКомандыGit, "CESU-8", Символы.ПС);
	КонецЕсли;

	КодВозврата = Неопределено;
	ЗапуститьПриложение(?(ЭтоWindowsСервер, "", "bash ")
		+ ФайлКомандыGit, РеквизитыХранилища.ЛокальныйКаталогGit, Истина, КодВозврата);

	Если КодВозврата <> Неопределено И КодВозврата <> 0 Тогда
		ДобавитьЗаписьВЛог(Параметры, НСтр("ru = 'Установка адреса Git-сервера выполнена с ошибкой.'"));
	КонецЕсли;
	
	ДобавитьЗаписьВЛог(Параметры, НСтр("ru = 'Окончание добавления адреса Git репозитория'"));
	
	Файл = Новый Файл(ФайлЛога);
	Если Файл.Существует() Тогда
		ЛогОперации.Прочитать(ФайлЛога, КодировкаТекста.UTF8);
	КонецЕсли;

КонецПроцедуры

// Запускает удаление временных данных версии в фоне
// 
// Параметры:
// 	Версия - СправочникСсылка.ВерсииХранилища - ссылка на версию для запуска удаления
Процедура УдалитьФайлыВерсииВФоне(Версия) Экспорт
	
	КлючЗадания = Строка(Версия.УникальныйИдентификатор());
	
	Отбор = Новый Структура();
	Отбор.Вставить("Ключ", КлючЗадания);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	Отбор.Вставить("ИмяМетода", "КонвертацияХранилища.УдалитьФайлыВерсии");
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	
	Если МассивФоновыхЗаданий.Количество() = 0 Тогда
		
		ЗаданияНаименование = НСтр("ru = 'Удаление файлов версии: %Версия%'");
		ЗаданияНаименование = СтрЗаменить(ЗаданияНаименование, "%Версия%", Строка(Версия));
		
		ПараметрыЗадания = Новый Массив();
		ПараметрыЗадания.Добавить(Версия);
		
		ФоновыеЗадания.Выполнить("КонвертацияХранилища.УдалитьФайлыВерсии", ПараметрыЗадания, КлючЗадания, Лев(ЗаданияНаименование, 120)); 
		
		
	КонецЕсли;
КонецПроцедуры

// Процедура - Удалить файлы версии
//
// Параметры:
//  ВерсияХранилища - СправочникСсылка.ВерсииХранилища - ссылка на текущую версию в проекте
//
Процедура УдалитьФайлыВерсии(ВерсияХранилища) Экспорт

	ИменаРеквизитов = Новый Структура("УдалятьВременныеДанныеВерсииПослеКоммита, Состояние, 
		| КаталогВременныхФайлов", "Владелец.УдалятьВременныеДанныеВерсииПослеКоммита");
	РеквизитыВерсии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВерсияХранилища, ИменаРеквизитов);

	Если РеквизитыВерсии.Состояние = Перечисления.СостоянияВерсии.ПомещенаВGit
			И РеквизитыВерсии.УдалятьВременныеДанныеВерсииПослеКоммита Тогда

		Объект = ВерсияХранилища.ПолучитьОбъект();

		Если ЗначениеЗаполнено(РеквизитыВерсии.КаталогВременныхФайлов) Тогда

			Попытка

				УдалитьФайлы(РеквизитыВерсии.КаталогВременныхФайлов);
				Объект.КаталогВременныхФайлов = "";

			Исключение

			КонецПопытки;

		КонецЕсли;
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Записать();

	КонецЕсли;

КонецПроцедуры

// Добавляет запись в журнал регистрации
// 
// Параметры:
// 	ИмяСобытия - Строка - имя события
// 	Уровень - Строка, УровеньЖурналаРегистрации - уровень записи журнала регистрации 
// 	ОбъектМетаданных - ОбъектМетаданных, Неопределено - объект метаданных
// 	Данные - Строка, Число, Дата, Булево, Неопределено - 
// 	Комментарий - Строка - комментарий
// 	РежимТранзакции - РежимТранзакцииЗаписиЖурналаРегистрации, Неопределено -
Процедура ДобавитьЗаписьВЖурналРегистрации(Знач ИмяСобытия,
		Знач Уровень = Неопределено, Знач ОбъектМетаданных = Неопределено,
		Знач Данные = Неопределено, Знач Комментарий = "",
		Знач РежимТранзакции = Неопределено) Экспорт

	Если ЗначениеЗаполнено(Уровень) и ТипЗнч(Уровень) = Тип("Строка") Тогда

		//@skip-warning
		Уровень = УровеньЖурналаРегистрации[Уровень];

	КонецЕсли;
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, Данные, Комментарий, РежимТранзакции);

КонецПроцедуры

// Запускает фоновую операцию по версии
// 
// Параметры:
// 	Очередь - СправочникСсылка.ОчередиВыполнения - ссылка на очередь выполнения
Процедура ЗапуститьОбработкуОчередиВФоне(Очередь) Экспорт

	Отбор = Новый Структура();
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	Отбор.Вставить("ИмяМетода", "КонвертацияХранилища.ОбработатьОчередь");

	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если МассивФоновыхЗаданий.Количество() > 50 Тогда
		Возврат;
	КонецЕсли;

	КлючЗадания = Строка(Очередь.УникальныйИдентификатор());

	Отбор = Новый Структура();
	Отбор.Вставить("Ключ", КлючЗадания);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	Отбор.Вставить("ИмяМетода", "КонвертацияХранилища.ОбработатьОчередь");

	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);

	Если МассивФоновыхЗаданий.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;

	Наименование = НСтр("ru = 'Обработка очереди: %Очередь%'");
	Наименование = СтрЗаменить(Наименование, "%Очередь%", Строка(Очередь));

	Параметры = Новый Массив();
	Параметры.Добавить(Очередь);

	ФоновыеЗадания.Выполнить("КонвертацияХранилища.ОбработатьОчередь", Параметры, КлючЗадания, Лев(Наименование, 120));

КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

#Область ПакетныеОперации

// Создает пустую файловую базу.
//
// Параметры:
//   Контекст - Структура - Параметры создания. См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
Процедура СоздатьФайловуюИнформационнуюБазу(Контекст) Экспорт
	ЗаписатьВЛогВерсии(Контекст, 3, "ru='Создание базы: Начало.'");
	
	ОбщегоНазначения.УдалитьФайлИлиКаталог(Контекст.КаталогИБ);
	
	КаталогПлатформыХранилища = КаталогПлатформыХранилища(Контекст);
	
	СтрокаКоманды = СтрШаблон("""%1"" /@ ""%2""",
		КаталогПлатформыХранилища + "1cv8",
		Контекст.ФайлПараметровПакетнойОперации);
	
	ПараметрыЗапуска = Новый Массив;
	ПараметрыЗапуска.Добавить(СтрШаблон("CREATEINFOBASE File=""%1""", Контекст.КаталогИБ));
	ПараметрыЗапуска.Добавить("/AllowExecuteScheduledJobs -Off /DisableStartupDialogs /DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableUnrecoverableErrorMessage /DisableSplash /UsePrivilegedMode /L ru /VL ru");
	
	// В старых версиях платформы параметр назывался AddInList.
	// Если ФО включена - базы добавляются в список, а чистильщик мусора чистит от них кэш.
	// Если ФО не включена - базы не добавляются в список, поэтому чистильщик мусора может ничего не чистить.
	Если ПолучитьФункциональнуюОпцию("ДобавлятьВременныеБазыВСписок") Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/AddInList ""%1""", Контекст.КаталогИБ));
	КонецЕсли;
	
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpResult ""%1""", Контекст.ИмяФайлаРезультатов));
	
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/Out ""%1"" -NoTruncate", Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	ФайлПараметров = Новый ТекстовыйДокумент;
	ФайлПараметров.УстановитьТекст(СтрСоединить(ПараметрыЗапуска, " "));
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		ФайлПараметров.Записать(Контекст.ФайлПараметровПакетнойОперации, КодировкаТекста.ANSI);
	Иначе
		ФайлПараметров.Записать(Контекст.ФайлПараметровПакетнойОперации, КодировкаТекста.UTF8);
	КонецЕсли;
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаКоманды, КаталогПлатформыХранилища, Истина, КодВозврата);
	КодРезультата = ПрочитатьФайлРезультата(Контекст.ИмяФайлаРезультатов);
	Успех = (КодВозврата = 0 И КодРезультата = 0);
	
	ТекстЛога = СтрШаблон("ru='Создание базы: Завершение. Код возврата: %1, Код результата: %2.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата), КодРезультата);
	ЗаписатьВЛогВерсии(Контекст, ?(Успех, 3, 2), ТекстЛога);
КонецПроцедуры

// Добавляет пустое расширение в файловую базу.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
Процедура ДобавитьПустоеРасширениеКонфигурации(Контекст) Экспорт
	Если Контекст.ТипХранилища <> Перечисления.ТипыХранилищаКонфигураций.Расширение Тогда
		Возврат;
	КонецЕсли;
	ЗаписатьВЛогВерсии(Контекст, 3, "ru='Добавление пустого расширения конфигурации: Начало.'");
	
	КаталогПустогоРасширения = Контекст.КаталогВременныхФайлов + "empty_ext" + ПолучитьРазделительПути();
	ОбщегоНазначения.УдалитьФайлИлиКаталог(КаталогПустогоРасширения);
	
	КаталогПлатформыХранилища = КаталогПлатформыХранилища(Контекст);
	СтрокаКоманды = СтрШаблон("""%1"" /@ ""%2""",
		КаталогПлатформыХранилища + "1cv8",
		Контекст.ФайлПараметровПакетнойОперации);
	
	ПараметрыЗапуска = Новый Массив;
	ПараметрыЗапуска.Добавить(СтрШаблон("DESIGNER /WA- %1", Контекст.СтрокаСоединенияИБ));
	ПараметрыЗапуска.Добавить("/AllowExecuteScheduledJobs -Off /DisableStartupDialogs /DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableUnrecoverableErrorMessage /DisableSplash /UsePrivilegedMode /L ru /VL ru");
	
	Если ЗначениеЗаполнено(Контекст.ИмяПользователяИБ) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/N ""%1""", Контекст.ИмяПользователяИБ));
		Если ЗначениеЗаполнено(Контекст.ПарольПользователяИБ) Тогда
			ПараметрыЗапуска.Добавить(СтрШаблон("/P ""%1""", Контекст.ПарольПользователяИБ));
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыЗапуска.Добавить(СтрШаблон("/LoadConfigFromFiles ""%1""", КаталогПустогоРасширения));
	ПараметрыЗапуска.Добавить(СтрШаблон("-Extension %1", Контекст.ИмяРасширения));
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpResult ""%1""", Контекст.ИмяФайлаРезультатов));
	
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/Out ""%1"" -NoTruncate", Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	СоздатьКаталог(КаталогПустогоРасширения);
	ТекстовыйДокумент = Справочники.ХранилищаКонфигураций.ПолучитьМакет("ПустоеРасширение");
	ТекстовыйДокумент.Записать(КаталогПустогоРасширения + "Configuration.xml");
	
	ФайлПараметров = Новый ТекстовыйДокумент;
	ФайлПараметров.УстановитьТекст(СтрСоединить(ПараметрыЗапуска, " "));
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		ФайлПараметров.Записать(Контекст.ФайлПараметровПакетнойОперации, КодировкаТекста.ANSI);
	Иначе
		ФайлПараметров.Записать(Контекст.ФайлПараметровПакетнойОперации, КодировкаТекста.UTF8);
	КонецЕсли;
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаКоманды, КаталогПлатформыХранилища, Истина, КодВозврата);
	КодРезультата = ПрочитатьФайлРезультата(Контекст.ИмяФайлаРезультатов);
	Успех = (КодВозврата = 0 И КодРезультата = 0);
	ОбщегоНазначения.УдалитьФайлИлиКаталог(КаталогПустогоРасширения);
	
	ТекстЛога = СтрШаблон("ru='Добавление пустого расширения конфигурации: Завершение. Код возврата: %1, Код результата: %2.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата), КодРезультата);
	ЗаписатьВЛогВерсии(Контекст, ?(Успех, 3, 2), ТекстЛога);
КонецПроцедуры

// Формирует отчет по истории хранилища начиная с указанной версии.
//   Поднимает исключение в случае неудачи.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
Процедура СформироватьОтчетПоВерсиямХранилища(Контекст) Экспорт
	ЗаписатьВЛогВерсии(Контекст, 3, "ru='Формирование отчета по хранилищу: Начало.'");
	
	КаталогПлатформыХранилища = КаталогПлатформыХранилища(Контекст);
	СтрокаКоманды = СтрШаблон("""%1"" /@ ""%2""",
		КаталогПлатформыХранилища + "1cv8",
		Контекст.ФайлПараметровПакетнойОперации);
	
	ПараметрыЗапуска = Новый Массив;
	// Адрес, логин и пароль базы.
	ПараметрыЗапуска.Добавить(СтрШаблон("DESIGNER /WA- %1", Контекст.СтрокаСоединенияИБ));
	ПараметрыЗапуска.Добавить("/AllowExecuteScheduledJobs -Off /DisableStartupDialogs /DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableUnrecoverableErrorMessage /DisableSplash /UsePrivilegedMode /L ru /VL ru");
	Если ЗначениеЗаполнено(Контекст.ИмяПользователяИБ) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/N ""%1""", Контекст.ИмяПользователяИБ));
		Если ЗначениеЗаполнено(Контекст.ПарольПользователяИБ) Тогда
			ПараметрыЗапуска.Добавить(СтрШаблон("/P ""%1""", Контекст.ПарольПользователяИБ));
		КонецЕсли;
	КонецЕсли;
	// Адрес, логин и пароль хранилища.
	ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryF ""%1""", Контекст.АдресХранилища));
	ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryN ""%1""", Контекст.ИмяПользователяХранилища));
	Если ЗначениеЗаполнено(Контекст.ПарольПользователяХранилища) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryP ""%1""", Контекст.ПарольПользователяХранилища));
	КонецЕсли;
	
	// Построить отчет по истории хранилища. https://its.1c.ru/db/v8327doc#bookmark:adm:TI000000807
	//  /ConfigurationRepositoryReport <имя файла> [-NBegin <номер версии>] [-NEnd <номер версии>]
	//    [-DateBegin <дата начала>] [-DateEnd <дата окончания>] [-GroupByObject] [-GroupByComment]
	//    [-DoNotIncludeVersionsWithLabels] [-IncludeOnlyVersionsWithLabels] [-IncludeCommentLinesWithDoubleSlash]
	//    [-ConfigurationVersion <версия конфигурации>] [-ReportFormat <txt|mxl>] [-Extension <Имя расширения>]
	ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryReport ""%1""", Контекст.ИмяФайлаОтчета));
	// Номер сохраненной версии, от которой начинается строиться отчет. Если -1, то отчет строится для последней версии.
	Если Контекст.Свойство("ВерсияНачала") Тогда
		Если ТипЗнч(Контекст.ВерсияНачала) <> Тип("Строка") Тогда
			Контекст.Вставить("ВерсияНачала", Формат(Контекст.ВерсияНачала, "ЧДЦ=; ЧГ=0"));
		КонецЕсли;
		ПараметрыЗапуска.Добавить(СтрШаблон("-NBegin ""%1""", Контекст.ВерсияНачала));
	КонецЕсли;
	// Номер сохраненной версии, по которую строится отчет.
	Если Контекст.Свойство("ВерсияОкончания") Тогда
		Если ТипЗнч(Контекст.ВерсияОкончания) <> Тип("Строка") Тогда
			Контекст.Вставить("ВерсияОкончания", Формат(Контекст.ВерсияОкончания, "ЧДЦ=; ЧГ=0"));
		КонецЕсли;
		ПараметрыЗапуска.Добавить(СтрШаблон("-NEnd ""%1""", Контекст.ВерсияОкончания));
	КонецЕсли;
	// Включить в отчет строки комментариев.
	ПараметрыЗапуска.Добавить("-IncludeCommentLinesWithDoubleSlash");
	// Имя расширения, с хранилищем которого будет выполняться команда.
	Если Контекст.ТипХранилища = Перечисления.ТипыХранилищаКонфигураций.Расширение Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("-Extension ""%1""", Контекст.ИмяРасширения));
	КонецЕсли;
	
	// Записать результат работы конфигуратора в файл. Результат - число (0 - в случае успеха).
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpResult ""%1""", Контекст.ИмяФайлаРезультатов));
	// Файл для вывода служебных сообщений. Если задан параметр -NoTruncate (через пробел), файл не очищается.
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/Out ""%1"" -NoTruncate", Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	ФайлПараметров = Новый ТекстовыйДокумент;
	ФайлПараметров.УстановитьТекст(СтрСоединить(ПараметрыЗапуска, " "));
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		ФайлПараметров.Записать(Контекст.ФайлПараметровПакетнойОперации, КодировкаТекста.ANSI);
	Иначе
		ФайлПараметров.Записать(Контекст.ФайлПараметровПакетнойОперации, КодировкаТекста.UTF8);
	КонецЕсли;
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаКоманды, КаталогПлатформыХранилища, Истина, КодВозврата);
	КодРезультата = ПрочитатьФайлРезультата(Контекст.ИмяФайлаРезультатов);
	Успех = (КодВозврата = 0 И КодРезультата = 0);
	
	ТекстЛога = СтрШаблон("ru='Формирование отчета по хранилищу: Завершение. Код возврата: %1, Код результата: %2.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата), КодРезультата);
	ЗаписатьВЛогВерсии(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Если Не Успех Тогда
		ВызватьИсключениеПриОбработкеВерсии(Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Получает версию конфигурации из хранилища.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
Процедура ОбновитьИнформационнуюБазуИзХранилища(Контекст, НомерВерсииХранилища) Экспорт
	ЗаписатьВЛогВерсии(Контекст, 3, "ru='Получение версии конфигурации из хранилища: Начало.'");
	
	КаталогПлатформыХранилища = КаталогПлатформыХранилища(Контекст);
	СтрокаКоманды = СтрШаблон("""%1"" /@ ""%2""",
		КаталогПлатформыХранилища + "1cv8",
		Контекст.ФайлПараметровПакетнойОперации);
	
	ПараметрыЗапуска = Новый Массив;
	// Адрес, логин и пароль базы.
	ПараметрыЗапуска.Добавить(СтрШаблон("DESIGNER /WA- %1", Контекст.СтрокаСоединенияИБ));
	ПараметрыЗапуска.Добавить("/AllowExecuteScheduledJobs -Off /DisableStartupDialogs /DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableUnrecoverableErrorMessage /DisableSplash /UsePrivilegedMode /L ru /VL ru");
	Если ЗначениеЗаполнено(Контекст.ИмяПользователяИБ) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/N ""%1""", Контекст.ИмяПользователяИБ));
		Если ЗначениеЗаполнено(Контекст.ПарольПользователяИБ) Тогда
			ПараметрыЗапуска.Добавить(СтрШаблон("/P ""%1""", Контекст.ПарольПользователяИБ));
		КонецЕсли;
	КонецЕсли;
	// Адрес, логин и пароль хранилища.
	ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryF ""%1""", Контекст.АдресХранилища));
	ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryN ""%1""", Контекст.ИмяПользователяХранилища));
	Если ЗначениеЗаполнено(Контекст.ПарольПользователяХранилища) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryP ""%1""", Контекст.ПарольПользователяХранилища));
	КонецЕсли;
	
	// Обновить конфигурацию из хранилища. https://its.1c.ru/db/v8327doc#bookmark:adm:TI000000496
	//  /ConfigurationRepositoryUpdateCfg [-v <номер версии хранилища>] [-revised] [-force]
	//    [-Objects <имя файла>] [-Extension <Имя расширения>]
	Если ТипЗнч(НомерВерсииХранилища) = Тип("Число") Тогда
		НомерВерсииХранилища = Формат(НомерВерсииХранилища, "ЧДЦ=; ЧГ=0");
	ИначеЕсли Не ЗначениеЗаполнено(НомерВерсииХранилища) Тогда
		НомерВерсииХранилища = "-1";
	КонецЕсли;
	ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryUpdateCfg -force -v %1", НомерВерсииХранилища));
	Если Контекст.ТипХранилища = Перечисления.ТипыХранилищаКонфигураций.Расширение Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("-Extension ""%1""", Контекст.ИмяРасширения));
	КонецЕсли;
	
	// Записать результат работы конфигуратора в файл. Результат - число (0 - в случае успеха).
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpResult ""%1""", Контекст.ИмяФайлаРезультатов));
	// Файл для вывода служебных сообщений. Если задан параметр -NoTruncate (через пробел), файл не очищается.
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/Out ""%1"" -NoTruncate", Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	ФайлПараметров = Новый ТекстовыйДокумент;
	ФайлПараметров.УстановитьТекст(СтрСоединить(ПараметрыЗапуска, " "));
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		ФайлПараметров.Записать(Контекст.ФайлПараметровПакетнойОперации, КодировкаТекста.ANSI);
	Иначе
		ФайлПараметров.Записать(Контекст.ФайлПараметровПакетнойОперации, КодировкаТекста.UTF8);
	КонецЕсли;
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаКоманды, КаталогПлатформыХранилища, Истина, КодВозврата);
	КодРезультата = ПрочитатьФайлРезультата(Контекст.ИмяФайлаРезультатов);
	Успех = (КодВозврата = 0 И КодРезультата = 0);
	
	ТекстЛога = СтрШаблон("ru='Получение версии конфигурации из хранилища: Завершение. Код возврата: %1, Код результата: %2.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата), КодРезультата);
	ЗаписатьВЛогВерсии(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Если Не Успех Тогда
		ВызватьИсключениеПриОбработкеВерсии(Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Выгружает конфигурацию базы данных в файлы XML.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//       * СтрокаСоединенияИБ - Строка
//       * ИмяПользователяИБ - Строка
//       * ПарольПользователяИБ - Строка
//       * КаталогВыгрузкиВXML - Строка
//       * ТипХранилища - ПеречислениеСсылка.ТипыХранилищаКонфигураций
//       * ИмяРасширения - Строка
//       * ФайлСостоянияПредыдущейВерсии - Строка
//       * ФайлИзменений - Строка
//       * ИмяФайлаЛога - Строка
//       * ФайлПараметровПакетнойОперации - Строка
//       * ИмяФайлаРезультатов - Строка
//   ВыгрузитьИзменения - Булево - Если Истина то выгрузка будет в режиме "-update -force". Если заполнен
//       Контекст.ФайлСостоянияПредыдущейВерсии, то отличия будут вычисляться относительно указанного файла.
//   ФайлСписка - Строка - Полное имя файла со списком полных имен объектов метаданных для частичной выгрузки.
//       Указанные объекты будут выгружены независимо от того, были ли они изменены, или нет.
//   ПолучитьСписокИзменений - Булево - Если Истина то выгрузка будет в режиме "–getChanges [Контекст.ФайлИзменений]".
//
Процедура ВыгрузитьКонфигурациюВФайлы(Контекст, ВыгрузитьИзменения = Ложь, ФайлСписка = "", ПолучитьСписокИзменений = Ложь) Экспорт
	ЗаписатьВЛогВерсии(Контекст, 3, "ru='Выгрузка конфигурации в XML: Начало.'");
	
	Если Не ОбщегоНазначения.КаталогСуществует(Контекст.КаталогВыгрузкиВXML) Тогда
		СоздатьКаталог(Контекст.КаталогВыгрузкиВXML);
	КонецЕсли;
	
	КаталогПлатформыВыгрузкиXML = КаталогПлатформыВыгрузкиXML(Контекст);
	СтрокаКоманды = СтрШаблон("""%1"" /@ ""%2""",
		КаталогПлатформыВыгрузкиXML + "1cv8",
		Контекст.ФайлПараметровПакетнойОперации);
	
	ПараметрыЗапуска = Новый Массив;
	// Адрес, логин и пароль базы.
	ПараметрыЗапуска.Добавить(СтрШаблон("DESIGNER /WA- %1", Контекст.СтрокаСоединенияИБ));
	ПараметрыЗапуска.Добавить("/AllowExecuteScheduledJobs -Off /DisableStartupDialogs /DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableUnrecoverableErrorMessage /DisableSplash /UsePrivilegedMode /L ru /VL ru");
	Если ЗначениеЗаполнено(Контекст.ИмяПользователяИБ) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/N ""%1""", Контекст.ИмяПользователяИБ));
		Если ЗначениеЗаполнено(Контекст.ПарольПользователяИБ) Тогда
			ПараметрыЗапуска.Добавить(СтрШаблон("/P ""%1""", Контекст.ПарольПользователяИБ));
		КонецЕсли;
	КонецЕсли;
	
	// Выгрузить конфигурацию в файлы. https://its.1c.ru/db/v8327doc#bookmark:adm:TI000000527
	//  /DumpConfigToFiles <каталог выгрузки> [-Format <режим>] [-Extension <Имя расширения>] [-AllExtensions]
	//    [–update] [–force] [–getChanges <имя файла>] [–configDumpInfoForChanges <имя файла>] [-listFile <имя файла>]
	//    [-configDumpInfoOnly] [-Server [-JobsCount <количество>]] [-Archive <имя файла>] [-ignoreUnresolvedReferences]
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpConfigToFiles ""%1""", Контекст.КаталогВыгрузкиВXML));
	Если Контекст.ТипХранилища = Перечисления.ТипыХранилищаКонфигураций.Расширение Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("-Extension ""%1""", Контекст.ИмяРасширения));
	КонецЕсли;
	
	//    [–update] - Обновить ранее совершенную выгрузку.
	//      Будут выгружены только те объекты, версии которых отличаются от версий ранее выгруженных объектов.
	//      Файл версий (ConfigDumpInfo.xml) будет получен из текущего каталога выгрузки.
	//      Если текущая версия формата выгрузки не совпадает с версией формата в файле версий или если файл версий
	//      не найден, будет сгенерирована ошибка. По завершении выгрузки файл версий обновляется.
	//      Возможно совместное использование с параметрами:
	//    [–force] - Если текущая версия формата выгрузки не совпадает с версией формата в файле версий,
	//      будет выполнена полная выгрузка.
	//    [–configDumpInfoForChanges <имя файла>] - Файл версий (ConfigDumpInfo.xml) для сравнения изменений.
	//      Имя файла является обязательным. Если текущий каталог выгрузки перед началом работы не пустой,
	//      то будет сгенерирована ошибка. Соответствие текущей версии формата выгрузки и версии формата
	//      выгрузки в файле версий не проверяется. При выгрузке генерируется новый файл версий.
	//      Файл, указанный в параметре -configDumpInfoForChanges не изменяется.
	Если ВыгрузитьИзменения Тогда
		ПараметрыЗапуска.Добавить("-update -force");
		Если ЗначениеЗаполнено(Контекст.ФайлСостоянияПредыдущейВерсии) Тогда
			ПараметрыЗапуска.Добавить(СтрШаблон("-configDumpInfoForChanges ""%1""", Контекст.ФайлСостоянияПредыдущейВерсии));
		КонецЕсли;
	КонецЕсли;
	
	//    [-listFile <имя файла>] - Файл со списком объектов, которые будут выгружены независимо от того,
	//      были ли они изменены, или нет. Имя файла является обязательным. Объекты из списка будут выгружены полностью,
	//      за исключением подчиненных объектов, которые выступают как отдельные объекты разработки. Для выгрузки таких
	//      подчиненных объектов их следует явно указать в списке. Если объект из списка имеет подчиненные объекты, не
	//      являющиеся отдельными объектами разработки, но имеющие внешние свойства, то внешние свойства таких объектов
	//      также будут выгружены. Идентификаторы Configuration и Configuration.ИмяКонфигурации являются эквивалентными.
	Если ЗначениеЗаполнено(ФайлСписка) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("-listFile ""%1""", ФайлСписка));
	КонецЕсли;
	
	//    [–getChanges <имя файла>]- В указанном файле будет сформирован список изменений текущей конфигурации
	//      относительно выгрузки и, соответственно, файла версий, каталог которой указан параметром команды
	//      /DumpConfigToFiles. Имя файла является обязательным.
	//      Может использоваться совместно с параметром –configDumpInfoForChanges.
	//    [–configDumpInfoForChanges <имя файла>] - Файл версий (ConfigDumpInfo.xml) для вычисления изменений.
	//      Имя файла является обязательным. Если файл версии не найден, то будет сгенерирована ошибка.
	Если ПолучитьСписокИзменений Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("-getChanges ""%1""", Контекст.ФайлИзменений));
		Если ЗначениеЗаполнено(Контекст.ФайлСостоянияПредыдущейВерсии) Тогда
			ПараметрыЗапуска.Добавить(СтрШаблон("-configDumpInfoForChanges ""%1""", Контекст.ФайлСостоянияПредыдущейВерсии));
		КонецЕсли;
	КонецЕсли;
	
	// Записать результат работы конфигуратора в файл. Результат - число (0 - в случае успеха).
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpResult ""%1""", Контекст.ИмяФайлаРезультатов));
	// Файл для вывода служебных сообщений. Если задан параметр -NoTruncate (через пробел), файл не очищается.
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/Out ""%1"" -NoTruncate", Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	ФайлПараметров = Новый ТекстовыйДокумент;
	ФайлПараметров.УстановитьТекст(СтрСоединить(ПараметрыЗапуска, " "));
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		ФайлПараметров.Записать(Контекст.ФайлПараметровПакетнойОперации, КодировкаТекста.ANSI);
	Иначе
		ФайлПараметров.Записать(Контекст.ФайлПараметровПакетнойОперации, КодировкаТекста.UTF8);
	КонецЕсли;
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаКоманды, КаталогПлатформыВыгрузкиXML, Истина, КодВозврата);
	КодРезультата = ПрочитатьФайлРезультата(Контекст.ИмяФайлаРезультатов);
	Успех = (КодВозврата = 0 И КодРезультата = 0);
	
	ТекстЛога = СтрШаблон("ru='Выгрузка конфигурации в XML: Завершение. Код возврата: %1, Код результата: %2.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата), КодРезультата);
	ЗаписатьВЛогВерсии(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Если Не Успех Тогда
		ВызватьИсключениеПриОбработкеВерсии(Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Выгружает файл сведений о конфигурации ConfigDumpInfo.xml.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//       * СтрокаСоединенияИБ - Строка
//       * ИмяПользователяИБ - Строка
//       * ПарольПользователяИБ - Строка
//       * КаталогВыгрузкиВXML - Строка
//       * ТипХранилища - ПеречислениеСсылка.ТипыХранилищаКонфигураций
//       * ИмяРасширения - Строка
//       * ИмяФайлаЛога - Строка
//       * ФайлПараметровПакетнойОперации - Строка
//       * ИмяФайлаРезультатов - Строка
//
Процедура СохранитьФайлИнформацииВыгрузки(Контекст) Экспорт
	ЗаписатьВЛогВерсии(Контекст, 3, "ru='Сохранения файла информации выгрузки: Начало.'");
	
	ОбщегоНазначения.УдалитьФайлИлиКаталог(Контекст.КаталогВыгрузкиВXML + "ConfigDumpInfo.xml");
	Если Не ОбщегоНазначения.КаталогСуществует(Контекст.КаталогВыгрузкиВXML) Тогда
		СоздатьКаталог(Контекст.КаталогВыгрузкиВXML);
	КонецЕсли;
	
	КаталогПлатформыВыгрузкиXML = КаталогПлатформыВыгрузкиXML(Контекст);
	СтрокаКоманды = СтрШаблон("""%1"" /@ ""%2""",
		КаталогПлатформыВыгрузкиXML + "1cv8",
		Контекст.ФайлПараметровПакетнойОперации);
	
	ПараметрыЗапуска = Новый Массив;
	// Адрес, логин и пароль базы.
	ПараметрыЗапуска.Добавить(СтрШаблон("DESIGNER /WA- %1", Контекст.СтрокаСоединенияИБ));
	ПараметрыЗапуска.Добавить("/AllowExecuteScheduledJobs -Off /DisableStartupDialogs /DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableUnrecoverableErrorMessage /DisableSplash /UsePrivilegedMode /L ru /VL ru");
	Если ЗначениеЗаполнено(Контекст.ИмяПользователяИБ) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/N ""%1""", Контекст.ИмяПользователяИБ));
		Если ЗначениеЗаполнено(Контекст.ПарольПользователяИБ) Тогда
			ПараметрыЗапуска.Добавить(СтрШаблон("/P ""%1""", Контекст.ПарольПользователяИБ));
		КонецЕсли;
	КонецЕсли;
	
	// Выгрузить конфигурацию в файлы. https://its.1c.ru/db/v8327doc#bookmark:adm:TI000000527
	//  /DumpConfigToFiles <каталог выгрузки> [-Format <режим>] [-Extension <Имя расширения>] [-AllExtensions]
	//    [–update] [–force] [–getChanges <имя файла>] [–configDumpInfoForChanges <имя файла>] [-listFile <имя файла>]
	//    [-configDumpInfoOnly] [-Server [-JobsCount <количество>]] [-Archive <имя файла>] [-ignoreUnresolvedReferences]
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpConfigToFiles ""%1""", Контекст.КаталогВыгрузкиВXML));
	Если Контекст.ТипХранилища = Перечисления.ТипыХранилищаКонфигураций.Расширение Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("-Extension ""%1""", Контекст.ИмяРасширения));
	КонецЕсли;
	ПараметрыЗапуска.Добавить("-configDumpInfoOnly");
	
	ФайлПараметров = Новый ТекстовыйДокумент;
	ФайлПараметров.УстановитьТекст(СтрСоединить(ПараметрыЗапуска, " "));
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		ФайлПараметров.Записать(Контекст.ФайлПараметровПакетнойОперации, КодировкаТекста.ANSI);
	Иначе
		ФайлПараметров.Записать(Контекст.ФайлПараметровПакетнойОперации, КодировкаТекста.UTF8);
	КонецЕсли;
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаКоманды, КаталогПлатформыВыгрузкиXML, Истина, КодВозврата);
	КодРезультата = ПрочитатьФайлРезультата(Контекст.ИмяФайлаРезультатов);
	Успех = (КодВозврата = 0 И КодРезультата = 0);
	
	ТекстЛога = СтрШаблон("ru='Сохранения файла информации выгрузки: Завершение. Код возврата: %1, Код результата: %2.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата), КодРезультата);
	ЗаписатьВЛогВерсии(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Если Не Успех Тогда
		ВызватьИсключениеПриОбработкеВерсии(Контекст);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОчисткаОтМусора

// Находит версии с ошибками не достигшие предельного количества ошибок и сбрасывает их состояние.
Процедура СброситьСостоянияВерсийСОшибками(МаксимальноеКоличествоОшибокВерсии = Неопределено) Экспорт
	Если ТипЗнч(МаксимальноеКоличествоОшибокВерсии) <> Тип("Число") Тогда
		МаксимальноеКоличествоОшибокВерсии = МаксимальноеКоличествоОшибокВерсии();
	КонецЕсли;
	Если МаксимальноеКоличествоОшибокВерсии = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Поиск версий, завершившихся с ошибками.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 10
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.Код КАК Код,
	|	Таблица.ПометкаУдаления КАК ПометкаУдаления,
	|	Таблица.Владелец КАК Владелец,
	|	Таблица.КоличествоОшибок КАК КоличествоОшибок,
	|	Таблица.ВыгруженыТолькоИзменения КАК ВыгруженыТолькоИзменения,
	|	Таблица.ТребуетсяПолнаяВыгрузка КАК ТребуетсяПолнаяВыгрузка,
	|	Таблица.ВозниклаОшибка КАК ВозниклаОшибка,
	|	Таблица.Состояние КАК Состояние,
	|	Таблица.ТекстОшибки КАК ТекстОшибки
	|ИЗ
	|	Справочник.ВерсииХранилища КАК Таблица
	|ГДЕ
	|	Таблица.ВозниклаОшибка
	|	И Таблица.КоличествоОшибок < &МаксимальноеКоличествоОшибокВерсии
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	Запрос.УстановитьПараметр("МаксимальноеКоличествоОшибокВерсии", МаксимальноеКоличествоОшибокВерсии);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураРеквизитов = Новый Структура("Состояние,ВозниклаОшибка,ВыгруженыТолькоИзменения,ТребуетсяПолнаяВыгрузка");
		СтруктураРеквизитов.ВозниклаОшибка = Ложь;
		СтруктураРеквизитов.ВыгруженыТолькоИзменения = Ложь;
		СтруктураРеквизитов.ТребуетсяПолнаяВыгрузка = Истина;
		
		Если Выборка.Состояние = Перечисления.СостоянияВерсии.ВыгружаетсяВXML
			И (СтрНайти(Выборка.ТекстОшибки, "Структура информационной базы несовместима") > 0
			Или СтрНайти(Выборка.ТекстОшибки, "Структура информационной базы не совместима") > 0) Тогда
			
			// Битый CF - требуется повторное получение из хранилища.
			СтруктураРеквизитов.Состояние = Перечисления.СостоянияВерсии.ПустаяСсылка();
			
		ИначеЕсли Выборка.КоличествоОшибок > 3 Тогда
			
			// Ошибка повторяется, требуется полная перепроверка.
			СтруктураРеквизитов.Состояние = Перечисления.СостоянияВерсии.ПустаяСсылка();
			
		ИначеЕсли Выборка.Состояние = Перечисления.СостоянияВерсии.ВыгружаетсяВXML
			Или Выборка.Состояние = Перечисления.СостоянияВерсии.ВыгруженаВXML
			Или Выборка.ТребуетсяПолнаяВыгрузка <> СтруктураРеквизитов.ТребуетсяПолнаяВыгрузка Тогда
			
			// Сбой выгрузки XML.
			СтруктураРеквизитов.Состояние = Перечисления.СостоянияВерсии.ПолученCF;
			
		ИначеЕсли Выборка.Состояние = Перечисления.СостоянияВерсии.ЗагружаетсяВEDT
			Или Выборка.Состояние = Перечисления.СостоянияВерсии.ЗагруженаВEDT
			Или Выборка.Состояние = Перечисления.СостоянияВерсии.ПомещаетсяВGit
			Или Выборка.Состояние = Перечисления.СостоянияВерсии.ПомещенаВGit Тогда
			
			// Сбой загрузки в EDT или помещения в Git.
			СтруктураРеквизитов.Состояние = Перечисления.СостоянияВерсии.ВыгруженаВXML;
			
		Иначе
			СтруктураРеквизитов.Состояние = Перечисления.СостоянияВерсии.ПустаяСсылка();
		КонецЕсли;
		
		Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(Выборка.Ссылка, СтруктураРеквизитов);
		
	КонецЦикла;
КонецПроцедуры

// Очищает версии хранилищ с флажком "УдалятьВременныеДанныеВерсииПослеКоммита".
Процедура ОчиститьВерсииПослеКоммитов() Экспорт
	
	// Запрос в цикле - проектное решение.
	// Количество удаляемых файлов может быть большим, удаление может занять продолжительное время.
	// За это время картина в базе данных может измениться, могут появиться новые версии требующие очистки.
	// Поэтому очистка выполняется циклом по хранилищам, для каждого хранилища выбирается до 10 версий за проход.
	ОтборХранилищ = Новый Структура("ПометкаУдаления, УдалятьВременныеДанныеВерсииПослеКоммита", Ложь, Истина);
	АктивныеХранилища = Справочники.ХранилищаКонфигураций.ЗапросПоЭлементам(ОтборХранилищ).Выполнить().Выгрузить();
	Для Каждого РеквизитыХранилища Из АктивныеХранилища Цикл
		ОтборВерсий = Новый Структура;
		ОтборВерсий.Вставить("Владелец", РеквизитыХранилища.Ссылка);
		ОтборВерсий.Вставить("ПерваяВерсия", РеквизитыХранилища.ПерваяВерсия);
		ОтборВерсий.Вставить("ПоследняяВерсия", РеквизитыХранилища.ПоследняяВерсия);
		ОтборВерсий.Вставить("КаталогВременныхФайловУказан", Истина);
		ОтборВерсий.Вставить("Состояние", Перечисления.СостоянияВерсии.ПомещенаВGit);
		
		Запрос = Справочники.ВерсииХранилища.ЗапросПоЭлементам(ОтборВерсий, "Код", 10);
		
		ВерсииДляОчисткиФайлов = Запрос.Выполнить().Выгрузить();
		ВГраница = ВерсииДляОчисткиФайлов.Количество() - 1;
		Для Индекс = 0 По ВГраница Цикл
			ПараметрыВерсии = ВерсииДляОчисткиФайлов[Индекс];
			Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(ПараметрыВерсии.Ссылка, Новый Структура, Истина);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Убийство зависших заданий.
Процедура ЗавершитьЗависшиеПроцессы(МаксимальноеКоличествоОшибокВерсии = Неопределено, МинутДоПринудительнойОстановки = Неопределено, МинутДоПроверкиЗависания = Неопределено) Экспорт
	Если ТипЗнч(МаксимальноеКоличествоОшибокВерсии) <> Тип("Число") Тогда
		МаксимальноеКоличествоОшибокВерсии = МаксимальноеКоличествоОшибокВерсии();
	КонецЕсли;
	Если ТипЗнч(МинутДоПринудительнойОстановки) <> Тип("Число") Тогда
		МинутДоПринудительнойОстановки = МинутДоПринудительнойОстановки();
	КонецЕсли;
	Если ТипЗнч(МинутДоПроверкиЗависания) <> Тип("Число") Тогда
		МинутДоПроверкиЗависания = МинутДоПроверкиЗависания();
	КонецЕсли;
	ДатаРаньшеКоторойПроцессСчитаетсяЗависшим = ТекущаяДата() - 60*МинутДоПринудительнойОстановки;
	ДатаРаньшеКоторойПроверяетсяНаличиеСеанса = ТекущаяДата() - 60*МинутДоПроверкиЗависания;
	БлижайшаяДата = Макс(ДатаРаньшеКоторойПроцессСчитаетсяЗависшим, ДатаРаньшеКоторойПроверяетсяНаличиеСеанса);
	
	Отбор = Новый Структура("ДатаНачалаОбработкиСостоянияМеньшеИлиРавно", БлижайшаяДата);
	Запрос = Справочники.ВерсииХранилища.ЗапросПоЭлементам(Отбор, "Код", 10);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СрубитьПринудительно = (Выборка.ДатаНачалаОбработки < ДатаРаньшеКоторойПроцессСчитаетсяЗависшим);
		Если Не СрубитьПринудительно И СеансВерсииЕщеЗапущен(Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		ПроверитьНаличиеСеанса = Не СрубитьПринудительно И (Выборка.ДатаНачалаОбработки < ДатаРаньшеКоторойПроверяетсяНаличиеСеанса);
		Если Выборка.КоличествоОшибок > МаксимальноеКоличествоОшибокВерсии Тогда
			
			// Количество ошибок превысило лимит.
			// Включение флажка "ВозниклаОшибка" и остановка без снятия процессов.
			Если Не Выборка.ВозниклаОшибка Тогда
				СтруктураРеквизитов = Новый Структура("ВозниклаОшибка");
				СтруктураРеквизитов.ВозниклаОшибка = Истина;
				Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(Выборка.Ссылка, СтруктураРеквизитов);
			КонецЕсли;
			
		Иначе
			
			// Увеличение счетчика ошибок и очистка состояния (отключение флажка ВозниклаОшибка).
			Если Не Выборка.ВозниклаОшибка Тогда
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Состояние ""%1"" длится дольше %4 часов (запуск: %2, сейчас: %3).'"),
					Выборка.Состояние,
					Выборка.ДатаНачалаОбработкиСостояния,
					ТекущаяДата(),
					МинутДоПринудительнойОстановки);
				Справочники.ВерсииХранилища.ВозниклаОшибка(Выборка.Ссылка, ТекстОшибки);
			КонецЕсли;
			
			// Поиск и снятие всех процессов, которые относятся к версии.
			КаталогВременныхФайловВерсии = Выборка.КаталогВременныхФайлов;
			Если ЗначениеЗаполнено(КаталогВременныхФайловВерсии) Тогда
				// На актуальности списка запущенных процессов лучше не экономить
				// и получать его перед "срубанием" каждой версии.
				ЗапущенныеПроцессы = ПроцессыСервера.ЗапущенныеПроцессы();
				Для Каждого ОписаниеПроцесса Из ЗапущенныеПроцессы Цикл
					Если СтрНайти(ОписаниеПроцесса.КоманднаяСтрока, КаталогВременныхФайловВерсии) > 0 Тогда
						ПроцессыСервера.ЗавершитьЗависшийПроцесс(КаталогВременныхФайловВерсии, Выборка.Ссылка, ОписаниеПроцесса,
							Метаданные.РегламентныеЗадания.ОчисткаОтМусора.Представление());
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	// Убийство зависших java.exe.
	ОтборХранилищ = Новый Структура("ПометкаУдаления", Ложь);
	КонвертируемыеХранилища = Справочники.ХранилищаКонфигураций.ЗапросПоЭлементам(ОтборХранилищ).Выполнить().Выгрузить();
	Для Каждого РеквизитыХранилища Из КонвертируемыеХранилища Цикл
		ОтборВерсий = Новый Структура;
		ОтборВерсий.Вставить("Владелец", РеквизитыХранилища.Ссылка);
		ОтборВерсий.Вставить("ПерваяВерсия", РеквизитыХранилища.ПерваяВерсия);
		ОтборВерсий.Вставить("ПоследняяВерсия", РеквизитыХранилища.ПоследняяВерсия);
		ОтборВерсий.Вставить("КаталогВременныхФайловУказан", Истина);
		ОтборВерсий.Вставить("Состояние", Перечисления.СостоянияВерсии.ЗагружаетсяВEDT);
		
		Запрос = Справочники.ВерсииХранилища.ЗапросПоЭлементам(ОтборВерсий, "Код", 1);
		
		КонтролируемыеВерсии = Запрос.Выполнить().Выгрузить();
		Для Каждого ДанныеВерсии Из КонтролируемыеВерсии Цикл
			СостояниеВерсии = СостояниеВерсии(ДанныеВерсии.Ссылка);
			Если СостояниеВерсии.Период > ДатаРаньшеКоторойПроцессСчитаетсяЗависшим Тогда
				Продолжить; // Еще не завис.
			КонецЕсли;
			
			Попытка
				// Зависших процессов не больше количества очередей.
				//@skip-check query-in-loop
				Контекст = КонтекстРаботыСВерсией(ДанныеВерсии, РеквизитыХранилища);
			Исключение
				Продолжить;
			КонецПопытки;
			РабочийКаталогEDT = ОбщегоНазначения.УдалитьКонечныйРазделительПути(Контекст.РабочийКаталогEDT);
			
			// Задание зависло. Требуется найти соответствующий процесс java.exe, Снять процесс и перезапустить выгрузку.
			ЗапущенныеПроцессы = ПроцессыСервера.ЗапущенныеПроцессы();
			ПроцессыJava = ЗапущенныеПроцессы.НайтиСтроки(Новый Структура("ИмяВРег", ВРег("java.exe")));
			Если ПроцессыJava.Количество() = 0 Тогда
				ПроцессыJava = ЗапущенныеПроцессы.НайтиСтроки(Новый Структура("ИмяВРег", ВРег("java")));
			КонецЕсли;
			НайденыЗависшиеПроцессы = Ложь;
			Для Каждого ОписаниеПроцесса Из ПроцессыJava Цикл
				Если ОписаниеПроцесса.ДатаНачала < ДатаРаньшеКоторойПроцессСчитаетсяЗависшим
					И СтрНайти(ОписаниеПроцесса.КоманднаяСтрока, "edt workspace import") > 0
					И СтрНайти(ОписаниеПроцесса.КоманднаяСтрока, РабочийКаталогEDT) > 0 Тогда
					НайденыЗависшиеПроцессы = Истина;
					ПроцессыСервера.ЗавершитьЗависшийПроцесс(Контекст.КаталогВременныхФайлов, ДанныеВерсии.Ссылка, ОписаниеПроцесса,
						Метаданные.РегламентныеЗадания.ОчисткаОтМусора.Представление());
				КонецЕсли;
			КонецЦикла;
			Если НайденыЗависшиеПроцессы Тогда
				Справочники.ВерсииХранилища.ВозниклаОшибка(ДанныеВерсии.Ссылка, НСтр("ru = 'Зависл процесс java.'"));
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Удаление файлов версии.
Процедура ОчиститьКаталогВерсииВФоне(ВерсияОбъект, ПараметрыХранилища) Экспорт
	ВсеКаталогиОчищены = Истина;
	
	// Удаление каталога версии.
	Попытка
		УдалитьФайлы(ВерсияОбъект.КаталогВременныхФайлов);
	Исключение
		ВсеКаталогиОчищены = Ложь;
		ОбщегоНазначения.ЗаписатьОшибку(
			"ru = 'Очистка каталога файлов версии'",
			ИнформацияОбОшибке(),
			ВерсияОбъект.Ссылка);
	КонецПопытки;
	
	// Удаление "внешних" файлов Git.
	Попытка
		ИмяКомандногоФайлаGit = ИмяКомандногоФайлаGit(ПараметрыХранилища.КаталогВыгрузкиВерсий, ВерсияОбъект.Код);
		ИмяФайлКомментарияGit = ИмяФайлаКомментарияGit(ПараметрыХранилища.КаталогВыгрузкиВерсий, ВерсияОбъект.Код);
		ОбщегоНазначения.УдалитьФайлИлиКаталог(ИмяКомандногоФайлаGit);
		ОбщегоНазначения.УдалитьФайлИлиКаталог(ИмяФайлКомментарияGit);
	Исключение
		ВсеКаталогиОчищены = Ложь;
		ОбщегоНазначения.ЗаписатьОшибку(
			"ru = 'Очистка файлов Git'",
			ИнформацияОбОшибке(),
			ВерсияОбъект.Ссылка);
	КонецПопытки;
	
	// Удаление кэшей 1С.
	Если ПолучитьФункциональнуюОпцию("ДобавлятьВременныеБазыВСписок") Тогда
		Попытка
			// https://its.1c.ru/db/v8327doc#bookmark:adm:TI000000368
			КаталогAppData = ОбщегоНазначения.СистемныйКаталог(26);
			КаталогLocalAppData = ОбщегоНазначения.СистемныйКаталог(28);
			Если ЗначениеЗаполнено(КаталогAppData) Тогда
				Если Не ЗначениеЗаполнено(КаталогLocalAppData) Тогда
					КаталогLocalAppData = КаталогAppData;
				КонецЕсли;
				
				КолонкиФайлаБаз = Новый Структура;
				КолонкиФайлаБаз.Вставить("ID", "Идентификатор");
				НайденныеФайлы = НайтиФайлы(КаталогAppData, "ibases.v8i", Истина);
				Для Каждого ФайлСпискаИБ Из НайденныеФайлы Цикл
					
					ТаблицаБаз = ОбщегоНазначения.ТаблицаИзIniФайла(ФайлСпискаИБ.ПолноеИмя, "UTF-8", КолонкиФайлаБаз);
					ЕстьИзменения = Ложь;
					
					ОбратныйИндекс = ТаблицаБаз.Количество();
					Пока ОбратныйИндекс > 0 Цикл
						ОбратныйИндекс = ОбратныйИндекс - 1;
						СтрокаТаблицыБаз = ТаблицаБаз[ОбратныйИндекс];
						Если СтрНачинаетсяС(СтрокаТаблицыБаз.СекцияНРег, НРег(ВерсияОбъект.КаталогВременныхФайлов)) Тогда
							НайденныеКаталоги = НайтиФайлы(КаталогLocalAppData, СтрокаТаблицыБаз.Идентификатор, Истина);
							Для Каждого НайденныйКаталог Из НайденныеКаталоги Цикл
								ОбщегоНазначения.УдалитьФайлИлиКаталог(НайденныйКаталог.ПолноеИмя);
							КонецЦикла;
							ТаблицаБаз.Удалить(ОбратныйИндекс);
							ЕстьИзменения = Истина;
						КонецЕсли;
					КонецЦикла;
					
					Если ЕстьИзменения Тогда
						ОбщегоНазначения.ТаблицаВIniФайл(ТаблицаБаз, ФайлСпискаИБ.ПолноеИмя, "UTF-8");
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
		Исключение
			ВсеКаталогиОчищены = Ложь;
			ОбщегоНазначения.ЗаписатьОшибку(
				"ru = 'Очистка временных баз версии'",
				ИнформацияОбОшибке(),
				ВерсияОбъект.Ссылка);
		КонецПопытки;
	КонецЕсли;
	
	// Фиксация результата.
	Если ВсеКаталогиОчищены Тогда
		ВерсияОбъект.КаталогВременныхФайлов = "";
	КонецЕсли;
	
КонецПроцедуры

// Возвращает количество ошибок до остановки обработки версии.
Функция МаксимальноеКоличествоОшибокВерсии() Экспорт
	МаксимальноеКоличествоОшибокВерсии = Константы.МаксимальноеКоличествоОшибокВерсии.Получить();
	Если МаксимальноеКоличествоОшибокВерсии = 0 Тогда
		МаксимальноеКоличествоОшибокВерсии = 10;
	КонецЕсли;
	Возврат МаксимальноеКоличествоОшибокВерсии;
КонецФункции

// Возвращает количество секунд до остановки процессов.
Функция МинутДоПринудительнойОстановки() Экспорт
	Результат = Константы.МинутДоПринудительнойОстановки.Получить();
	Если Результат = 0 Тогда
		Результат = 3*60; // По умолчанию - 3 часа ожидания до завершени.
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Возвращает количество секунд до остановки процессов.
Функция МинутДоПроверкиЗависания() Экспорт
	Результат = Константы.МинутДоПроверкиЗависания.Получить();
	Если Результат = 0 Тогда
		Результат = 30; // По умолчанию - 30 минут ожидания до проверки наличия сеансов.
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция СеансВерсииЕщеЗапущен(ВерсияХранилища) Экспорт
	СостояниеВерсии = СостояниеВерсии(ВерсияХранилища);
	Если СостояниеВерсии.НомерСеанса = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Каждого Сеанс Из ПолучитьСеансыИнформационнойБазы() Цикл
		Если Сеанс.НомерСеанса = СостояниеВерсии.НомерСеанса
			И Сеанс.НачалоСеанса = СостояниеВерсии.НачалоСеанса Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Функция СостояниеВерсии(ВерсияХранилища) Экспорт
	СрезПоследних = РегистрыСведений.СостоянияВерсий.СрезПоследних(, Новый Структура("ВерсияХранилища", ВерсияХранилища));
	Если СрезПоследних.Количество() = 0 Тогда
		Результат = СрезПоследних.Добавить();
		Результат.ВерсияХранилища = ВерсияХранилища;
		Результат.Состояние = Перечисления.СостоянияВерсии.ПустаяСсылка();
		Результат.Период = Дата(1,1,1);
		Результат.НомерСеанса = 0;
		Результат.НачалоСеанса = Дата(1,1,1);
		Возврат Результат;
	Иначе
		Возврат СрезПоследних[0];
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область Параметры

// Компонует все параметры версии в одну структуру для работы с версией хранилища.
//
// Параметры:
//   ПараметрыВерсии - Структура, СтрокаТаблицыЗначений - Значения реквизитов версии хранилища.
//   Хранилище - Структура, СтрокаТаблицыЗначений, СправочникСсылка.ХранилищаКонфигураций, СтрокаТаблицыЗначений
//       - Значения реквизитов хранилища.
//
// Возвращаемое значение:
//   Структура - Контекст работы с версией хранилища.
//
Функция КонтекстРаботыСВерсией(ПараметрыВерсии, Хранилище) Экспорт
	Если ТипЗнч(ПараметрыВерсии) = Тип("СтрокаТаблицыЗначений") Тогда
		ПараметрыВерсии = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ПараметрыВерсии);
	КонецЕсли;
	
	// Параметры версии.
	Контекст = Новый Структура(Новый ФиксированнаяСтруктура(ПараметрыВерсии));
	
	// Параметры хранилища.
	ПараметрыХранилища = ПараметрыХранилища(Хранилище);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Контекст, ПараметрыХранилища, Ложь);
	
	// Аутентификация хранилища.
	Контекст.Вставить("АдресХранилища", ПараметрыХранилища.Адрес);
	
	ДополнитьКонтекстРаботыСВерсией(Контекст);
	
	Возврат Контекст;
КонецФункции

// Добавляет в структуру контекста прочие каталоги.
Процедура ДополнитьКонтекстРаботыСВерсией(Контекст) Экспорт
	Разделитель = ПолучитьРазделительПути();
	
	// Каталоги версии.
	Контекст.КаталогВыгрузкиВерсий = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Контекст.КаталогВыгрузкиВерсий);
	
	Если Не ЗначениеЗаполнено(Контекст.КаталогВременныхФайлов) Тогда
		ИмяПодкаталога = ?(ТипЗнч(Контекст.Код) = Тип("Число"), Формат(Контекст.Код, "ЧДЦ=; ЧГ=0"), Строка(Контекст.Код));
		Контекст.Вставить("КаталогВременныхФайлов", Контекст.КаталогВыгрузкиВерсий + ИмяПодкаталога);
	КонецЕсли;
	Контекст.КаталогВременныхФайлов = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Контекст.КаталогВременныхФайлов);
	
	Если Не ОбщегоНазначения.КаталогСуществует(Контекст.КаталогВременныхФайлов) Тогда
		СоздатьКаталог(Контекст.КаталогВременныхФайлов);
	КонецЕсли;
	
	Контекст.Вставить("КаталогВыгрузкиВXML", Контекст.КаталогВременныхФайлов + "dump" + Разделитель);
	
	// https://its.1c.ru/db/edtdoc#content:10330:hdoc
	// В рабочей области хранится часть настроек EDT.
	Контекст.Вставить("РабочийКаталогEDT", Контекст.КаталогВременныхФайлов + "ws" + Разделитель);
	
	// Каталог проекта, в который следует импортировать проект в формате 1C:EDT.
	Контекст.Вставить("КаталогПроектаEDT", Контекст.КаталогВременныхФайлов + "p" + Разделитель);
	
	Если ЗначениеЗаполнено(Контекст.ИмяПроектаEDT) Тогда
		МассивИмен = СтрРазделить(Контекст.ИмяПроектаEDT, "\/", Ложь);
		Если МассивИмен.Количество() > 0 Тогда
			Контекст.КаталогПроектаEDT = Контекст.КаталогПроектаEDT + МассивИмен[МассивИмен.ВГраница()];
			Контекст.КаталогПроектаEDT = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Контекст.КаталогПроектаEDT);
		КонецЕсли;
	КонецЕсли;
	
	Контекст.Вставить("КаталогИсходниковEDT", Контекст.КаталогПроектаEDT + "src" + Разделитель);
	Контекст.Вставить("КаталогИБ", Контекст.КаталогВременныхФайлов + "db" + Разделитель);
	
	// Файлы состояния версии.
	ПрефиксИмениФайла = Перечисления.СостоянияВерсии.ПрефиксИмениФайла(Контекст.Состояние);
	
	Контекст.Вставить("ИмяФайлаЛога", ИмяФайлаЛога(Контекст));
	Контекст.Вставить("ФайлПараметровПакетнойОперации", Контекст.КаталогВременныхФайлов + ПрефиксИмениФайла + "_params.txt");
	Контекст.Вставить("ИмяФайлаРезультатов", Контекст.КаталогВременныхФайлов + ПрефиксИмениФайла + "_result.txt");
	
	// Файлы Git.
	
	Контекст.Вставить("ИмяФайлаКомандыGit", ИмяКомандногоФайлаGit(Контекст.КаталогВыгрузкиВерсий, Контекст.Код));
	Контекст.Вставить("ИмяФайлаКомментарияGit", ИмяФайлаКомментарияGit(Контекст.КаталогВыгрузкиВерсий, Контекст.Код));
	
	// Очистка лога от предшествующего запуска.
	ОбщегоНазначения.УдалитьФайлИлиКаталог(Контекст.ИмяФайлаЛога);
КонецПроцедуры

// Получает параметры хранилища в виде структуры.
//
// Параметры:
//   Хранилище - СправочникСсылка.ХранилищаКонфигураций, СтрокаТаблицыЗначений, Структура - Реквизиты хранилища.
//
// Возвращаемое значение:
//   Структура - Параметры хранилища.
//
Функция ПараметрыХранилища(Хранилище) Экспорт
	Если ТипЗнч(Хранилище) = Тип("СправочникСсылка.ХранилищаКонфигураций") Тогда
		Запрос = Справочники.ХранилищаКонфигураций.ЗапросПоЭлементам(Новый Структура("Ссылка", Хранилище), , 1);
		Таблица = Запрос.Выполнить().Выгрузить();
		Если Таблица.Количество() > 0 Тогда
			ПараметрыХранилища = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Таблица[0]);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Хранилище) = Тип("СтрокаТаблицыЗначений") Тогда
		ПараметрыХранилища = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Хранилище);
	ИначеЕсли ТипЗнч(Хранилище) = Тип("Структура") Тогда
		ПараметрыХранилища = Хранилище;
		Если ПараметрыХранилища.Свойство("РепозиторийGit_ПутьКПроектуEDT") Тогда
			Возврат ПараметрыХранилища;
		КонецЕсли;
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип первого параметра Хранилище: %1'"), Строка(ТипЗнч(Хранилище)));
	КонецЕсли;
	
	
	ПараметрыХранилища.КаталогВыгрузкиВерсий = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПараметрыХранилища.КаталогВыгрузкиВерсий);
	
	Если ТипЗнч(ПараметрыХранилища.КодВерсииВGit) <> Тип("Число") Тогда
		ПараметрыХранилища.КодВерсииВGit = 0;
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////
	// Каталоги локального репозитория Git.
	
	// Путь к папке репозитория Git: "</path_to_git>/".
	ЛокальныйКаталогGit = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПараметрыХранилища.ЛокальныйКаталогGit);
	
	// Путь к папке проекта в репозитории Git: "<ProjectName>/".
	ОтносительноеИмяКаталогаПроектаEDT = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПараметрыХранилища.ИмяПроектаEDT);
	
	// Путь к проекту в репозитории: "</path_to_git>/<ProjectName>/.
	ПараметрыХранилища.Вставить("РепозиторийGit_ПутьКПроектуEDT", ЛокальныйКаталогGit + ОтносительноеИмяКаталогаПроектаEDT);
	
	// Путь к папке src в репозитории Git: "<ProjectName>/src/".
	ПараметрыХранилища.Вставить("РепозиторийGit_ОтносительноеИмяКаталогаИсходниковEDT", ОтносительноеИмяКаталогаПроектаEDT + "src");
	ПараметрыХранилища.РепозиторийGit_ОтносительноеИмяКаталогаИсходниковEDT = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПараметрыХранилища.РепозиторийGit_ОтносительноеИмяКаталогаИсходниковEDT);
	
	// Путь к файлам конфигурации проекта в репозитории: "</path_to_git>/<ProjectName>/src/.
	ПараметрыХранилища.Вставить("РепозиторийGit_ПутьКИсходникамEDT", ЛокальныйКаталогGit + ПараметрыХранилища.РепозиторийGit_ОтносительноеИмяКаталогаИсходниковEDT);
	
	////////////////////////////////////////////////////////////////////////////////
	// Константы.
	
	ПараметрыХранилища.Вставить("МаксимальноеКоличествоЧастичныхВыгрузокПодряд", Константы.МаксимальноеКоличествоЧастичныхВыгрузокПодряд.Получить());
	Если ПараметрыХранилища.МаксимальноеКоличествоЧастичныхВыгрузокПодряд < 1 Тогда
		ПараметрыХранилища.МаксимальноеКоличествоЧастичныхВыгрузокПодряд = 10;
	КонецЕсли;
	
	Возврат ПараметрыХранилища;
КонецФункции

// Возвращает полное имя каталога bin платформы используемой при работе с хранилищем.
Функция КаталогПлатформыХранилища(Контекст) Экспорт
	Перем Результат;
	Если Контекст.Свойство("КаталогПлатформыХранилища", Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВерсияПлатформы = Контекст.ВерсияПлатформыХранилища;
	Если Не ЗначениеЗаполнено(ВерсияПлатформы) Тогда
		ВерсияПлатформы = Контекст.ВерсияПлатформыВыгрузки;
		Если Не ЗначениеЗаполнено(ВерсияПлатформы) Тогда
			СистемнаяИнформация = Новый СистемнаяИнформация;
			ВерсияПлатформы = СистемнаяИнформация.ВерсияПриложения;
		КонецЕсли;
	КонецЕсли;
	
	ПутьКВерсиямПлатформы = ПутьКВерсиямПлатформы(Контекст);
	Результат = СтрЗаменить(ПутьКВерсиямПлатформы, "%ВерсияПлатформы%", ВерсияПлатформы);
	
	Если Не ОбщегоНазначения.КаталогСуществует(Результат) Тогда
		ТекстОшибки = НСтр("ru = 'На [ИмяСервера] не найдена платформа [ВерсияПлатформы] по пути [Путь]. Путь, указанный в константе ПутьКВерсиямПлатформыНаСервере: [ПутьВНастройках].'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[ВерсияПлатформы]", ВерсияПлатформы);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[ИмяСервера]", ИмяКомпьютера());
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[Путь]", Результат);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[ПутьВНастройках]", ПутьКВерсиямПлатформы);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Контекст.Вставить("КаталогПлатформыХранилища", Результат);
	Возврат Результат;
КонецФункции

// Возвращает полное имя каталога bin платформы используемой при выгрузке в XML.
Функция КаталогПлатформыВыгрузкиXML(Контекст) Экспорт
	Перем Результат;
	Если Контекст.Свойство("КаталогПлатформыВыгрузкиXML", Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВерсияПлатформы = ВерсияПлатформыВыгрузкиXML(Контекст);
	
	ПутьКВерсиямПлатформы = ПутьКВерсиямПлатформы(Контекст);
	Результат = СтрЗаменить(ПутьКВерсиямПлатформы, "%ВерсияПлатформы%", ВерсияПлатформы);
	Контекст.Вставить("КаталогПлатформыВыгрузкиXML", Результат);
	
	Если Не ОбщегоНазначения.КаталогСуществует(Результат) Тогда
		ТекстОшибки = НСтр("ru = 'На [ИмяСервера] не найдена платформа [ВерсияПлатформы] по пути [Путь]. Путь, указанный в константе ПутьКВерсиямПлатформыНаСервере: [ПутьВНастройках].'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[ВерсияПлатформы]", ВерсияПлатформы);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[ИмяСервера]", ИмяКомпьютера());
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[Путь]", Результат);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[ПутьВНастройках]", ПутьКВерсиямПлатформы);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Возвращает версию платформы используемую при выгрузке в XML.
Функция ВерсияПлатформыВыгрузкиXML(Контекст) Экспорт
	ВерсияПлатформы = Контекст.ВерсияПлатформыВыгрузки;
	Если Не ЗначениеЗаполнено(ВерсияПлатформы) Тогда
		ВерсияПлатформы = Контекст.ВерсияПлатформыХранилища;
		Если Не ЗначениеЗаполнено(ВерсияПлатформы) Тогда
			СистемнаяИнформация = Новый СистемнаяИнформация;
			ВерсияПлатформы = СистемнаяИнформация.ВерсияПриложения;
		КонецЕсли;
	КонецЕсли;
	Возврат ВерсияПлатформы;
КонецФункции

// Возвращает версию платформы используемую при выгрузке в XML.
Функция ВерсияПлатформыДляEDT(Контекст) Экспорт
	Фрагменты = СтрРазделить(ВерсияПлатформыВыгрузкиXML(Контекст), ".");
	Пока Фрагменты.Количество() > 3 Цикл
		Фрагменты.Удалить(3);
	КонецЦикла;
	Возврат СтрСоединить(Фрагменты, ".");
КонецФункции

// Возвращает шаблон полного имени каталога bin платформы. В шаблоне присутствует параметр %ВерсияПлатформы%.
Функция ПутьКВерсиямПлатформы(Контекст = Неопределено) Экспорт
	Перем Результат;
	Если Контекст <> Неопределено И Контекст.Свойство("ПутьКВерсиямПлатформы", Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Константы.ПутьКВерсиямПлатформыНаСервере.Получить();
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ПутьКВерсиямПлатформыПоУмолчанию();
	КонецЕсли;
	
	Если Контекст <> Неопределено Тогда
		Контекст.Вставить("ПутьКВерсиямПлатформы", Результат);
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Возвращает шаблон полного имени каталога bin платформы. В шаблоне присутствует параметр %ВерсияПлатформы%.
Функция ПутьКВерсиямПлатформыПоУмолчанию() Экспорт
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ТекущаяВерсия = СистемнаяИнформация.ВерсияПриложения;
	КаталогПрограммы = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(КаталогПрограммы());
	Возврат СтрЗаменить(КаталогПрограммы, ТекущаяВерсия, "%ВерсияПлатформы%");
КонецФункции

// Формирует полное имя файла команды коммита версии для запуска в системе.
//
// Параметры:
//   ПолноеИмяКаталога - Строка - Каталог выгрузки версий хранилища
//   ПрефиксФайла - Число - Код версии хранилища
//                - Строка - Префикс файла
//
// Возвращаемое значение:
//   Строка - Полное имя файла команды коммита версии
//
Функция ИмяКомандногоФайлаGit(Знач ПолноеИмяКаталога, Знач ПрефиксФайла) Экспорт
	Возврат ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПолноеИмяКаталога)
		+ ?(ТипЗнч(ПрефиксФайла) = Тип("Число"), Формат(ПрефиксФайла, "ЧДЦ=; ЧГ=0"), Строка(ПрефиксФайла))
		+ ?(ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер(), "_git_command.bat", "_git_command.sh");
КонецФункции

// Формирует полное имя файла комментария коммита версии.
//
// Параметры:
//   ПолноеИмяКаталога - Строка - Каталог выгрузки версий хранилища
//   ПрефиксФайла - Число - Код версии хранилища
//                - Строка - Префикс файла
//
// Возвращаемое значение:
//   Строка - Полное имя файла лога комментария версии
//
Функция ИмяФайлаКомментарияGit(Знач ПолноеИмяКаталога, Знач ПрефиксФайла) Экспорт
	Возврат ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПолноеИмяКаталога)
		+ ?(ТипЗнч(ПрефиксФайла) = Тип("Число"), Формат(ПрефиксФайла, "ЧДЦ=; ЧГ=0"), Строка(ПрефиксФайла))
		+ "_git_comment.txt";
КонецФункции

// Формирует полное имя файла лога коммита версии.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
// Возвращаемое значение:
//   Строка - Полное имя файла лога коммита версии.
//
Функция ИмяФайлаЛогаGit(Контекст) Экспорт
	Возврат ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Контекст.КаталогВыгрузкиВерсий)
		+ ?(ТипЗнч(Контекст.Код) = Тип("Число"), Формат(Контекст.Код, "ЧДЦ=; ЧГ=0"), Строка(Контекст.Код))
		+ "_git_log.txt";
КонецФункции

// Формирует полное имя файла лога конвертации хранилища
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
// Возвращаемое значение:
//   Строка - Полное имя файла лога.
//
Функция ИмяФайлаЛога(Контекст) Экспорт
	Если Контекст.ОтключитьЛогирование Тогда
		Возврат "";
	ИначеЕсли Контекст.Состояние = Перечисления.СостоянияВерсии.ПомещаетсяВGit
		Или Контекст.Состояние = Перечисления.СостоянияВерсии.ПомещенаВGit Тогда
		Возврат ИмяФайлаЛогаGit(Контекст);
	Иначе
		ПрефиксИмениФайла = Перечисления.СостоянияВерсии.ПрефиксИмениФайла(Контекст.Состояние);
		Возврат ОбщегоНазначения.ИмяФайлаЛога(Контекст.КаталогВременныхФайлов, ПрефиксИмениФайла);
	КонецЕсли;
КонецФункции

// Формирует имя базового проекта расширения для EDT.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
// Возвращаемое значение:
//   Строка - Имя базового проекта расширения для EDT.
//
Функция ИмяБазовогоПроектаРасширения(Контекст) Экспорт
	Перем Результат;
	Если Контекст.Свойство("ИмяБазовогоПроектаРасширения", Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	Если Контекст.ТипХранилища <> Перечисления.ТипыХранилищаКонфигураций.Расширение Тогда
		Результат = "";
	ИначеЕсли ТипЗнч(Контекст.БазовыйПроект) = Тип("СправочникСсылка.ХранилищаКонфигураций") 
		И ЗначениеЗаполнено(Контекст.БазовыйПроект) Тогда
		ИмяПроектаEDT = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контекст.БазовыйПроект, "ИмяПроектаEDT");
		СегментыПути = СтрРазделить(ИмяПроектаEDT, ПолучитьРазделительПути());
		Если СегментыПути.Количество() > 0 Тогда
			Результат = СегментыПути[СегментыПути.ВГраница()];
		Иначе
			Результат = ИмяПроектаEDT;
		КонецЕсли;
	Иначе
		Результат = Строка(Контекст.БазовыйПроект);
	КонецЕсли;
	Контекст.Вставить("ИмяБазовогоПроектаРасширения", Результат);
	Возврат Результат;
КонецФункции

// Поднимает исключение в контексте текущего состояния версии хранилища. Прикладывает к сообщению лог, если есть.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
Процедура ВызватьИсключениеПриОбработкеВерсии(Контекст) Экспорт
	ТекстОшибки = НСтр("ru = 'Версия %1: При выполнении операции %2 возникла ошибка.'");
	ТекстОшибки = СтрШаблон(ТекстОшибки, Контекст.Код, Контекст.Состояние);
	
	Если Контекст.ОтключитьЛогирование Или Не ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		ТекстОшибки = ТекстОшибки + ". "
			+ НСтр("ru = 'Подробнее см. журнал регистрации. Включите логирование и повторите операцию для анализа ошибок.'");
	Иначе
		ТекстОшибки = ТекстОшибки + ". "
			+ НСтр("ru = 'Подробнее см. журнал регистрации и лог в %1.
				|
				|--- %1:
				|%2'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Контекст.ИмяФайлаЛога, СтроковыеФункции.СтрокаИзФайла(Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	ВызватьИсключение ТекстОшибки;
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Получает отчет по коммитам хранилища 1С и загружает его в базу данных (заполняет список версий).
//
// Параметры:
//   Хранилище - СправочникСсылка.ХранилищаКонфигураций
//   ПараметрыХранилища - Структура - См. КонвертацияХранилища.ПараметрыХранилища.
//
Процедура ПостроитьОтчетПоХранилищуИЗаполнитьСписокВерсий(Хранилище, ПараметрыХранилища) Экспорт
	
	ПараметрыВерсии = Справочники.ВерсииХранилища.ПараметрыВерсии(Неопределено);
	ПараметрыВерсии.Код = "ReportDB";
	ПараметрыВерсии.Состояние = Перечисления.СостоянияВерсии.ПустаяСсылка();
	Контекст = КонтекстРаботыСВерсией(ПараметрыВерсии, ПараметрыХранилища);
	
	УдалитьФайлы(Контекст.КаталогВременныхФайлов, "*");
	
	СоздатьФайловуюИнформационнуюБазу(Контекст);
	
	Контекст.Вставить("СтрокаСоединенияИБ", " /F """ + Контекст.КаталогИБ + """");
	Контекст.Вставить("ИмяПользователяИБ", "");
	Контекст.Вставить("ПарольПользователяИБ", "");
	
	ДобавитьПустоеРасширениеКонфигурации(Контекст);
	
	ПоследняяВерсия = Справочники.ВерсииХранилища.ПоследняяВерсияХранилища(Хранилище);
	
	Контекст.Вставить("ИмяФайлаОтчета", Контекст.КаталогВременныхФайлов + "Report.mxl");
	Контекст.Вставить("ВерсияНачала", ПоследняяВерсия.Код + 1);
	
	СформироватьОтчетПоВерсиямХранилища(Контекст);
	
	Справочники.ВерсииХранилища.ЗагрузитьВерсииИзОтчета(Хранилище, Контекст.ИмяФайлаОтчета);
	
КонецПроцедуры

// Получает версию хранилища в базу.
//
// Параметры:
//   Источник - СправочникСсылка.ХранилищаКонфигураций, СправочникСсылка.КопииХранилищКонфигурации
//       - Хранилище версии.
//   ВерсияХранилища - СправочникСсылка.ВерсииХранилища
//       - Получаемая версия.
//
Функция ПолучитьВерсиюХранилищаВБазу(Источник, ВерсияХранилища)
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Не Справочники.ВерсииХранилища.НачатьОбработкуВерсии(
			ВерсияХранилища,
			Неопределено,
			Перечисления.СостоянияВерсии.ПустаяСсылка(),
			Перечисления.СостоянияВерсии.ПолучаетсяCF,
			Новый Структура("Источник", Источник)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ПараметрыВерсии = Справочники.ВерсииХранилища.ПараметрыВерсии(ВерсияХранилища);
		Контекст = КонтекстРаботыСВерсией(ПараметрыВерсии, ПараметрыВерсии.Владелец);
		
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.КопииХранилищКонфигурации") Тогда
			ИменаРеквизитов = "Адрес, ИмяПользователяХранилища, ПарольПользователяХранилища";
			РеквизитыКопии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, ИменаРеквизитов);
			Контекст.АдресХранилища = РеквизитыКопии.Адрес;
			Контекст.ИмяПользователяХранилища = РеквизитыКопии.ИмяПользователяХранилища;
			Контекст.ПарольПользователяХранилища = РеквизитыКопии.ПарольПользователяХранилища;
		КонецЕсли;
		
		ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Создание базы'"));
		
		СоздатьФайловуюИнформационнуюБазу(Контекст);
		
		Контекст.Вставить("СтрокаСоединенияИБ", "/F """ + Контекст.КаталогИБ + """");
		Контекст.Вставить("ИмяПользователяИБ", "");
		Контекст.Вставить("ПарольПользователяИБ", "");
		
		ДобавитьПустоеРасширениеКонфигурации(Контекст);
		
		ДлительныеОперации.СообщитьПрогресс(20, НСтр("ru = 'Получение версии из хранилища'"));
		
		ОбновитьИнформационнуюБазуИзХранилища(Контекст, Контекст.Код);
		
		ДлительныеОперации.СообщитьПрогресс(90, НСтр("ru = 'Сохранение файла информации выгрузки'"));
		
		Контекст.Вставить("КаталогВыгрузкиВXML", Контекст.КаталогВременныхФайлов);
		СохранитьФайлИнформацииВыгрузки(Контекст);
		
		ДлительныеОперации.СообщитьПрогресс(100, НСтр("ru = 'Версия получена из хранилища'"));
		
		ЗначенияРеквизитов = Новый Структура("Состояние", Перечисления.СостоянияВерсии.ПолученCF);
		Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(ВерсияХранилища, ЗначенияРеквизитов);
		
	Исключение
		Справочники.ВерсииХранилища.ВозниклаОшибка(ВерсияХранилища, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

// Подбирает версию для обработки очереди выгрузки в XML или загрузки в EDT.
//
// Параметры:
//   ПараметрыХранилища - Структура - См. КонвертацияХранилища.ПараметрыХранилища.
//   СостояниеДоНачала - ПеречислениеСсылка.СостоянияВерсии - Состояние версии до начала обработки.
//   ПредыдущаяОбработаннаяВерсия - Неопределено, Структура - См. Справочники.ВерсииХранилища.ПараметрыВерсии.
//
// Возвращаемое значение:
//   Неопределено - Версия не найдена.
//   Структура - Версия для обработки. См. Справочники.ВерсииХранилища.ПараметрыВерсии.
//
Функция ВыбратьВерсиюДляОбработки(ПараметрыХранилища, СостояниеДоНачала, ПредыдущаяОбработаннаяВерсия = Неопределено) Экспорт
	// Самым наилучшим считается последовательная обработка версий по порядку.
	Если ПредыдущаяОбработаннаяВерсия <> Неопределено Тогда
		ПараметрыСледующейВерсииВОчереди = Справочники.ВерсииХранилища.СледующаяВерсия(ПараметрыХранилища.Ссылка, ПредыдущаяОбработаннаяВерсия.Код);
		Если ПараметрыСледующейВерсииВОчереди = Неопределено Тогда
			Возврат Неопределено; // Версия является последней в очереди.
		КонецЕсли;
		Если ПараметрыСледующейВерсииВОчереди.ВозниклаОшибка = Ложь
			И ПараметрыСледующейВерсииВОчереди.Состояние = СостояниеДоНачала
			И ПараметрыСледующейВерсииВОчереди.Код <> ПредыдущаяОбработаннаяВерсия.Код Тогда
			Возврат ПараметрыСледующейВерсииВОчереди;
		КонецЕсли;
	КонецЕсли;
	
	// Если по порядку версия уже обработана, то подбирается наилучшая версия из списка доступных.
	
	СостояниеПолученCF = Перечисления.СостоянияВерсии.ПолученCF;
	Если СостояниеДоНачала = СостояниеПолученCF // Это задание по выгрузке в XML.
		И ПараметрыХранилища.ВыгружатьИзменения // В настройках хранилища включен флажок выгрузки изменений.
		Тогда
		
		// Для частичной выгрузки в XML подходящая версия подбираются в соответствии с приоритетом:
		// 1. Версия является первой на очереди выгрузки в XML (перед ней нет других с состоянием = ПолученCF, ВыгружаетсяВXML).
		// 2. Предыдущая версия выгружена в XML (Состояние = ВыгруженаВXML, ЗагружаетсяВEDT, ЗагруженаВEDT).
		// 3. Версия требует полную выгрузку в XML (в соответствии с настройками версии, хранилища и базы).
		// 4. У предыдущей версии выгружен ConfigDumpInfo.xml (Состояние = ПолученCF).
		// 5. Версия требует частичную выгрузку в XML. В этом случае возвращается Неопределено,
		//    т.к. из соображений производительности лучше подождать появления подходящей версии.
		
		Таблица = Справочники.ВерсииХранилища.СостоянияПодготавливаемыхВерсий(ПараметрыХранилища);
		Таблица.Сортировать("Код Возр");
		
		ПараметрыПредыдущейВерсии = Неопределено;
		ЭтоПерваяВыгрузкаВXML = Истина;
		СостояниеВыгружаетсяВXML = Перечисления.СостоянияВерсии.ВыгружаетсяВXML;
		КодПредыдущейПолнойВыгрузкиXML = Неопределено;
		ПерваяВерсияПриоритета3 = Неопределено;
		ПерваяВерсияПриоритета4 = Неопределено;
		СостоянияВКоторыхЕстьXML = Перечисления.СостоянияВерсии.СостоянияВКоторыхЕстьXML();
		
		Для Каждого ПараметрыВерсии Из Таблица Цикл
			Если ПараметрыВерсии.Состояние = СостояниеПолученCF Тогда
				Если ЭтоПерваяВыгрузкаВXML Тогда
					Возврат ПараметрыВерсии; // Приоритет 1 срабатывает только для 1й версии по порядку, его можно возвращать сразу.
				ИначеЕсли СостоянияВКоторыхЕстьXML.Найти(ПараметрыПредыдущейВерсии.Состояние) <> Неопределено Тогда
					Возврат ПараметрыВерсии; // Приоритет 2 тоже можно возвращать сразу, т.к. версии идут по порядку и лучше не найдем.
				ИначеЕсли ПерваяВерсияПриоритета3 = Неопределено
					И ТребуетсяПолнаяВыгрузкаВерсииВXML(ПараметрыВерсии, ПараметрыХранилища, КодПредыдущейПолнойВыгрузкиXML) Тогда
					ПерваяВерсияПриоритета3 = ПараметрыВерсии;
				ИначеЕсли ПерваяВерсияПриоритета4 = Неопределено
					И ЕстьФайлСостоянияПредыдущейВерсии(ПараметрыПредыдущейВерсии) Тогда
					ПерваяВерсияПриоритета4 = ПараметрыВерсии;
				КонецЕсли;
			ИначеЕсли ПараметрыВерсии.Состояние = СостояниеВыгружаетсяВXML Тогда
				ЭтоПерваяВыгрузкаВXML = Ложь;
			КонецЕсли;
			ПараметрыПредыдущейВерсии = ПараметрыВерсии;
		КонецЦикла;
		
		// Версий приоритета 1 и 2 нет.
		Если ПерваяВерсияПриоритета3 <> Неопределено Тогда
			Возврат ПерваяВерсияПриоритета3;
		ИначеЕсли ПерваяВерсияПриоритета4 <> Неопределено Тогда
			Возврат ПерваяВерсияПриоритета4;
		КонецЕсли;
		
		Возврат Неопределено; // Ждем появления подходящих версий (либо вообще нет версий, либо если версии приоритета 5 - см. выше).
	КонецЕсли;
	
	// В остальных случаях выбирается первая по порядку версия с подходящим состоянием.
	// Например, если это задание по загрузке в EDT,
	// либо по выгрузке в XML при условии, что в настройках хранилища НЕ включен флажок выгрузки изменений).
	Отбор = Новый Структура("ВозниклаОшибка, Состояние", Ложь, СостояниеДоНачала);
	Таблица = Справочники.ВерсииХранилища.СостоянияПодготавливаемыхВерсий(ПараметрыХранилища, Отбор, 1);
	Если Таблица.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Таблица[0];
	
КонецФункции

// Зачитываются реквизиты объекта метаданных из mdo файла
// 
// Параметры:
// 	СтруктураФайла - Структура - параметры файла
// 	КвалифицированныеОбъекты - Структура - список квалифицированных объектов для поиска в файле
// 	ПодчиненныеОбъекты - Массив - список подчиненных объектов
Процедура ПрочитатьСвойстваОбъектаМетаданныхEDT(СтруктураФайла, КвалифицированныеОбъекты, ПодчиненныеОбъекты)

	Попытка

		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(СтруктураФайла.ФайлПолноеИмя);

		Если ЧтениеXML.Прочитать() И СтрНачинаетсяС(ЧтениеXML.Имя, "mdclass:")
				И ЧтениеXML.КоличествоАтрибутов() > 0 Тогда
			Пока ЧтениеXML.ПрочитатьАтрибут() Цикл

				Если ЧтениеXML.Имя = "uuid" Тогда

					СтруктураФайла.Вставить("UUID", ЧтениеXML.Значение);
					Прервать;
				КонецЕсли;
			КонецЦикла;

			Пока ЧтениеXML.Прочитать() Цикл
				Если КвалифицированныеОбъекты.Получить(ЧтениеXML.Имя) <> Неопределено Тогда
					Если ЧтениеXML.КоличествоАтрибутов() > 0 Тогда

						ПодчиненныйОбъект = Новый Структура;
						ПодчиненныйОбъект.Вставить("Тип", ЧтениеXML.Имя);

						Пока ЧтениеXML.ПрочитатьАтрибут() Цикл

							Если ЧтениеXML.Имя = "uuid" Тогда

								ПодчиненныйОбъект.Вставить("UUID", ЧтениеXML.Значение);
								Прервать;
							КонецЕсли;
						КонецЦикла;

						Пока ЧтениеXML.Прочитать()
							И ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл

							Если ЧтениеXML.Имя = "name" Тогда

								ЧтениеXML.Прочитать();
								ПодчиненныйОбъект.Вставить("Имя", ЧтениеXML.Значение);
								ПодчиненныеОбъекты.Добавить(ПодчиненныйОбъект);
								ЧтениеXML.Пропустить();
							Иначе
								ЧтениеXML.Пропустить();
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ЧтениеXML.Закрыть();

	Исключение

	КонецПопытки;

КонецПроцедуры

// Составляет список объектов дополнительных объектов для выгрузки
// 
// Параметры:
// 	ФайлИзменений - ТекстовыйДокумент - Файл с описанием измененений
// 	ИмяФайлаДампа - Строка - Имя файл информации дампа
// Возвращаемое значение:
// 	Массив из Строка - список объектов которые необходимо выгрузить дополнительно
Функция ПолучитьСписокОбъектовДовыгрузки(ТекстИзменений, ИмяФайлаДампа)
	
	СписокОбъектов = Новый Массив;
	
	ВыгруженныеИзменения = Новый Соответствие();
	
	КоличествоСтрок = СтрЧислоСтрок(ТекстИзменений);
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		СтрокаИзменений = СтрПолучитьСтроку(ТекстИзменений, НомерСтроки);
		СтрокаИзменений = СтрЗаменить(СтрокаИзменений, "New:", "");
		СтрокаИзменений = СтрЗаменить(СтрокаИзменений, "Modified:", "");
		СтрокаИзменений = СокрЛП(СтрокаИзменений);
		Если ПустаяСтрока(СтрокаИзменений) Тогда
			Продолжить;
		КонецЕсли;
		Сегменты = СтрРазделить(СтрокаИзменений, ".");
		Если Сегменты.Количество() > 0  И (Сегменты[0] = "Language" ИЛИ Сегменты[0] = "Configuration") Тогда
			Родитель = Сегменты[0];
		ИначеЕсли Сегменты.Количество() > 1 Тогда
			Родитель = Сегменты[0] + "." + Сегменты[1];
		Иначе
			Родитель = СтрокаИзменений;
		КонецЕсли;
		Изменения = ВыгруженныеИзменения.Получить(Родитель);
		Если Изменения = Неопределено Тогда
			Изменения = Новый Массив;
		КонецЕсли;
		Если Изменения.Найти(СтрокаИзменений) = Неопределено Тогда
			Изменения.Добавить(СтрокаИзменений);
		КонецЕсли;
		ВыгруженныеИзменения.Вставить(Родитель, Изменения);
		
		// Добавляем для корня конфигурации - языки, а для языков - корень конфигурации
		Если Сегменты.Количество() > 0  И (Сегменты[0] = "Language" ИЛИ Сегменты[0] = "Configuration") Тогда
			Если Сегменты[0] = "Configuration" Тогда
				Родитель = "Language";
			Иначе
				Родитель = "Configuration";
			КонецЕсли;
			Изменения = ВыгруженныеИзменения.Получить(Родитель);
			Если Изменения = Неопределено Тогда
				Изменения = Новый Массив;
				ВыгруженныеИзменения.Вставить(Родитель, Изменения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДочерниеОбъекты = Новый Массив;
	ДочерниеОбъекты.Добавить("Form");
	ДочерниеОбъекты.Добавить("Template");
	ДочерниеОбъекты.Добавить("Recalculation");
	ДочерниеОбъекты.Добавить("Subsystem");
	
	Попытка

		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяФайлаДампа);

		Если ЧтениеXML.Прочитать() И  ЧтениеXML.Имя = "ConfigDumpInfo" И ЧтениеXML.Прочитать() И ЧтениеXML.Имя = "ConfigVersions"  Тогда
			Стек = 0;
			Пока ЧтениеXML.Прочитать() И  ЧтениеXML.Имя = "Metadata" Цикл
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					Стек = Стек - 1;
					Продолжить;
				КонецЕсли;
				
				Стек = Стек + 1;
				Если Стек > 1 Тогда
					Продолжить;
				КонецЕсли;
				ИмяОбъекта = "";
				Если ЧтениеXML.КоличествоАтрибутов() > 0 Тогда
					Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
						Если ЧтениеXML.Имя = "name" Тогда

							ИмяОбъекта = ЧтениеXML.Значение;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
					Сегменты = СтрРазделить(ИмяОбъекта, ".");
					Если Сегменты.Количество() > 0 И (Сегменты[0] = "Language" ИЛИ Сегменты[0] = "Configuration") Тогда
						Родитель = Сегменты[0];
					ИначеЕсли Сегменты.Количество() > 1 Тогда
						Родитель = Сегменты[0] + "." + Сегменты[1];
					Иначе
						Родитель = ИмяОбъекта;
					КонецЕсли;
					
					Если Сегменты.Количество() > 2 И ДочерниеОбъекты.Найти(Сегменты[2]) = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					Изменения = ВыгруженныеИзменения.Получить(Родитель);
					Если Изменения <> Неопределено И Изменения.Найти(ИмяОбъекта) = Неопределено Тогда
						СписокОбъектов.Добавить(ИмяОбъекта);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		ЧтениеXML.Закрыть();

	Исключение

	КонецПопытки;
	
	Возврат СписокОбъектов;
	
КонецФункции


// Формирует файлы коммита и записывает в зависимости от ОС
// 
// Параметры:
// 	ВерсияХранилища - СправочникСсылка.ВерсииХранилища - Ссылка на версию
// 	ПредыдущаяВерсия - СправочникСсылка.ВерсииХранилища - Ссылка на предыдущую версию
// 	РеквизитыХранилища - Структура - Реквизиты хранилища
// 	РеквизитыВерсии - Структура - Реквизиты версии
// 	ИмяФайлаКомандыGit - Строка - Имя файла команды коммита в гит
// 	ИмяФайлаЛога - Строка - Имя файла лога операции коммита или пустая строка, если логирование отключено
// 	ИмяФайлКомментария - Строка - имя файла комментария к коммиту
//
Процедура ЗаписатьФайлыКоммитаВерсии(ВерсияХранилища, ПредыдущаяВерсия, РеквизитыХранилища, РеквизитыВерсии, 
	ИмяФайлаКомандыGit, ИмяФайлаЛога, ИмяФайлКомментария)

	// Путь к проекту в репозитории /path_to_git/Project/
	РеквизитыХранилища.Вставить("ПутьКПроекту", ПутьКПроекту(РеквизитыХранилища));
	// Путь к файлам конфигурации проекта в репозитории /path_to_git/Project/src/
	РеквизитыХранилища.Вставить("ПутьКФайламПроекта", ПутьКФайламПроекта(РеквизитыХранилища));
	
	// Каталог исходных файлов проекта /path_to_dump/1/p/Project/
	РеквизитыВерсии.Вставить("КаталогПроектаEDT", КаталогПроектаEDT(РеквизитыВерсии));
	// Каталог исходных файлов проекта /path_to_dump/1/p/Project/src/
	РеквизитыВерсии.Вставить("ПутьКФайламПроектаВерсии", ПутьКФайламПроектаВерсии(РеквизитыВерсии));
		
	ФайлКоманды = Новый ТекстовыйДокумент;

	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();

	Если ЭтоWindowsСервер Тогда
		ТекстКоманды = "@ECHO OFF";
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		ТекстКоманды = "chcp 65001";
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	Иначе
		ТекстКоманды = "#!/bin/bash";
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	КонецЕсли;

	Если ЗначениеЗаполнено(ИмяФайлаЛога) тогда
		ТекстКоманды = ?(ЭтоWindowsСервер, "set ", "") + "LOGFILE=""%ФайлЛога%""";
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ФайлЛога%", ИмяФайлаЛога);
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);

		Если ЭтоWindowsСервер Тогда
			ВыводЛога = " >> %LOGFILE% 2>&1";
		Иначе
			ВыводЛога = " >> $LOGFILE 2>&1";
		КонецЕсли;
	Иначе
		ВыводЛога = "";
	КонецЕсли;
	
	Если ЭтоWindowsСервер Тогда
		ТекстКомандыУстановкиКаталога = "cd /D ""%ЛокальныйКаталогGit%""" + ВыводЛога;
	Иначе
		ТекстКомандыУстановкиКаталога = "cd ""%ЛокальныйКаталогGit%""" + ВыводЛога;
	КонецЕсли;
	ТекстКомандыУстановкиКаталога = СтрЗаменить(ТекстКомандыУстановкиКаталога, "%ЛокальныйКаталогGit%", 
		РеквизитыХранилища.ЛокальныйКаталогGit);

	ФайлКоманды.ДобавитьСтроку(ТекстКомандыУстановкиКаталога);
	
	ПрефиксКаталогаИсходников = КаталогФайловПроектаВРепозитории(РеквизитыХранилища);
	ИмяФайлаИндексов = РеквизитыВерсии.ПутьКФайламПроектаВерсии + "DumpFilesIndex.txt";

	ТаблицаИндексов = ПрочитатьТаблицуИндексов(ИмяФайлаИндексов);
	ТаблицаИндексов.Сортировать("Уровень, ПолноеИмя");
	
	ДатаСоздания = Формат(РеквизитыВерсии.ДатаСоздания, "ДФ='yyyy-MM-dd HH:mm:ss'");
	Пользователь = РеквизитыВерсии.Пользователь;
	Email = РеквизитыВерсии.Email;

	Если НЕ ЗначениеЗаполнено(Email) ИЛИ СтрНайти(Email, "@") = 0 Тогда

		Email = "anonimous@localhost";

	КонецЕсли;

	ТекстКоманды = СтрЗаменить(?(ЭтоWindowsСервер, "set ", "export ")
		+ "GIT_AUTHOR_DATE=""%Дата%""", "%Дата%", ДатаСоздания);
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	ТекстКоманды = СтрЗаменить(?(ЭтоWindowsСервер, "set ", "export ")
		+ "GIT_COMMITTER_DATE=""%Дата%""", "%Дата%", ДатаСоздания);
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	ТекстКоманды = СтрЗаменить(?(ЭтоWindowsСервер, "set ", "export ")
		+ "GIT_AUTHOR_NAME=""%Пользователь%""", "%Пользователь%", Пользователь);
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	ТекстКоманды = СтрЗаменить(?(ЭтоWindowsСервер, "set ", "export ")
		+ "GIT_COMMITTER_NAME=""%Пользователь%""", "%Пользователь%", Пользователь);
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	ТекстКоманды = СтрЗаменить(?(ЭтоWindowsСервер, "set ", "export ")
		+ "GIT_AUTHOR_EMAIL=""<%email%>""", "%email%", Email);
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	ТекстКоманды = СтрЗаменить(?(ЭтоWindowsСервер, "set ", "export ")
		+ "GIT_COMMITTER_EMAIL=""<%email%>""", "%email%", Email);
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	
	ЕстьПереименования = Ложь;
	ЕстьУдаления = Ложь;
		
	// Обрабатываем переименования 
	Если ЗначениеЗаполнено(ПредыдущаяВерсия) И НЕ РеквизитыВерсии.ВыгруженыТолькоИзменения Тогда
		// Явное переименование всех файлов, если переименовывается папка, 
		// необходимо учесть переименование подчиненных папок
		
		ИменаРеквизитов = Новый Структура("КаталогВременныхФайлов, Состояние, ЛокальныйКаталогGit, ИмяПроектаEDT",
			"КаталогВременныхФайлов",
			"Состояние", 
			"Владелец.ЛокальныйКаталогGit",
			"Владелец.ИмяПроектаEDT");
		РеквизитыПредыдущейВерсии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПредыдущаяВерсия, ИменаРеквизитов);
		
		Если РеквизитыПредыдущейВерсии.Состояние = Перечисления.СостоянияВерсии.ЗагруженаВEDT Тогда
			РеквизитыПредыдущейВерсии.Вставить("КаталогИсходниковEDT", ПутьКФайламПроектаВерсии(РеквизитыПредыдущейВерсии));
			ИмяФайлаИндексов = РеквизитыПредыдущейВерсии.КаталогИсходниковEDT + "DumpFilesIndex.txt";
		ИначеЕсли РеквизитыПредыдущейВерсии.Состояние = Перечисления.СостоянияВерсии.ПомещенаВGit Тогда
			ИмяФайлаИндексов = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(
				РеквизитыПредыдущейВерсии.ЛокальныйКаталогGit) 
				+ КаталогФайловПроектаВРепозитории(РеквизитыПредыдущейВерсии) 
				+ "DumpFilesIndex.txt";
		Иначе
			ВызватьИсключение Нстр("ru = 'Формирование файла невозможно для версии со статусом ""Начало коммита""';", 
				Метаданные.ОсновнойЯзык.КодЯзыка);
		КонецЕсли;
		
		Файл = Новый Файл(ИмяФайлаИндексов);
		Если НЕ Файл.Существует() И РеквизитыПредыдущейВерсии.Состояние = Перечисления.СостоянияВерсии.ЗагруженаВEDT Тогда
			Возврат;
		КонецЕсли;
		ТаблицаИндексовПредыдущейВерсии = ПрочитатьТаблицуИндексов(ИмяФайлаИндексов);
		ТаблицаИндексовПредыдущейВерсии.Сортировать("Уровень, UUID");
		
		// Индексы для поиска неизмененных файлов
		ТаблицаИндексовПредыдущейВерсии.Индексы.Добавить("Уровень, UUID");
		
		ТекстыКомандПереименования = Новый Массив; // Массив из Строка -
		
		Для Каждого СтрокаТЧ Из ТаблицаИндексов Цикл
			Отбор = Новый Структура();
			Отбор.Вставить("Уровень", СтрокаТЧ.Уровень);
			Отбор.Вставить("UUID",    СтрокаТЧ.UUID);
			
			НайденныеСтроки = ТаблицаИндексовПредыдущейВерсии.НайтиСтроки(Отбор);
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
				Если НайденнаяСтрока.ХешПолногоИмени <> СтрокаТЧ.ХешПолногоИмени Тогда
					// Добавляем переименование файлов

					// Создаем все кататалоги
					Если ЭтоWindowsСервер Тогда
						ТекстКоманды = "mkdir ""%Приемник%""" + ВыводЛога;
					Иначе
						ТекстКоманды = "mkdir -p ""%Приемник%""" + ВыводЛога;
					КонецЕсли;
					ДиректорияПриемника = ПрефиксКаталогаИсходников + СтрокаТЧ.ПолноеИмя;
					МассивПутей = СтрРазделить(ДиректорияПриемника, ПолучитьРазделительПути());
					МассивПутей.Удалить(МассивПутей.ВГраница());
					ДиректорияПриемника = СтрСоединить(МассивПутей, ПолучитьРазделительПути());
					ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", ДиректорияПриемника);
					ТекстыКомандПереименования.Добавить(ТекстКоманды);

					ТекстКоманды = "git mv -f %Источник% %Приемник%" + ВыводЛога;

					ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", ПрефиксКаталогаИсходников
						+ НайденнаяСтрока.ПолноеИмя);
					ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", ПрефиксКаталогаИсходников
						+ СтрокаТЧ.ПолноеИмя);

					ТекстыКомандПереименования.Добавить(ТекстКоманды);
					ЕстьПереименования = Истина;
					
				КонецЕсли;
				ТаблицаИндексовПредыдущейВерсии.Удалить(НайденнаяСтрока);

			КонецЦикла;

		КонецЦикла;
		
		// Все что не найдено - помечаем на удаление
		Для Каждого СтрокаТЧ Из ТаблицаИндексовПредыдущейВерсии Цикл
			ТекстКоманды = "git rm -f %Источник%" + ВыводЛога;
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", ПрефиксКаталогаИсходников
				+ СтрокаТЧ.ПолноеИмя);
			ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
			ЕстьУдаления = Истина;
		КонецЦикла;
		
		Если ЕстьУдаления Тогда
			ТекстКоманды = "git commit -F ""%ИмяФайлКомментария%"" --allow-empty-message --cleanup=verbatim" + ВыводЛога;
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ИмяФайлКомментария%", ИмяФайлКомментария);
			ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		КонецЕсли;
		
		// Переименования вставляются после удаления т.к. могут быть конфликты,
		// если новое имя при переименовании совпадает с объектом, который удаляется
		Для Каждого ТекстКоманды из ТекстыКомандПереименования Цикл
			ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		КонецЦикла;
		
		Если ЕстьПереименования Тогда
			ТекстКоманды = "git commit -F ""%ИмяФайлКомментария%"" --allow-empty-message --cleanup=verbatim" + ВыводЛога;
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ИмяФайлКомментария%", ИмяФайлКомментария);
			ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		КонецЕсли;
		
	КонецЕсли;
	
	МассивПутейПриемника = СтрРазделить(РеквизитыХранилища.ПутьКПроекту, ПолучитьРазделительПути(), Ложь);
	МассивПутейИсточника = СтрРазделить(РеквизитыВерсии.КаталогПроектаEDT, ПолучитьРазделительПути(), Ложь);

	// Для ускорения перемещаем исходные файлы если они на одном диске
	// А если на другом - позже скопируем файлы рекурсивно
	Если НРег(МассивПутейИсточника[0]) = НРег(МассивПутейПриемника[0]) Тогда

		Если ЭтоWindowsСервер Тогда
			
			// Если выгрузка только изменений - тогда обновляем существующие файлы
			Если НЕ РеквизитыВерсии.ВыгруженыТолькоИзменения Тогда
				ТекстКоманды = "rmdir /S /Q ""%Приемник%""" + ВыводЛога;
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", РеквизитыХранилища.ПутьКФайламПроекта);
				ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
			КонецЕсли;
			
			Если РеквизитыВерсии.ВыгруженыТолькоИзменения Тогда
				// Для изменений используется копирование с заменой
				Источник = СокрЛП(РеквизитыВерсии.ПутьКФайламПроектаВерсии);
				Если Прав(Источник, 1) = ПолучитьРазделительПути() Тогда
					Источник = Лев(Источник, СтрДлина(Источник) - 1);
				КонецЕсли;
				Приемник = СокрЛП(РеквизитыХранилища.ПутьКФайламПроекта);
				Если Прав(Приемник, 1) = ПолучитьРазделительПути() Тогда
					Приемник = Лев(Приемник, СтрДлина(Приемник) - 1);
				КонецЕсли;
				ТекстКоманды = "robocopy ""%Источник%"" ""%Приемник%"" /E /MOVE /NFL /NDL /NJH /NJS /NC /NS /NP" + ВыводЛога;
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", Источник);
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", Приемник);
				ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
			Иначе
				// Для полной выгрузки - команда перемещения
				ТекстКоманды = "for /d %%A in (""%Источник%*"") do IF EXIST ""%Приемник%%%~nxA"" ( robocopy ""%%~A"" ""%Приемник%%%~nxA"" /E /MOVE /NFL /NDL /NJH /NJS /NC /NS /NP) ELSE ( move /y ""%%~A"" ""%Приемник%"" )" + ВыводЛога;
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", РеквизитыВерсии.КаталогПроектаEDT);
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", РеквизитыХранилища.ПутьКПроекту);
				ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
				ТекстКоманды = "move /y ""%Источник%*"" ""%Приемник%""" + ВыводЛога;
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", РеквизитыВерсии.КаталогПроектаEDT);
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", РеквизитыХранилища.ПутьКПроекту);
				ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
			КонецЕсли;
		Иначе
			Если НЕ РеквизитыВерсии.ВыгруженыТолькоИзменения Тогда
				// При конвертации в формате EDT удаляем все каталоги, в том числе и служебные DT-INF, .settings
				ТекстКоманды = "for i in ""%Источник%""{.[!.],}*; do test -d ""$i"" && rm -rf ""%Приемник%$(basename $i)""; done";
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", РеквизитыВерсии.КаталогПроектаEDT);
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", РеквизитыХранилища.ПутьКПроекту);
				ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
			КонецЕсли;
			
			Если НЕ РеквизитыВерсии.ВыгруженыТолькоИзменения Тогда
				ТекстКоманды = "mkdir -p ""%Приемник%""" + ВыводЛога;
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", РеквизитыХранилища.ПутьКПроекту);
				ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
			КонецЕсли;
			
			ТекстКоманды = "mv -f ""%Источник%""{.[!.],}* ""%Приемник%""" + ВыводЛога;
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", РеквизитыВерсии.КаталогПроектаEDT);
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", РеквизитыХранилища.ПутьКПроекту);
			ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		КонецЕсли;

	КонецЕсли;
	
	// Все файлы новой версии добавляем в индекс
	ТекстКоманды = "git add --all ./" + ВыводЛога;
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	
	ТекстКоманды = "git commit -F ""%ИмяФайлКомментария%"" --allow-empty-message --cleanup=verbatim" + ВыводЛога;

	Комментарий = СформироватьТекстКомментария(РеквизитыВерсии);

	ФайлКомментария = Новый ТекстовыйДокумент;
	ФайлКомментария.УстановитьТекст(Комментарий);
	ФайлКомментария.Записать(ИмяФайлКомментария, "CESU-8");

	ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ИмяФайлКомментария%", ИмяФайлКомментария);
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);

	// Выполнение регламентных действий с репозиторием, если необходимо
	ТекстКоманды = "git gc --auto" + ВыводЛога;
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);

	Если ЭтоWindowsСервер Тогда
		ФайлКоманды.Записать(ИмяФайлаКомандыGit, "CESU-8");
	Иначе
		ФайлКоманды.Записать(ИмяФайлаКомандыGit, КодировкаТекста.Системная, Символы.ПС);
	КонецЕсли;
	
КонецПроцедуры



// Возвращаемое значение:
// 	Структура:
// * ИмяПроектаEDT - Строка
// * Ссылка - СправочникСсылка.ВерсииХранилища - Ссылка на помещаемую версию в репозиторий
// * Код - Число - Код помещаемой версии
// * КаталогВременныхФайлов - Строка - Каталог временных файлов версии
// * Комментарий - Строка - Комментарий версии из Хранилища 1С
// * ДатаСоздания - Дата - Дата создания версии
// * Пользователь - Строка - Имя пользователя Git-репозитория
// * Email - Строка - E-mail пользователя Git-репозитория
// * ПользовательХранилища - Строка - Имя пользователя Хранилища 1С
// * КоличествоМетаданных - Число - Количество метаданных в версии
// * ВыгруженыТолькоИзменения - Булево - Признак частичной выгрузки изменений версии
// * КаталогПроектаEDT - Строка - Путь ко временному каталогу проекта в формате EDT
// * ПутьКФайламПроектаВерсии - Строка - Путь ко временному каталогу файлов исходников (.../src/)
// * ИмяФайлаЛога - Строка - Путь к файлу логов текущей версии
Функция ПараметрыВерсииДляКоммита()
	
	ПараметрыВерсии = Новый Структура("Ссылка, Код, КаталогВременныхФайлов, Комментарий, ДатаСоздания, 
		| Пользователь, Email, ПользовательХранилища, КоличествоМетаданных, ВыгруженыТолькоИзменения, ИмяПроектаEDT");
	Возврат ПараметрыВерсии;
	
КонецФункции


// Параметры:
// 	Хранилище - СправочникСсылка.ХранилищаКонфигураций - 
// Возвращаемое значение:
// 	Структура:
// 	* ПутьКПроекту - Строка - Полный путь к каталогу проекта, находящемуся в репозитории
// 	* ПутьКФайламПроекта - Строка - Полный путь каталогу исходных файлов проекта в репозитории (.../src/)
// 	* ВерсияВGit - СправочникСсылка.ВерсииХранилища - ссылка на помещенную версию, записанную в элементе объекта хранилища.
// 	* Код - Число - Код помещенной версии
// 	* ДобавлятьМеткиСВерсиейКонфигурации - Булево - Признак добавления меток с версией конфигурации
// 	* АдресРепозиторияGit - Строка - адрес Git-сервера
// 	* ИмяВетки - Строка - Имя ветки в Git-репозитории
// 	* ЛокальныйКаталогGit - Строка - Локальный путь к каталогу репозитория Git
// 	* КаталогВыгрузкиВерсий - Строка
// 	* МинимальноеКоличествоМетаданных - Число
// 	* КоличествоКоммитов - Число
// 	* ОтключитьЛогирование - Булево
// 	* РазрешитьПомещатьАнонимноЕслиНеНайденПользователь - Булево
// 	* ИмяПроектаEDT - Строка
// 	* ВыгружатьИзменения - Булево
// 	* ДобавлятьМеткиСВерсиейКонфигурации - Булево
// 
Функция ПараметрыХранилищаДляКоммита(Знач Хранилище)
	
	ИменаРеквизитов = Новый Структура("ВерсияВGit, Код, ЛокальныйКаталогGit, КаталогВыгрузкиВерсий, АдресРепозиторияGit, 
		| ИмяВетки, МинимальноеКоличествоМетаданных, КоличествоКоммитов, ОтключитьЛогирование,
		| РазрешитьПомещатьАнонимноЕслиНеНайденПользователь, ИмяПроектаEDT, ВыгружатьИзменения,
		| ДобавлятьМеткиСВерсиейКонфигурации", 
		"ВерсияВGit", 
		"ВерсияВGit.Код");
	РеквизитыХранилища = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Хранилище, ИменаРеквизитов);
	
	// Путь к проекту в репозитории /path_to_git/Project/
	РеквизитыХранилища.Вставить("ПутьКПроекту", ПутьКПроекту(РеквизитыХранилища));
	// Путь к файлам конфигурации проекта в репозитории /path_to_git/Project/src/
	РеквизитыХранилища.Вставить("ПутьКФайламПроекта", ПутьКФайламПроекта(РеквизитыХранилища));
	
	Возврат РеквизитыХранилища;
	
КонецФункции



// Выполняются действия перед коммитом версии, перед запуском командного файла, выполняющего копирование 
// файлов версии в каталог репозитория и последующим коммитом изменений. Этот метод можно дополнять в 
// подключаемых расширениях для реализации дополнительной логики после выполнения коммита 
// в локальный репозиторий.
// 
// Параметры:
// 	ПараметрыВерсии - См. ПараметрыВерсииДляКоммита
// 	РеквизитыХранилища - См. ПараметрыХранилищаДляКоммита
// Возвращаемое значение:
// 	Булево - Истина, если действия выполнены успешно, Ложь - если необходимо прервать коммит версии.
Функция ВыполнитьДействияПередКоммитом(ПараметрыВерсии, РеквизитыХранилища)

	Если ЗначениеЗаполнено(РеквизитыХранилища.АдресРепозиторияGit) И ЗначениеЗаполнено(РеквизитыХранилища.ВерсияВGit) Тогда
		ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
		ДобавлятьМетки = ?(РеквизитыХранилища.ДобавлятьМеткиСВерсиейКонфигурации, "--tags", "");
		
		ТекстКоманды = "git pull %ДобавлятьМетки%";
		Если ПараметрыВерсии.Свойство("ИмяФайлаЛога") И ЗначениеЗаполнено(ПараметрыВерсии.ИмяФайлаЛога) Тогда
			ТекстКоманды = ТекстКоманды + " >> ""%ФайлЛога%"" 2>&1";
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ФайлЛога%", ПараметрыВерсии.ИмяФайлаЛога);
		КонецЕсли;
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ДобавлятьМетки%", ДобавлятьМетки);
		
		ДобавитьЗаписьВЛог(ПараметрыВерсии, НСтр("ru='Начало получения коммитов с Git-сервера'"));
		
		КодВозврата = Неопределено;
		ЗапуститьПриложение(?(ЭтоWindowsСервер, "cmd /C ", "bash -c ")
			+ ТекстКоманды, РеквизитыХранилища.ЛокальныйКаталогGit, Истина, КодВозврата);
		
		ДобавитьЗаписьВЛог(ПараметрыВерсии, НСтр("ru='Окончание получения коммитов с Git-сервера'"), "Код возврата: "
			+ ?(КодВозврата = Неопределено, "Неопределено", КодВозврата));

		Если КодВозврата <> Неопределено И КодВозврата <> 0 Тогда
			ДобавитьЗаписьВЛог(ПараметрыВерсии, НСтр("ru='Окончание получения коммитов с Git-сервера'"), НСтр("ru='Получение коммитов (git pull) с Git-сервера выполнен не успешно. Необходимо проанализировать лог, устранить причину.'"));
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыХранилища.ДобавлятьМеткиСВерсиейКонфигурации Тогда
		Возврат ДобавитьМеткуСНомеромСборки(ПараметрыВерсии, РеквизитыХранилища)
	КонецЕсли;
	
	Возврат Истина;
КонецФункции


// Выполняются действия после коммита. Если установлен адрес Git-сервера, то выполняется отправка коммитов 
// на сервер. Этот метод можно дополнять в подключаемых расширениях для реализации дополнительной логики 
// после выполнения коммита в локальный репозиторий.
// 
// Параметры:
// 	ПараметрыВерсии - См. ПараметрыВерсииДляКоммита
// 	РеквизитыХранилища - См. ПараметрыХранилищаДляКоммита
// Возвращаемое значение:
// 	Булево - Истина, если действия выполнены успешно, Ложь - если необходимо прервать дальнейшую обработку.
Функция ВыполнитьДействаияПослеКоммита(ПараметрыВерсии, РеквизитыХранилища)
	
	Если ЗначениеЗаполнено(РеквизитыХранилища.АдресРепозиторияGit)
		И ЗначениеЗаполнено(РеквизитыХранилища.ВерсияВGit) Тогда
		ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
		ДобавлятьМетки = ?(РеквизитыХранилища.ДобавлятьМеткиСВерсиейКонфигурации, "--tags", "");
		
		ТекстКоманды = "git push --progress %ДобавлятьМетки% -u origin %ИмяВетки%";
		Если ПараметрыВерсии.Свойство("ИмяФайлаЛога") И ЗначениеЗаполнено(ПараметрыВерсии.ИмяФайлаЛога) Тогда
			ТекстКоманды = ТекстКоманды + " >> ""%ФайлЛога%"" 2>&1";
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ФайлЛога%", ПараметрыВерсии.ИмяФайлаЛога);
		КонецЕсли;
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ИмяВетки%", РеквизитыХранилища.ИмяВетки);
		
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ДобавлятьМетки%", ДобавлятьМетки);
		
		ДобавитьЗаписьВЛог(ПараметрыВерсии, НСтр("ru='Начало отправки коммитов на Git-сервер'"));
		
		КодВозврата = Неопределено;
		ЗапуститьПриложение(?(ЭтоWindowsСервер, "cmd /C ", "bash -c ")
			+ ТекстКоманды, РеквизитыХранилища.ЛокальныйКаталогGit, Истина, КодВозврата);
		
		ДобавитьЗаписьВЛог(ПараметрыВерсии, НСтр("ru='Окончание отправки коммитов на Git-сервер'"), "Код возврата: "
			+ ?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
		
		Если КодВозврата <> Неопределено И КодВозврата <> 0 Тогда
			ДобавитьЗаписьВЛог(ПараметрыВерсии, НСтр("ru='Окончание отправки коммитов на Git-сервер'"),
				НСтр("ru='Отправка коммитов (git push) на Git-сервер выполнен не успешно. Необходимо проанализировать лог, устранить причину и вручную завершить git push.'"));
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции


// Добавляет метку с версией конфигурации, если в следующем коммите меняется номер версии. 
// 
// Параметры:
// 	ПараметрыВерсии - Структура - Параметры версии:
// * Ссылка - СправочникСсылка.ВерсииХранилища - Ссылка на помещенную версию в репозиторий
// * Код - Число - Код помещенной версии
// * Комментарий - Строка - Комментарий версии из Хранилища 1С
// * ДатаСоздания - Дата - Дата создания версии
// * Пользователь - Строка - Имя пользователя Git-репозитория
// * Email - Строка - E-mail пользователя Git-репозитория
// * ПользовательХранилища - Строка - Имя пользователя Хранилища 1С
// * КоличествоМетаданных - Число - Количество метаданных в версии
// * ВыгруженыТолькоИзменения - Булево - Признак частичной выгрузки изменений версии
// * КаталогПроектаEDT - Строка - Путь ко временному каталогу проекта в формате EDT
// * ПутьКФайламПроектаВерсии - Строка - Путь ко временному каталогу файлов исходников (.../src/)
// * ИмяФайлаЛога - Строка - Путь к файлу логов текущей версии
// 	РеквизитыХранилища - Структура - Параметры хранилища:
// * ПутьКПроекту - Строка - Полный путь к каталогу проекта, находящемуся в репозитории
// * ПутьКФайламПроекта - Строка - Полный путь каталогу исходных файлов проекта в репозитории (.../src/)
// * ВерсияВGit - СправочникСсылка.ВерсииХранилища - ссылка на помещенную версию, записанную в элементе объекта хранилища.
// * Код - Число - Код помещенной версии
// * ДобавлятьМеткиСВерсиейКонфигурации - Булево - Признак добавления меток с версией конфигурации
// * АдресРепозиторияGit - Строка - адрес Git-сервера
// * ИмяВетки - Строка - Имя ветки в Git-репозитории
// Возвращаемое значение:
// 	Булево - Истина, если действия выполнены успешно, Ложь - если необходимо прервать дальнейшую обработку.
Функция ДобавитьМеткуСНомеромСборки(ПараметрыВерсии, РеквизитыХранилища)
	
	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
	ПутьНоваяВерсия = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПараметрыВерсии.ПутьКФайламПроектаВерсии 
	                                                + "Configuration") + "Configuration.mdo";
	ПутьТекущаяВерсия = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(РеквизитыХранилища.ПутьКФайламПроекта 
	                                                + "Configuration") + "Configuration.mdo";
	
	ФайлНоваяВерсия = Новый Файл(ПутьНоваяВерсия);
	ФайлТекущаяВерсия = Новый Файл(ПутьТекущаяВерсия);
	
	Если Не ФайлНоваяВерсия.Существует() ИЛИ Не ФайлТекущаяВерсия.Существует() Тогда
		Возврат Истина;
	КонецЕсли;
	
	НомерНовойВерсии = ПолучитьНомерКонфигурации(ПутьНоваяВерсия);
	НомерТекущейВерсии = ПолучитьНомерКонфигурации(ПутьТекущаяВерсия);
	
	Если НомерНовойВерсии = НомерТекущейВерсии Тогда
		Возврат Истина;
	КонецЕсли;
	
	МеткаСВерсией = СформироватьИмяМеткиВерсии(ПараметрыВерсии, РеквизитыХранилища, НомерТекущейВерсии);
	ПутьВременныхФайлов = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПараметрыВерсии.КаталогВременныхФайлов);
	ПутьФайлаПроверкиМетки = ПутьВременныхФайлов + "taginfo.txt";
	
	// Проверка существования метки с версией
	ТекстКоманды = "git tag -l ""%МеткаСВерсией%"" > ""%ПутьФайлаПроверкиМетки%"" 2>&1";
	ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ПутьФайлаПроверкиМетки%", ПутьФайлаПроверкиМетки);
	ТекстКоманды = СтрЗаменить(ТекстКоманды, "%МеткаСВерсией%", МеткаСВерсией);
	
	ДобавитьЗаписьВЛог(ПараметрыВерсии, СтрШаблон(НСтр("ru='Начало проверки существования метки с номером: %1'"), МеткаСВерсией));
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(?(ЭтоWindowsСервер, "cmd /C ", "bash -c ")
		+ ТекстКоманды, РеквизитыХранилища.ЛокальныйКаталогGit, Истина, КодВозврата);
	
	ДобавитьЗаписьВЛог(ПараметрыВерсии, СтрШаблон(НСтр("ru='Конец проверки существования метки с номером: %1'"), МеткаСВерсией), "Код возврата: "
	+ ?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
	
	Если КодВозврата <> Неопределено И КодВозврата <> 0 Тогда
		ДобавитьЗаписьВЛог(ПараметрыВерсии, СтрШаблон(НСтр("ru='Окончание проверки существования метки с номером: %1'"), МеткаСВерсией),
			НСтр("ru='Проверка существования метки прошла неуспешно. Необходимо проанализировать лог и устранить причину.'"));
		Возврат Ложь;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ПутьФайлаПроверкиМетки);
	Текст = СокрЛП(ТекстовыйДокумент.ПолучитьТекст());
	Если Текст <> "" Тогда
		// Метка уже существует, 
		ДобавитьЗаписьВЛог(ПараметрыВерсии, СтрШаблон(НСтр("ru='Метка с номером: %1 уже существует'"), МеткаСВерсией));
		Возврат Истина
	КонецЕсли;
	
	// Добавление метки
	ДобавитьЗаписьВЛог(ПараметрыВерсии, СтрШаблон(НСтр("ru='Начало добавления метки: %1'"), МеткаСВерсией));
	
	ТекстКоманды = "git tag -a ""%МеткаСВерсией%"" -m ""%МеткаСВерсией%""";
	Если ПараметрыВерсии.Свойство("ИмяФайлаЛога") И ЗначениеЗаполнено(ПараметрыВерсии.ИмяФайлаЛога) Тогда
		ТекстКоманды = ТекстКоманды + " >> ""%ФайлЛога%"" 2>&1";
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ФайлЛога%", ПараметрыВерсии.ИмяФайлаЛога);
	КонецЕсли;
	ТекстКоманды = СтрЗаменить(ТекстКоманды, "%МеткаСВерсией%", МеткаСВерсией);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(?(ЭтоWindowsСервер, "cmd /C ", "bash -c ")
		+ ТекстКоманды, РеквизитыХранилища.ЛокальныйКаталогGit, Истина, КодВозврата);
	
	ДобавитьЗаписьВЛог(ПараметрыВерсии, СтрШаблон(НСтр("ru='Конец добавления метки: %1'"), МеткаСВерсией), "Код возврата: "
		+ ?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
	
	Если КодВозврата <> Неопределено И КодВозврата <> 0 Тогда
		ДобавитьЗаписьВЛог(ПараметрыВерсии, СтрШаблон(НСтр("ru='Окончание добавления метки: %1'"), МеткаСВерсией),
			НСтр("ru='Добавление метки прошло неуспешно. Необходимо проанализировать лог и устранить причину.'"));
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина
	
КонецФункции

// Формирует имя метки с версией
// 
// Параметры:
// 	ПараметрыВерсии - Структура - Параметры версии:
// * Ссылка - СправочникСсылка.ВерсииХранилища - Ссылка на помещенную версию в репозиторий
// * Код - Число - Код помещенной версии
// * Комментарий - Строка - Комментарий версии из Хранилища 1С
// * ДатаСоздания - Дата - Дата создания версии
// * Пользователь - Строка - Имя пользователя Git-репозитория
// * Email - Строка - E-mail пользователя Git-репозитория
// * ПользовательХранилища - Строка - Имя пользователя Хранилища 1С
// * КоличествоМетаданных - Число - Количество метаданных в версии
// * ВыгруженыТолькоИзменения - Булево - Признак частичной выгрузки изменений версии
// * КаталогПроектаEDT - Строка - Путь ко временному каталогу проекта в формате EDT
// * ПутьКФайламПроектаВерсии - Строка - Путь ко временному каталогу файлов исходников (.../src/)
// * ИмяФайлаЛога - Строка - Путь к файлу логов текущей версии
// 	РеквизитыХранилища - Структура - Параметры хранилища:
// * ПутьКПроекту - Строка - Полный путь к каталогу проекта, находящемуся в репозитории
// * ПутьКФайламПроекта - Строка - Полный путь каталогу исходных файлов проекта в репозитории (.../src/)
// * ВерсияВGit - СправочникСсылка.ВерсииХранилища - ссылка на помещенную версию, записанную в элементе объекта хранилища.
// * Код - Число - Код помещенной версии
// * ДобавлятьМеткиСВерсиейКонфигурации - Булево - Признак добавления меток с версией конфигурации
// * АдресРепозиторияGit - Строка - адрес Git-сервера
// * ИмяВетки - Строка - Имя ветки в Git-репозитории
// 	НомерВерсии - Строка - Номер версии конфигурации
// Возвращаемое значение:
// 	Строка - Истина, если действия выполнены успешно, Ложь - если необходимо прервать дальнейшую обработку.
Функция СформироватьИмяМеткиВерсии(ПараметрыВерсии, РеквизитыХранилища, НомерВерсии)
	Возврат "v" + НомерВерсии;
КонецФункции


// Возвращает версию конфигурации из файла Configuration.mdo   
// 
// Параметры:
// 	ИмяФайлаКонфигурации - Строка - Полный путь до файла Configuration.mdo   
// Возвращаемое значение:
//  Строка, Неопределено - Версия конфигурации, Неопределено - если не удалось прочитать Configuration.mdo
// 
Функция ПолучитьНомерКонфигурации(ИмяФайлаКонфигурации)
	
	НомерКонфигурации = Неопределено;
	Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяФайлаКонфигурации);
		
		Если ЧтениеXML.Прочитать() И СтрНачинаетсяС(ЧтениеXML.Имя, "mdclass:Configuration") Тогда
			
			Пока ЧтениеXML.Прочитать() И ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
				
				Если ЧтениеXML.Имя = "version" Тогда
					ЧтениеXML.Прочитать();
					НомерКонфигурации = ЧтениеXML.Значение;
					ЧтениеXML.Пропустить();
				Иначе
					ЧтениеXML.Пропустить();
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		ЧтениеXML.Закрыть();
		
	Исключение
	КонецПопытки;
	
	Возврат НомерКонфигурации
	
КонецФункции

// Формирование текста комменатрия для коммита в репозиторий. 
// Функция может быть переопределена в расширении для кастомизации текста.
// 
// Параметры:
// 	РеквизитыВерсии - Структура - Параметры версии:
// 	 * Ссылка - СправочникСсылка.ВерсииХранилища - Ссылка на версию хранилища
//   * Комментарий - Строка - комменатрий из хранилища, может быть пустым
//   * ДатаСоздания - Дата - дата создания версии в хранилище
//   * Пользователь - Строка - Пользователь Git
//   * Email - Строка - e-mail пользователя Git
//   * Код - Число - Номер версии в хранилище
//   * ПользовательХранилища - Строка - Пользователь хранилища
//   * ВыгруженыТолькоИзменения - Булево - Признак выгрузки изменений или полная выгрузка
// Возвращаемое значение:
// 	Строка - Текст комментария
// 	
Функция СформироватьТекстКомментария(РеквизитыВерсии)

	ТекстКомментария = "%Комментарий%
		|//------
		| Версия хранилища №%НомерВерсии% от %Дата% %Автор%";
	
	ТекстКомментария = СтрЗаменить(ТекстКомментария, "%НомерВерсии%", Формат(РеквизитыВерсии.Код, "ЧДЦ=; ЧГ=0"));
	ТекстКомментария = СтрЗаменить(ТекстКомментария, "%Дата%", Формат(РеквизитыВерсии.ДатаСоздания, "ДФ='yyyy-MM-dd HH:mm:ss'"));
	ТекстКомментария = СтрЗаменить(ТекстКомментария, "%Автор%", РеквизитыВерсии.ПользовательХранилища);
	
	Если Не ЗначениеЗаполнено(РеквизитыВерсии.Комментарий) Тогда
		ТекстКомментария = СтрЗаменить(ТекстКомментария, "%Комментарий%", "<Комментарий не указан>");
	Иначе
		ТекстКомментария = СтрЗаменить(ТекстКомментария, "%Комментарий%", РеквизитыВерсии.Комментарий);
	КонецЕсли;

	Возврат ТекстКомментария;

КонецФункции

// Формирует полный путь к каталогу проекта в репозитории
// 
// Параметры:
// 	РеквизитыХранилища - Структура - Реквизиты хранилища
// Возвращаемое значение:
// 	Строка - полный путь к каталогу проекта в репозитории
Функция ПутьКПроекту(РеквизитыХранилища)
	
	Путь = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(РеквизитыХранилища.ЛокальныйКаталогGit);
	Если НЕ ПустаяСтрока(РеквизитыХранилища.ИмяПроектаEDT) Тогда
		Путь = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(
			Путь + РеквизитыХранилища.ИмяПроектаEDT);
	КонецЕсли;
	
	Возврат Путь;
	
КонецФункции

// Формирует полный путь к каталогу файлов конфигурации в репозитории
// 
// Параметры:
// 	РеквизитыХранилища - Структура - Реквизиты хранилища
// Возвращаемое значение:
// 	Строка - полный путь к файлам конфиурации в репозитории
Функция ПутьКФайламПроекта(РеквизитыХранилища)
	
	Путь = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(РеквизитыХранилища.ЛокальныйКаталогGit);
	Возврат Путь + КаталогФайловПроектаВРепозитории(РеквизитыХранилища);
	
КонецФункции

// Формирует относительный путь к каталогу файлов проекта в репозитории
// 
// Параметры:
// 	РеквизитыХранилища - Структура - Реквизиты хранилища
// Возвращаемое значение:
// 	Строка - путь к каталогу выгрузки
Функция КаталогФайловПроектаВРепозитории(РеквизитыХранилища) Экспорт
	
	ПрефиксКаталогаИсходников = "";
	Если НЕ ПустаяСтрока(РеквизитыХранилища.ИмяПроектаEDT) Тогда
		ПрефиксКаталогаИсходников = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(
			ПрефиксКаталогаИсходников + РеквизитыХранилища.ИмяПроектаEDT);
	КонецЕсли;
	ПрефиксКаталогаИсходников = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(
		ПрефиксКаталогаИсходников + "src");
	
	Возврат ПрефиксКаталогаИсходников;
	
КонецФункции

// Формирует полный путь к каталогу проекта версии
// 
// Параметры:
// 	ПараметрыВерсии - Структура - Параметры версии
// Возвращаемое значение:
// 	Строка - путь к каталогу проекта версии
Функция КаталогПроектаEDT(ПараметрыВерсии)

	Путь = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПараметрыВерсии.КаталогВременныхФайлов);

	Путь = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Путь + "p");
	СегментыПути = СтрРазделить(ПараметрыВерсии.ИмяПроектаEDT, ПолучитьРазделительПути());
	Если СегментыПути.Количество() > 0 Тогда
		Путь = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Путь + СегментыПути[СегментыПути.ВГраница()]);
	КонецЕсли;

	Возврат Путь;

КонецФункции

// Формирует полный путь к каталогу файлов конфигурации версии внутри каталога проекта
// 
// Параметры:
// 	ПараметрыВерсии - Структура - Параметры версии
// Возвращаемое значение:
// 	Строка - путь к каталогу файлов конфигурации версии
Функция ПутьКФайламПроектаВерсии(ПараметрыВерсии)
	
	Путь = КаталогПроектаEDT(ПараметрыВерсии);
	Путь = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Путь+ "src");
	
	Возврат Путь;
КонецФункции

// Формирует путь к каталогу выгрузки файлов конфигурации в формате xml 1С:Предприятия
// 
// Параметры:
// 	КаталогВременныхФайлов - Строка - Каталог временных файлов версии
// Возвращаемое значение:
// 	Строка - путь к каталогу выгрузки файлов конфигурации версии
Функция КаталогВыгрузкиВXML(Знач КаталогВременныхФайлов)
	
	Каталог = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(КаталогВременныхФайлов);
	Каталог = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Каталог + "dump");
	
	Возврат Каталог;
	
КонецФункции

// Добавляет запись в лог из пакетной операции
// 
// Параметры:
// 	Параметры - Структура - параметры запуска, состоящие из:
// 	  * ИмяФайлаЛога - Строка - Путь к файлу лога
// 	ТекстЛога - Строка - текст лога
// 	Комментарий - Строка - комментарий
// 	Уровень - Строка - уровень записи журнала регистрации
Процедура ДобавитьЗаписьВЛог(Параметры, ТекстЛога, Комментарий = "",
		Уровень = Неопределено)

	Если Уровень = Неопределено Тогда
		Уровень = "Информация";
	КонецЕсли;

	ДобавитьЗаписьВЖурналРегистрации(НСтр("ru = 'Пакетная операция'"), Уровень, , ТекстЛога, Комментарий);

	Если Параметры.Свойство("ИмяФайлаЛога") И ЗначениеЗаполнено(Параметры.ИмяФайлаЛога) Тогда
		Лог = Новый ЗаписьТекста();
		Лог.Открыть(Параметры.ИмяФайлаЛога, КодировкаТекста.UTF8, , Истина);
		Лог.ЗаписатьСтроку(Строка(ТекущаяДатаСеанса()) + " " + ТекстЛога);
		Если ЗначениеЗаполнено(Комментарий) Тогда
			Лог.ЗаписатьСтроку(Комментарий);
		КонецЕсли;
		Лог.Закрыть();
	КонецЕсли;

КонецПроцедуры

// Зачитывает результат из файла результатов пакетной операции Конфигуратора
// 
// Параметры:
// 	ИмяФайлаРезультатов - Строка - Имя файла результатов пакетной операции
// Возвращаемое значение:
// 	Число - Возвращается 0, если результат успешный (0 ошибок), 99999 если файл результата пустой, 
//  возвращается 100000 если ошибка чтения файла или в файле содержатся не числовые символы, N произвольное 
//  число, означающее наличие ошибок
Функция ПрочитатьФайлРезультата(ИмяФайлаРезультатов)
	
	Результат = 1;
	ФайлРезультата = Новый ТекстовыйДокумент();
	Попытка
		ФайлРезультата.Прочитать(ИмяФайлаРезультатов);
		ТекстРезультата = ФайлРезультата.ПолучитьТекст();
		Если ПустаяСтрока(ТекстРезультата) Тогда
			Результат = 99999;
		ИначеЕсли СокрЛП(ТекстРезультата) = "0" Тогда
			Результат = 0;
		Иначе
			Результат = Число(ТекстРезультата);
		КонецЕсли;
		
	Исключение
		Результат = 100000;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Копирует файлы рекурсивно
// 
// Параметры:
// 	Приемник - Строка - Описание
// 	Источник - Строка - Описание
Процедура СкопироватьФайлыРекурсивно(Источник, Приемник)

	Файлы = НайтиФайлы(Источник, "*");
	Для Каждого Файл Из Файлы Цикл
		ИмяПриемника = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Приемник)
			+ Файл.Имя;
		Если Файл.ЭтоКаталог() Тогда
			СоздатьКаталог(ИмяПриемника);
			СкопироватьФайлыРекурсивно(Файл.ПолноеИмя, ИмяПриемника);
		ИначеЕсли Файл.ЭтоФайл() Тогда
			КопироватьФайл(Файл.ПолноеИмя, ИмяПриемника);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Возвращает считанную из файла таблицу индексов
// 
// Параметры:
// 	ИмяФайлаИндексов - Строка - Полный путь к файлу индексов
// Возвращаемое значение:
// 	См. СозадатьТаблицуИндексов
Функция ПрочитатьТаблицуИндексов(ИмяФайлаИндексов)
	
	ТаблицаИндексов = СозадатьТаблицуИндексов();
	
	Файл = Новый Файл(ИмяФайлаИндексов);
	Если Не Файл.Существует() Тогда
		Возврат ТаблицаИндексов;
	КонецЕсли;
	
	Файл = Новый ЧтениеТекста();
	Файл.Открыть(ИмяФайлаИндексов, КодировкаТекста.UTF8);
	
	СледующаяСтрока = Файл.ПрочитатьСтроку(Символы.ПС);
	
	Пока СледующаяСтрока <> Неопределено Цикл
		
		ТекущаяСтрока = СледующаяСтрока;
		СледующаяСтрока = Файл.ПрочитатьСтроку(Символы.ПС);
		
		Если НЕ ПустаяСтрока(ТекущаяСтрока) Тогда
			МассивСтрок = СтрРазделить(ТекущаяСтрока, ":");
			Если МассивСтрок.Количество() = 4 Тогда
				UUID = МассивСтрок[0];
				ХешПолногоИмени = МассивСтрок[1];
				Попытка
					Уровень = Число(МассивСтрок[2]);
				Исключение
					Продолжить;
				КонецПопытки;
				ПолноеИмя = МассивСтрок[3];
				Если Уровень = 0 ИЛИ ПустаяСтрока(UUID) ИЛИ ПустаяСтрока(ХешПолногоИмени) ИЛИ ПустаяСтрока(ПолноеИмя) Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ТаблицаИндексов.Добавить();
				НоваяСтрока.UUID = UUID;
				НоваяСтрока.ХешПолногоИмени = ХешПолногоИмени;
				НоваяСтрока.Уровень = Уровень;
				НоваяСтрока.ПолноеИмя = ПолноеИмя;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Файл.Закрыть();
	
	Возврат ТаблицаИндексов;
	
КонецФункции


// Создает таблицу индексов структуры метаданных
// 
// Возвращаемое значение:
// 	ТаблицаЗначений - Таблица индексов:
// * UUID - Строка
// * ХешПолногоИмени - Строка
// * Уровень - Число
// * ПолноеИмя - Строка
Функция СозадатьТаблицуИндексов()
	
	КС = Новый КвалификаторыСтроки(240);
	ОписаниеТипаСтроки240 = Новый ОписаниеТипов("Строка", , КС);
	
	КС = Новый КвалификаторыСтроки(32);
	ОписаниеТипаСтроки32 = Новый ОписаниеТипов("Строка", , КС);
	
	ТаблицаИндексов = Новый ТаблицаЗначений();
	
	ТаблицаИндексов.Колонки.Добавить("UUID", ОписаниеТипаСтроки240);
	ТаблицаИндексов.Колонки.Добавить("ХешПолногоИмени", ОписаниеТипаСтроки32);
	ТаблицаИндексов.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
	ТаблицаИндексов.Колонки.Добавить("ПолноеИмя", Новый ОписаниеТипов("Строка"));
	
	Возврат ТаблицаИндексов;
	
КонецФункции

// Сохраняет табилцу индексов
// 
// Параметры:
// 	Таблица - См. СозадатьТаблицуИндексов
// 	ИмяФайлаИндексов - Строка - имя файла индексов
Процедура ЗаписатьТаблицуИндексов(Таблица, ИмяФайлаИндексов)
	
	Файл = Новый ЗаписьТекста();
	Файл.Открыть(ИмяФайлаИндексов, КодировкаТекста.UTF8);

	Таблица.Сортировать("Уровень, ПолноеИмя");
	
	Для Каждого СтрокаТЧ Из Таблица Цикл
		
		МассивСтрок = Новый Массив();
		МассивСтрок.Добавить(СтрокаТЧ.UUID);
		МассивСтрок.Добавить(СтрокаТЧ.ХешПолногоИмени);
		МассивСтрок.Добавить(Строка(СтрокаТЧ.Уровень));
		МассивСтрок.Добавить(СтрокаТЧ.ПолноеИмя);

		СтрокаИндекса = СтрСоединить(МассивСтрок, ":");
		Файл.ЗаписатьСтроку(СтрокаИндекса, Символы.ПС);
		
	КонецЦикла;
	
	Файл.Закрыть();
	
КонецПроцедуры

Процедура СоздатьКаталогиВИерерахии(Знач ПутьККаталогу)
	
	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
	
	МассивКаталогов = СтрРазделить(ПутьККаталогу, ПолучитьРазделительПути(), Ложь);
	ПутьККаталогу = Лев(ПутьККаталогу, Найти(ПутьККаталогу, ПолучитьРазделительПути()));
	Если ЭтоWindowsСервер 
		И МассивКаталогов.Количество() > 1 
		И СтрНайти(МассивКаталогов[0], ":") > 0 
		ИЛИ СтрДлина(ПутьККаталогу) > СтрДлина(ПолучитьРазделительПути()) Тогда
		МассивКаталогов.Удалить(0);
	КонецЕсли;
	
	Для Каждого ИмяКаталога Из МассивКаталогов Цикл
		ПутьККаталогу = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПутьККаталогу + ИмяКаталога);
		Файл = Новый Файл(ПутьККаталогу);
		Если Не Файл.Существует() Тогда
			СоздатьКаталог(ПутьККаталогу);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьКаталогЦеликом(Знач КаталогПриемник, Знач КаталогИсточник)
	КаталогВыгруженныхРасширенныхФайловВыгрузки = КаталогИсточник;
	ПозицияВСтрокеРабочегоКаталога = СтрДлина(КаталогВыгруженныхРасширенныхФайловВыгрузки) + 1;
	
	КаталогРасширенныхФайловВыгрузки = КаталогПриемник;
	СоздатьКаталог(КаталогРасширенныхФайловВыгрузки);
	
	НайденныеРасширенныеФайлыКорня = НайтиФайлы(КаталогВыгруженныхРасширенныхФайловВыгрузки, "*.*", Истина);
	Для Каждого РасширенныйФайлКорняИсточник Из НайденныеРасширенныеФайлыКорня Цикл
		ИтоговоеИмя = КаталогРасширенныхФайловВыгрузки + Сред(РасширенныйФайлКорняИсточник.ПолноеИмя, 
			ПозицияВСтрокеРабочегоКаталога);
			
		Если РасширенныйФайлКорняИсточник.ЭтоКаталог() Тогда
			СоздатьКаталог(ИтоговоеИмя);
		Иначе
			КопироватьФайл(РасширенныйФайлКорняИсточник.ПолноеИмя, ИтоговоеИмя);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Выгружает объекты конфигурации по списку в каталог с указанным суффиксом.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//   ИменаОбъектовМетаданных - Строка
//   Суффикс - Строка - Постфикс каталога. Не должен содержать запрещенных для файлов символов
//
// Возвращаемое значение:
//   Строка - Каталог выгрузки
//
Функция ВыгрузитьОбъектыВКаталог(Контекст, ИменаОбъектовМетаданных, Суффикс)
	Контекст2 = ОбщегоНазначения.СкопироватьСтруктуру(Контекст);
	Контекст2.КаталогВыгрузкиВXML = Контекст.КаталогВременныхФайлов + "dump_" + Суффикс + ПолучитьРазделительПути();
	
	ФайлСписка = Контекст.КаталогВременныхФайлов + "export_object_" + Суффикс + ".txt";
	СтроковыеФункции.СтрокаВФайл(ИменаОбъектовМетаданных, ФайлСписка, КодировкаТекста.UTF8);
	
	ОбщегоНазначения.УдалитьФайлИлиКаталог(Контекст2.КаталогВыгрузкиВXML);
	ВыгрузитьКонфигурациюВФайлы(Контекст2, Ложь, ФайлСписка, Ложь);
	
	Возврат Контекст2.КаталогВыгрузкиВXML;
КонецФункции

#Область Лог

// Записывает событие в журнале регистрации и в файле лога.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//   Уровень - Число, УровеньЖурналаРегистрации - Уровень критичности события.
//       1 соответствует уровню УровеньЖурналаРегистрации.Ошибка.
//       2 соответствует уровню УровеньЖурналаРегистрации.Предупреждение.
//       3 соответствует уровню УровеньЖурналаРегистрации.Информация.
//       4 соответствует уровню УровеньЖурналаРегистрации.Примечание.
//   Текст - Строка, ИнформацияОбОшибке - Текст или информация об ошибке для записи в журнал.
//   ИмяСобытия - Строка, Неопределено - Тип события.
//
Процедура ЗаписатьВЛогВерсии(Контекст, Уровень, Текст, Знач ИмяСобытия = Неопределено, Знач Процент = Неопределено)
	Если ИмяСобытия = Неопределено Тогда
		ИмяСобытия = ИмяСобытияВерсииДляЖурнала(Контекст);
	КонецЕсли;
	ОбщегоНазначения.ЗаписатьВЛог(Контекст.ИмяФайлаЛога, Уровень, ИмяСобытия, Текст, , Процент);
КонецПроцедуры

// Возвращает имя события для записи в журнал регистрации или лог.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяСобытияВерсииДляЖурнала(Контекст) Экспорт
	Если ЗначениеЗаполнено(Контекст.Состояние) Тогда
		Возврат СтрШаблон("ru='Конвертация хранилища. %1'", Строка(Контекст.Состояние));
	Иначе
		Возврат "ru='Конвертация хранилища'";
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецОбласти
