///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// @strict-types

////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции общего назначения для "Конвертации хранилища в Git"
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбработчикиЗаданий

// Запускается из РегламентныеЗадания.КонвертацияХранилища.
//   Строит отчет по коммитам в хранилище 1С и заполняет список версий.
//   Запускает задания по коммитам в гит и получению CF.
//
// Параметры:
//  Хранилище - СправочникСсылка.ХранилищаКонфигураций
//
Процедура ВыполнитьКонвертацию(Знач Хранилище) Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Хранилище) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		РегистрыСведений.СостоянияХранилищ.ЗаписатьНачалоОбработки(Хранилище);
		
		ПараметрыХранилища = ПараметрыХранилища(Хранилище);
		
		Таблица = Справочники.ВерсииХранилища.СостоянияПодготавливаемыхВерсий(ПараметрыХранилища);
		
		// Получение списка новых коммитов в хранилище 1С с учетом установленных ограничений хранилища.
		Если ПараметрыХранилища.ПоследняяВерсия = 0
			И Таблица.Количество() < ПараметрыХранилища.МаксимальноеКоличествоПодготавливаемыхВерсий Тогда
			ПостроитьОтчетПоХранилищуИЗаполнитьСписокВерсий(Хранилище, ПараметрыХранилища);
			Таблица = Справочники.ВерсииХранилища.СостоянияПодготавливаемыхВерсий(ПараметрыХранилища);
		КонецЕсли;
		
		// Запуск коммитов в Git.
		Если ПараметрыХранилища.ВыполнятьКоммиты Тогда
			Фильтр = Новый Структура("ВозниклаОшибка, Состояние", Ложь, Перечисления.СостоянияВерсии.ЗагруженаВEDT);
			ВерсииДляПомещенияВGit = Таблица.НайтиСтроки(Фильтр);
			Если ВерсииДляПомещенияВGit.Количество() > 0 Тогда
				ЗапуститьКоммитыВФоне(Хранилище);
			КонецЕсли;
		КонецЕсли;
		
		// Получение CF.
		ВерсииДляПолученияВБазу = Таблица.НайтиСтроки(Новый Структура("ВозниклаОшибка, Состояние", Ложь, Перечисления.СостоянияВерсии.ПустаяСсылка()));
		Для Каждого СтрокаТаблицы Из ВерсииДляПолученияВБазу Цикл
			Если ПолучитьВерсиюХранилищаВБазу(Хранилище, СтрокаТаблицы.Ссылка) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		РегистрыСведений.СостоянияХранилищ.ЗаписатьУспешноеЗавершениеОбработки(Хранилище);
		
	Исключение
		
		РегистрыСведений.СостоянияХранилищ.ЗарегистрироватьОшибку(Хранилище, ИнформацияОбОшибке());
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Запускается из РегламентныеЗадания.ОбработкаОчереди.
//   Для очередей типа ВыгрузкаВXML находятся версии в состоянии ПолученCF и запускается выгрузка в XML.
//   Для очередей типа ЗагрузкаВEDT находятся версии в состоянии ВыгруженаВXML и запускается загрузка в EDT.
//
// Параметры:
//   Очередь - СправочникСсылка.ОчередиВыполнения
//
Процедура ОбработатьОчередь(Знач Очередь) Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	ИменаРеквизитов =
	"Хранилище, Операция, МаксимальноеКоличествоОпераций, ПрефиксНачалаНомераВерсии, ПрефиксОкончанияНомераВерсии";
	РеквизитыОчереди = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Очередь, ИменаРеквизитов);
	
	Если РеквизитыОчереди.Операция = Перечисления.ОперацииОчереди.ВыгрузкаВXML Тогда
		СостояниеДоНачала = Перечисления.СостоянияВерсии.ПолученCF;
	ИначеЕсли РеквизитыОчереди.Операция = Перечисления.ОперацииОчереди.ЗагрузкаВEDT Тогда
		СостояниеДоНачала = Перечисления.СостоянияВерсии.ВыгруженаВXML;
	Иначе
		Возврат;
	КонецЕсли;
	
	МаксимальноеКоличествоОпераций = РеквизитыОчереди.МаксимальноеКоличествоОпераций;
	Выполнено = 0;
	
	Если ЗначениеЗаполнено(РеквизитыОчереди.Хранилище) Тогда
		
		// Обработка очереди конкретного хранилища.
		Пока Истина Цикл
			
			// После обработки очередной версии:
			// - Конвертация может быть остановлена.
			// - Параметры хранилища могут измениться.
			// - Состояния версий могут измениться.
			Если Константы.КонвертацияОстановлена.Получить() Тогда
				Возврат;
			КонецЕсли;
			ПараметрыХранилища = ПараметрыХранилища(РеквизитыОчереди.Хранилище);
			ПараметрыВерсии = ВыбратьВерсиюДляОбработки(ПараметрыХранилища, СостояниеДоНачала, ПараметрыВерсии);
			Если ПараметрыВерсии = Неопределено Тогда
				Возврат;
			КонецЕсли;
			Выполнено = Выполнено + 1;
			ДлительныеОперации.СообщитьПрогресс(10, НСтр("ru = 'Обработка версии в очереди:'") + " " + Выполнено);
			Если РеквизитыОчереди.Операция = Перечисления.ОперацииОчереди.ВыгрузкаВXML Тогда
				ВыгрузитьВерсиюВXML(ПараметрыВерсии, ПараметрыХранилища);
			ИначеЕсли РеквизитыОчереди.Операция = Перечисления.ОперацииОчереди.ЗагрузкаВEDT Тогда
				ЗагрузитьВерсиюВEDT(ПараметрыВерсии, ПараметрыХранилища);
			КонецЕсли;
			Если МаксимальноеКоличествоОпераций > 0 И Выполнено >= МаксимальноеКоличествоОпераций Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		// Обработка общей очереди.
		ОтборПоХранилищам = Новый Структура("ЗапретитьИспользованиеОбщихОчередей", Ложь);
		ЗапросПоХранилищам = Справочники.ХранилищаКонфигураций.ЗапросПоЭлементам(ОтборПоХранилищам);
		ВыборкаХранилищ = ЗапросПоХранилищам.Выполнить().Выбрать();
		Пока ВыборкаХранилищ.Следующий() Цикл
			
			// После обработки очередной версии:
			// - Конвертация может быть остановлена.
			// - Параметры хранилища могут измениться.
			// - Состояния версий могут измениться.
			Если Константы.КонвертацияОстановлена.Получить() Тогда
				Возврат;
			КонецЕсли;
			ПараметрыХранилища = ПараметрыХранилища(ВыборкаХранилищ.Ссылка);
			ПараметрыВерсии = ВыбратьВерсиюДляОбработки(ПараметрыХранилища, СостояниеДоНачала, ПараметрыВерсии);
			Если ПараметрыВерсии = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Выполнено = Выполнено + 1;
			Если РеквизитыОчереди.Операция = Перечисления.ОперацииОчереди.ВыгрузкаВXML Тогда
				ВыгрузитьВерсиюВXML(ПараметрыВерсии, ПараметрыХранилища);
			ИначеЕсли РеквизитыОчереди.Операция = Перечисления.ОперацииОчереди.ЗагрузкаВEDT Тогда
				ЗагрузитьВерсиюВEDT(ПараметрыВерсии, ПараметрыХранилища);
			КонецЕсли;
			Если МаксимальноеКоличествоОпераций > 0 И Выполнено >= МаксимальноеКоличествоОпераций Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Запускается из РегламентныеЗадания.ВыгрузкаВерсииИзКопииХранилища. Получает CF из копии хранилища.
//   Копии хранилищ используются только как "еще один" источник CF для снижения нагрузки на основное хранилище.
//     Нумерация коммитов в копии должна сопадать с оригиналом. Но может быть урезана по сравнению с основным.
//     Например, в период начала конвертации необходимо получить множество коммитов.
//     Основное хранилище копируют на быстрый диск сервера с гитконвертером.
//     За счет чего, скорость получения CF увеличивается в разы, а сетевая нагрузка с основного хранилища снимется.
//
// Параметры:
//   Копия - СправочникСсылка.КопииХранилищКонфигурации
//
Процедура ВыгрузитьВерсиюИзКопииХранилища(Знач Копия) Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Копия) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКопии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Копия, "Владелец, ПерваяВерсия, ПоследняяВерсия");
	
	ПараметрыХранилища = ПараметрыХранилища(ПараметрыКопии.Владелец);
	
	Если ПараметрыКопии.ПерваяВерсия > 0 Тогда
		ПараметрыХранилища.ПерваяВерсия = ПараметрыКопии.ПерваяВерсия;
	КонецЕсли;
	Если ПараметрыКопии.ПоследняяВерсия > 0 Тогда
		ПараметрыХранилища.ПоследняяВерсия = ПараметрыКопии.ПоследняяВерсия;
	КонецЕсли;
	
	Таблица = Справочники.ВерсииХранилища.СостоянияПодготавливаемыхВерсий(ПараметрыХранилища);
	
	ВерсииДляПолученияВБазу = Таблица.НайтиСтроки(Новый Структура("ВозниклаОшибка, Состояние", Ложь, Перечисления.СостоянияВерсии.ПустаяСсылка()));
	Для Каждого СтрокаТаблицы Из ВерсииДляПолученияВБазу Цикл
		Если ПолучитьВерсиюХранилищаВБазу(Копия, СтрокаТаблицы.Ссылка) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Запускается из РегламентныеЗадания.ОчисткаОтМусора.
// В целях оптимизации работы файловой системы массовое удаление выполняется в одном потоке регламентного задания.
//
Процедура ОчисткаОтМусора() Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МаксимальноеКоличествоОшибокВерсии = МаксимальноеКоличествоОшибокВерсии();
	
	СброситьСостоянияВерсийСОшибками(МаксимальноеКоличествоОшибокВерсии);
	
	ОчиститьВерсииПослеКоммитов();
	
	ЗавершитьЗависшиеПроцессы(МаксимальноеКоличествоОшибокВерсии);
	
КонецПроцедуры

// Запускается при записи версии - при необходимости очистки ее каталога. Дожидается снятия объектной блокировки
//   (завершения записи версии), получает объект и перезаписывает версию. При записи каталог версии очищается
//   в той же процедуре, из которой вызывался данный метод - в процедуре ПередЗаписьюВерсииОчиститьКаталогПриНеобходимости.
//
// Параметры:
//   ВерсияХранилища - СправочникСсылка.ВерсииХранилища
//
Процедура ДождатьсяОкончанияЗаписиВерсииИОчиститьКаталог(Знач ВерсияХранилища) Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	ДопСвойства = Новый Структура("ОчищатьКаталогВерсииВТекущемСеансе", Истина);
	Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(ВерсияХранилища, Новый Структура, ДопСвойства);
КонецПроцедуры

#КонецОбласти

#Область ЗапускФоновыхЗаданий

// Запускает выполнение коммитов в фоне, с проверкой что такое задание еще не запущено.
//
// Параметры:
//   Хранилище - СправочникСсылка.ХранилищаКонфигураций
//
Процедура ЗапуститьКоммитыВФоне(Знач Хранилище) Экспорт
	
	ОбщегоНазначения.ВыполнитьВФоне(
		Строка(Хранилище.УникальныйИдентификатор()),
		"КонвертацияХранилища.ВыполнитьКоммиты",
		СтрШаблон(НСтр("ru = 'Коммит в хранилище %1'"), Хранилище),
		Хранилище);
	
КонецПроцедуры

// Запускает фоновую операцию по версии.
//
// Параметры:
//   Очередь - СправочникСсылка.ОчередиВыполнения
//
Процедура ЗапуститьОбработкуОчередиВФоне(Очередь) Экспорт
	
	ОбщегоНазначения.ВыполнитьВФоне(
		Строка(Очередь.УникальныйИдентификатор()),
		"КонвертацияХранилища.ОбработатьОчередь",
		СтрШаблон(НСтр("ru = 'Обработка очереди: %1'"), Очередь),
		Очередь);
	
КонецПроцедуры

#КонецОбласти

// Выполняет коммиты хранилища в Git
// 
// Параметры:
// 	Хранилище - СправочникСсылка.ХранилищаКонфигураций - Ссылка на хранилище, по которому выполняются коммиты
Процедура ВыполнитьКоммиты(Знач Хранилище) Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	ПараметрыХранилища = ПараметрыХранилища(Хранилище);
	Если Не ПараметрыХранилища.ВыполнятьКоммиты Тогда
		Возврат;
	КонецЕсли;
	ОбщегоНазначения.ПроверитьКаталогСуществует(ПараметрыХранилища.ЛокальныйКаталогGit);
	
	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
	
	ПредыдущаяВерсия = ПараметрыХранилища.ВерсияВGit; // Текущая версия в Git.
	РеквизитыПредыдущейВерсии = Справочники.ВерсииХранилища.ПараметрыВерсии(ПредыдущаяВерсия);
	Если Не ЗначениеЗаполнено(ПредыдущаяВерсия) Тогда
		РеквизитыПредыдущейВерсии.Код = 0;
	КонецЕсли;
	ВыполненоКоммитов = 0;
	МаксимумКоммитов = ?(ПараметрыХранилища.КоличествоКоммитов = 0, 1000, ПараметрыХранилища.КоличествоКоммитов);
	
	Пока Истина Цикл
		
		Если Константы.КонвертацияОстановлена.Получить() Тогда
			Возврат;
		КонецЕсли;
		ВыполненоКоммитов = ВыполненоКоммитов + 1;
		Если ВыполненоКоммитов > МаксимумКоммитов Тогда
			Возврат; // Достигнуто предельное количество коммитов за сеанс.
		КонецЕсли;
		ПомещаемаяВерсия = Справочники.ВерсииХранилища.СледующаяВерсия(Хранилище, РеквизитыПредыдущейВерсии.Код);
		Если ПомещаемаяВерсия = Неопределено Или ПомещаемаяВерсия.ВозниклаОшибка Тогда
			Возврат; // Конвертация закончена, а в случае ошибки - ждем сборщика мусора или действий администратора.
		КонецЕсли;
		
		Попытка
			Если ПомещаемаяВерсия.Состояние = Перечисления.СостоянияВерсии.ПомещенаВGit Тогда
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'В свойствах хранилища в качестве версии в Git указана версия %1, однако следующая за ней версия %2 тоже отмечена как помещенная в Git.
						|Следует сопоставить историю Git и состояния версий.
						|Возможно, потребуется исправить поле ""%3"" в реквизитах хранилища,
						|либо исправить состояние версии в списке версий,
						|либо откатить историю в Git.'"),
					РеквизитыПредыдущейВерсии.Код,
					ПомещаемаяВерсия.Код,
					Метаданные.Справочники.ХранилищаКонфигураций.Реквизиты.ВерсияВGit.Представление());
				// Текст ошибки будет записан в обработчике исключения.
				Если РеквизитыПредыдущейВерсии.Код + 1 < ПомещаемаяВерсия.Код Тогда
					ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Разница более чем в 2 версии. Это критичная ошибка, конвертация остановлена.'");
					Справочники.ВерсииХранилища.ОстановитьКонвертацию(ПомещаемаяВерсия.Ссылка);
				КонецЕсли;
				ВызватьИсключение ТекстОшибки; // Ошибка: Версии помещаются в одном потоке, но данная версия была перехвачена други потоком.
			КонецЕсли;
			Если ПомещаемаяВерсия.Состояние <> Перечисления.СостоянияВерсии.ЗагруженаВEDT Тогда
				Возврат; // Больше нет версий, готовых к помещению в Git.
			КонецЕсли;
			Если Не Справочники.ВерсииХранилища.НачатьОбработкуВерсии(
					ПомещаемаяВерсия.Ссылка,
					ПомещаемаяВерсия,
					Перечисления.СостоянияВерсии.ЗагруженаВEDT,
					Перечисления.СостоянияВерсии.ПомещаетсяВGit) Тогда
				Возврат; // По какой-то причине версия перестала быть готовой к помещению в Git.
			КонецЕсли;
			
			Контекст = КонтекстРаботыСВерсией(ПомещаемаяВерсия, ПараметрыХранилища);
			ДополнитьКонтекстПараметрамиКоммитаВGit(Контекст);
			
			Контекст.КаталогGitПроектаEDT = ОбщегоНазначения.ПолноеИмяКаталога(Контекст.КаталогGitПроектаEDT, Истина, Истина);
			Контекст.ВерсияКонфигурации = ВерсияКонфигурации(Контекст);
			
			ОбщегоНазначения.ПроверитьКаталогСуществует(Контекст.КаталогИсходниковEDT);
			Если Не ЗначениеЗаполнено(Контекст.ПользовательEMail)
				И Не Контекст.РазрешитьПомещатьАнонимноЕслиНеНайденПользователь Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Невозможно выполнить коммит версии %1 в Git, т.к. в %2 отсутствует информация об авторе коммита %3.'"),
					Контекст.Код,
					"РегистрСведений.ИнформацияПользователей",
					Контекст.Пользователь);
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
			ОбщегоНазначения.УдалитьФайлИлиКаталог(Контекст.ФайлЛогаGit);
			ЗаписатьФайлыКоммитаВерсии(Контекст, РеквизитыПредыдущейВерсии);
			
			ФайлКонфигурации = Контекст.КаталогИсходниковEDT + "Configuration" + ПолучитьРазделительПути() + "Configuration.mdo";
			Если Не ОбщегоНазначения.ФайлСуществует(ФайлКонфигурации) И Не Контекст.ВыгруженыТолькоИзменения Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Невозможно выполнить коммит версии %1 в Git, т.к. отсутствует файл %2.'"),
					Контекст.Код,
					ФайлКонфигурации);
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
			// Когда предыдущая версия помещена в Git, то ее таблица индексов заполнена.
			// В случае частичной выгрузки таблицу индексов можно получить из таблицы индексов предыдущей версии,
			// применив к ней изменения текущей версии.
			Если Контекст.ВыгруженыТолькоИзменения Тогда
				ИмяФайлаИндексов = Контекст.КаталогИсходниковEDT + "DumpFilesIndex.txt";
				ТаблицаИндексов = ПрочитатьТаблицуИндексов(ИмяФайлаИндексов);
				ИмяФайлаИндексовПредыдущейВерсии = ПараметрыХранилища.КаталогGitИсходниковEDT + "DumpFilesIndex.txt";
				ТаблицаИндексовПредыдущейВерсии = ПрочитатьТаблицуИндексов(ИмяФайлаИндексовПредыдущейВерсии);
				Для Каждого СтрокаТЧ Из ТаблицаИндексов Цикл
					Отбор = Новый Структура();
					Отбор.Вставить("Уровень", СтрокаТЧ.Уровень);
					Отбор.Вставить("UUID",    СтрокаТЧ.UUID);
					
					НайденныеСтроки = ТаблицаИндексовПредыдущейВерсии.НайтиСтроки(Отбор);
					Если НайденныеСтроки.Количество() = 0 Тогда
						НоваяСтрока = ТаблицаИндексовПредыдущейВерсии.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
					КонецЕсли;
				КонецЦикла;
				ЗаписатьТаблицуИндексов(ТаблицаИндексовПредыдущейВерсии, ИмяФайлаИндексов);
				Контекст.КоличествоМетаданных = ТаблицаИндексовПредыдущейВерсии.Количество();
			КонецЕсли;
			
			ВыполнитьДействияПередКоммитом(Контекст, РеквизитыПредыдущейВерсии);
			
			ЗаписатьВЛог(Контекст, 3, "ru='Коммит в репозиторий Git: Начало'");
			КодВозврата = Неопределено;
			Команда = ?(ЭтоWindowsСервер, "", "bash ") + Контекст.ФайлКомандыGit;
			ЗапуститьПриложение(Команда, Контекст.ЛокальныйКаталогGit, Истина, КодВозврата);
			ТекстЛога = СтрШаблон("ru='Коммит в репозиторий Git: Завершение. Код возврата: %1.'",
				?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
			ЗаписатьВЛог(Контекст, 3, ТекстЛога);
			Если КодВозврата <> Неопределено И КодВозврата <> 0 Тогда
				ВызватьИсключениеПриОбработкеВерсии(Контекст);
				Возврат;
			КонецЕсли;
			
			ЗаписатьВЛог(Контекст, 3, "ru='Получение хеш-суммы коммита Git: Начало'");
			КодВозврата = Неопределено;
			ИмяФайлаХеша = ПолучитьИмяВременногоФайла("txt");
			ТекстКоманды = "git rev-parse HEAD > " + ИмяФайлаХеша;
			ЗапуститьПриложение(?(ЭтоWindowsСервер, "cmd /C ", "") + ТекстКоманды, 
				Контекст.ЛокальныйКаталогGit, Истина, КодВозврата);
			Контекст.Хеш = СтроковыеФункции.СтрокаИзФайла(ИмяФайлаХеша);
			ТекстЛога = СтрШаблон("ru='Получение хеш-суммы коммита Git: Завершение. Код возврата: %1.'",
				?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
			ЗаписатьВЛог(Контекст, 3, ТекстЛога);
			
			Если НЕ ВыполнитьДействияПослеКоммита(Контекст) Тогда
				Возврат;
			КонецЕсли;
			
			ЗначенияРеквизитов = Новый Структура;
			ЗначенияРеквизитов.Вставить("Состояние", Перечисления.СостоянияВерсии.ПомещенаВGit);
			ЗначенияРеквизитов.Вставить("Хеш", Контекст.Хеш);
			ЗначенияРеквизитов.Вставить("КоличествоМетаданных", Контекст.КоличествоМетаданных);
			ДопСвойства = Новый Структура("ПараметрыХранилища", ПараметрыХранилища);
			Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(Контекст.Ссылка, ЗначенияРеквизитов, ДопСвойства);
			
			Объект = Хранилище.ПолучитьОбъект();
			Объект.ВерсияВGit = Контекст.Ссылка;
			Объект.Записать();
			
			ПараметрыХранилища.ВерсияВGit = Контекст.Ссылка;
			РеквизитыПредыдущейВерсии = Контекст;
		Исключение
			Справочники.ВерсииХранилища.ВозниклаОшибка(ПомещаемаяВерсия.Ссылка, ИнформацияОбОшибке());
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Выгружает версию в XML (при необходимости) и загружает в EDT (при необходимости).
//
// Параметры:
//   ВерсияХранилища - СправочникСсылка.ВерсииХранилища - Ссылка на версию хранилища.
//
Процедура ВыгрузитьВерсиюВXMLИЗагрузитьВEDT(Знач ВерсияХранилища) Экспорт
	
	ПараметрыВерсии = Справочники.ВерсииХранилища.ПараметрыВерсии(ВерсияХранилища);
	ПараметрыХранилища = ПараметрыХранилища(ПараметрыВерсии.Владелец);
	
	// Выгружаем версию в файлы
	ВыгрузитьВерсиюВXML(ПараметрыВерсии, ПараметрыХранилища);
	
	// Загружает файлы конфигурации версии в проект EDT и составляет индекс для переименований в Git-е
	ЗагрузитьВерсиюВEDT(ПараметрыВерсии, ПараметрыХранилища);
	
КонецПроцедуры

// Выгружает конфигурацию из базы 1С в файлы XML формата 1С:Предприятие.
//
// Параметры:
//   ПараметрыХранилища - Структура - См. КонвертацияХранилища.ПараметрыХранилища.
//   ПараметрыВерсии - Структура - См. Справочники.ВерсииХранилища.ПараметрыВерсии.
//
Процедура ВыгрузитьВерсиюВXML(ПараметрыВерсии, ПараметрыХранилища) Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	Если Не Справочники.ВерсииХранилища.НачатьОбработкуВерсии(
			ПараметрыВерсии.Ссылка,
			ПараметрыВерсии,
			Перечисления.СостоянияВерсии.ПолученCF,
			Перечисления.СостоянияВерсии.ВыгружаетсяВXML) Тогда
		Возврат;
	КонецЕсли;
	Попытка
		
		Контекст = КонтекстРаботыСВерсией(ПараметрыВерсии, ПараметрыХранилища);
		
		ЗаписатьВЛог(Контекст, 3, "ru='Выгрузка версии из базы в xml'", , 5);
		
		ОбщегоНазначения.УдалитьФайлИлиКаталог(Контекст.КаталогВыгрузкиВXML);
		СоздатьКаталог(Контекст.КаталогВыгрузкиВXML);
		
		Контекст.Вставить("СтрокаСоединенияИБ", "/F """ + Контекст.КаталогИБ + """");
		Контекст.Вставить("ИмяПользователяИБ", "");
		Контекст.Вставить("ПарольПользователяИБ", "");
		Контекст.Вставить("ФайлИзменений", Контекст.КаталогВременныхФайлов + "diff.txt");
		Контекст.Вставить("ФайлСостоянияПредыдущейВерсии", Контекст.КаталогВременныхФайлов + "PreviousState.xml");
		
		Контекст.ВыгруженыТолькоИзменения = Ложь;
		Если Не ТребуетсяПолнаяВыгрузкаВерсииВXML(ПараметрыВерсии, ПараметрыХранилища) Тогда
			ФайлНайденИСкопирован = СкопироватьФайлСостоянияПредыдущейВерсии(Контекст, Контекст.ФайлСостоянияПредыдущейВерсии);
			Если ФайлНайденИСкопирован Тогда
				// Выгрузка XML по изменениям.
				ВыгрузитьКонфигурациюВФайлы(Контекст, Истина, "", Ложь);
				// Проверка наличия файлов XML.
				ТекстОшибки = ТекстОшибкиЕслиКаталогВыгрузкиXMLПустой(Контекст);
				Если ЗначениеЗаполнено(ТекстОшибки) Тогда
					// Если в хранилище 2 версии с одинаковым состоянием ConfigDumpInfo, значит выгрузки изменений не произошло
					// и требуется полная выгрузка.
					ЗаписатьПричинуПолнойВыгрузкиВXML(Контекст, ТекстОшибки);
					ЗаписатьВЛог(Контекст, 1, ТекстОшибки);
				Иначе
					Контекст.ВыгруженыТолькоИзменения = Истина;
					// Довыгрузка свойств корня и языков.
					ДовыгрузитьКореньВерсииВXML(Контекст);
					// Получение списка изменений.
					ВыгрузитьКонфигурациюВФайлы(Контекст, Ложь, "", Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Не Контекст.ВыгруженыТолькоИзменения Тогда // Требуется полная выгрузка.
			ВыгрузитьКонфигурациюВФайлы(Контекст, Ложь, "", Ложь);
			ТекстОшибки = ТекстОшибкиЕслиКаталогВыгрузкиXMLПустой(Контекст);
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				ЗаписатьВЛог(Контекст, 1, ТекстОшибки);
				ВызватьИсключениеПриОбработкеВерсии(Контекст);
			КонецЕсли;
		КонецЕсли;
		
		Контекст.ВерсияКонфигурации = ВерсияКонфигурации(Контекст);
		
		ИмяФайлаИсточника = Контекст.КаталогВыгрузкиВXML + "ConfigDumpInfo.xml";
		ИмяФайлаПриемника = Контекст.КаталогВременныхФайлов + "ConfigDumpInfo.xml";
		ОбщегоНазначения.УдалитьФайлИлиКаталог(ИмяФайлаПриемника);
		Если ОбщегоНазначения.ФайлСуществует(ИмяФайлаИсточника) Тогда
			КопироватьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника);
			ОбщегоНазначения.УдалитьФайлИлиКаталог(ИмяФайлаИсточника);
		КонецЕсли;
		
		Если Контекст.ВыгруженыТолькоИзменения Тогда
			ТекстИзменений = СтроковыеФункции.СтрокаИзФайла(Контекст.ФайлИзменений, КодировкаТекста.UTF8);
			Если НРег(СокрЛП(ТекстИзменений)) = "fulldump" Тогда
				Контекст.ВыгруженыТолькоИзменения = Ложь;
				ЗаписатьПричинуПолнойВыгрузкиВXML(Контекст, НСтр("ru = 'Платформа сама так решила (fulldump в файле изменений)'"));
			КонецЕсли;
			Если Контекст.ВыгруженыТолькоИзменения Тогда
				ЗаписатьВЛог(Контекст, 3, "ru='Анализ частичной выгрузки для конвертации в EDT'", , 50);
				ОбъектыДовыгрузки = ПолучитьСписокОбъектовДовыгрузки(ТекстИзменений, ИмяФайлаПриемника);
				Если ОбъектыДовыгрузки.Количество() > 0 Тогда
					ЗаписатьВЛог(Контекст, 3, "ru='Подготовка частичной выгрузки для конвертации в EDT'", , 55);
					ФайлСписка = Контекст.КаталогВременныхФайлов + "dumplist.txt";
					СтроковыеФункции.СтрокаВФайл(СтрСоединить(ОбъектыДовыгрузки, Символы.ПС), ФайлСписка, КодировкаТекста.UTF8);
					ЗаписатьВЛог(Контекст, 3, "ru='Довыгрузка объектов для конвертации в EDT'", , 60);
					ВыгрузитьКонфигурациюВФайлы(Контекст, Ложь, ФайлСписка, Ложь);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Контекст.УдалятьКонфигурацииПоставщиков Тогда
			ЗаписатьВЛог(Контекст, 3, "ru='Удаление конфигураций поставщиков'", , 90);
			КаталогКонфигурации = Контекст.КаталогВыгрузкиВXML + "Ext" + ПолучитьРазделительПути();
			ОбщегоНазначения.УдалитьФайлИлиКаталог(КаталогКонфигурации + "ParentConfigurations.bin");
			ОбщегоНазначения.УдалитьФайлИлиКаталог(КаталогКонфигурации + "ParentConfigurations");
		КонецЕсли;
		
		ЗаписатьВЛог(Контекст, 3, "ru='Выгрузка версии из базы в xml завершена'", , 100);
		
		ЗначенияРеквизитов = Новый Структура;
		ЗначенияРеквизитов.Вставить("Состояние", Перечисления.СостоянияВерсии.ВыгруженаВXML);
		ЗначенияРеквизитов.Вставить("ВыгруженыТолькоИзменения", Контекст.ВыгруженыТолькоИзменения);
		ЗначенияРеквизитов.Вставить("ВерсияКонфигурации", Контекст.ВерсияКонфигурации);
		Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(ПараметрыВерсии.Ссылка, ЗначенияРеквизитов);
		ЗаполнитьЗначенияСвойств(ПараметрыВерсии, ЗначенияРеквизитов);
		
	Исключение
		Справочники.ВерсииХранилища.ВозниклаОшибка(ПараметрыВерсии.Ссылка, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ТребуетсяПолнаяВыгрузкаВерсииВXML(ПараметрыВерсии, ПараметрыХранилища, КодПредыдущейПолнойВыгрузкиXML = Неопределено) Экспорт
	// В настройках хранилища отключен флажок "Выгружать изменения (ускорить конвертацию)".
	Если Не ПараметрыХранилища.ВыгружатьИзменения Тогда
		Возврат Истина;
	КонецЕсли;
	// В настройках версии включен флажок "Требуется полная выгрузка".
	Если ПараметрыВерсии.ТребуетсяПолнаяВыгрузка Тогда
		Возврат Истина;
	КонецЕсли;
	// Были какие-либо изменения кроме добавлений и изменений.
	Если ПараметрыВерсии.ЕстьИзмененияПрепятствующиеИнкрементальнойВыгрузке Тогда
		ЗаписатьПричинуПолнойВыгрузкиВXML(ПараметрыВерсии,
			"ru = 'В списке изменений версии есть изменения, препятствующие выгрузке изменений конфигурации (см. таблицу Состав в карточке версии).'");
		Возврат Истина;
	КонецЕсли;
	// Номер версии > Номер предыдущей опорной версии + МаксимальноеКоличествоЧастичныхВыгрузокПодряд.
	МаксимальноеКоличествоЧастичныхВыгрузокПодряд = КонвертацияХранилищаПовтИсп.МаксимальноеКоличествоЧастичныхВыгрузокПодряд();
	Если МаксимальноеКоличествоЧастичныхВыгрузокПодряд > 0 Тогда
		Если КодПредыдущейПолнойВыгрузкиXML = Неопределено Тогда
			КодПредыдущейПолнойВыгрузкиXML = Справочники.ВерсииХранилища.КодПредыдущейВерсииПолностьюВыгруженнойВXML(
				ПараметрыВерсии.Владелец, ПараметрыВерсии.Код);
		КонецЕсли;
		Если ПараметрыВерсии.Код > КодПредыдущейПолнойВыгрузкиXML + МаксимальноеКоличествоЧастичныхВыгрузокПодряд Тогда
			Текст = "ru = 'Достигнут предел количества версий, выгруженных с изменениями подряд.
			|Проверяемая версия: %1;
			|Предыдущая версия полностью выгруженная в XML: %2;
			|Константа МаксимальноеКоличествоЧастичныхВыгрузокПодряд: %3.'";
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				Текст,
				Формат(ПараметрыВерсии.Код, "ЧГ="),
				Формат(КодПредыдущейПолнойВыгрузкиXML, "ЧГ="),
				МаксимальноеКоличествоЧастичныхВыгрузокПодряд);
			ЗаписатьПричинуПолнойВыгрузкиВXML(ПараметрыВерсии, Текст);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	// Версии с переименованиями должны выгружаться полностью.
	// Но пока непонятно как это проверить из отчета по конфигурации.
	Возврат Ложь;
КонецФункции

Процедура ЗаписатьПричинуПолнойВыгрузкиВXML(Контекст, Причина) Экспорт
	ЗаписатьВЛог(Контекст, 3,
		СтрШаблон("ru = 'Причина полной выгрузки XML: %1'", ОбщегоНазначения.ТекстЖурнала(Причина)));
КонецПроцедуры

Функция СкопироватьФайлСостоянияПредыдущейВерсии(Контекст, ПолноеИмяФайлаМетаданныхПредыдущейВерсии) Экспорт
	ПредыдущаяВерсия = Справочники.ВерсииХранилища.ПредыдущаяВерсия(Контекст.Владелец, Контекст.Код);
	Если ПредыдущаяВерсия = Неопределено Тогда
		ЗаписатьПричинуПолнойВыгрузкиВXML(Контекст,
			"ru = 'Не скопирован файл предыдущей версии, т.к. предыдущая версия не найдена.'");
		Возврат Ложь;
	КонецЕсли;
	Если ПредыдущаяВерсия.ВозниклаОшибка Тогда
		ЗаписатьПричинуПолнойВыгрузкиВXML(Контекст,
			"ru = 'Не скопирован файл предыдущей версии, т.к. при выгрузке предыдущей версии возникла ошибка.'");
		Возврат Ложь;
	КонецЕсли;
	
	Если ПредыдущаяВерсия.Состояние = Перечисления.СостоянияВерсии.ВыгруженаВXML
		Или ПредыдущаяВерсия.Состояние = Перечисления.СостоянияВерсии.ЗагружаетсяВEDT
		Или ПредыдущаяВерсия.Состояние = Перечисления.СостоянияВерсии.ЗагруженаВEDT Тогда
		ПолноеИмяКопируемогоФайла = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(ПредыдущаяВерсия.КаталогВременныхФайлов) + "ConfigDumpInfo.xml";
	ИначеЕсли ПредыдущаяВерсия.Состояние = Перечисления.СостоянияВерсии.ПомещенаВGit Тогда
		ПолноеИмяКопируемогоФайла = Контекст.КаталогGitИсходниковEDT + "ConfigDumpInfo.xml";
	Иначе
		ЗаписатьПричинуПолнойВыгрузкиВXML(Контекст,
			СтрШаблон("ru = 'Не скопирован файл предыдущей версии, т.к. состояние предыдущей версии %1.'",
				ПредыдущаяВерсия.Состояние));
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.ФайлСуществует(ПолноеИмяКопируемогоФайла) Тогда
		КопироватьФайл(ПолноеИмяКопируемогоФайла, ПолноеИмяФайлаМетаданныхПредыдущейВерсии);
		Возврат Истина;
	КонецЕсли;
	
	ЗаписатьПричинуПолнойВыгрузкиВXML(Контекст,
		СтрШаблон("ru = 'Не найден файл предыдущей версии ""%1"".'", ПолноеИмяКопируемогоФайла));
	Возврат Ложь;
КонецФункции

Функция ЕстьФайлСостоянияПредыдущейВерсии(ПараметрыПредыдущейВерсии)
	Возврат ЗначениеЗаполнено(ПараметрыПредыдущейВерсии.КаталогВременныхФайлов)
		И ОбщегоНазначения.ФайлСуществует(ПараметрыПредыдущейВерсии.КаталогВременныхФайлов + "ConfigDumpInfo.xml");
КонецФункции

Функция ТекстОшибкиЕслиКаталогВыгрузкиXMLПустой(Контекст)
	Файлы = НайтиФайлы(Контекст.КаталогВыгрузкиВXML, "*", Истина);
	Если Файлы.Количество() = 0 Или (Файлы.Количество() = 1 И Файлы[0].Имя = "ConfigDumpInfo.xml") Тогда
		Если Контекст.ВыгруженыТолькоИзменения Тогда
			Заголовок = НСтр("ru = 'Частичная выгрузка конфигурации в XML не привела к должному эффекту, каталог XML пуст.'");
		Иначе
			Заголовок = НСтр("ru = 'Полная выгрузка конфигурации в XML не привела к должному эффекту, каталог XML пуст.'");
		КонецЕсли;
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1: %2
				|  Каталог XML: %3;
				|  Каталог информационной базы: %4.'"),
			Контекст.Ссылка,
			Заголовок,
			Контекст.КаталогВыгрузкиВXML,
			Контекст.КаталогИБ);
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Процедура ДовыгрузитьКореньВерсииВXML(Контекст)
	Если ОбщегоНазначения.ФайлСуществует(Контекст.КаталогВыгрузкиВXML + "Configuration.xml") Тогда
		Возврат;
	КонецЕсли;
	
	КаталогВыгрузкиКорня = ВыгрузитьОбъектыВКаталог(Контекст, "Configuration", "configuration");
	
	ФайлыКорняККопированию = НайтиФайлы(КаталогВыгрузкиКорня, "*", Ложь);
	Для Каждого ФайлКорняККопированию Из ФайлыКорняККопированию Цикл
		Если ФайлКорняККопированию.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		КопироватьФайл(ФайлКорняККопированию.ПолноеИмя, Контекст.КаталогВыгрузкиВXML + ФайлКорняККопированию.Имя);
	КонецЦикла;
	
	КаталогРасширенныхДанныхКорняИсточник = КаталогВыгрузкиКорня + "Ext";
	КаталогРасширенныхДанныхКорняПриемник = Контекст.КаталогВыгрузкиВXML + "Ext";
	Если ОбщегоНазначения.КаталогСуществует(КаталогРасширенныхДанныхКорняИсточник) Тогда
		СкопироватьКаталогЦеликом(КаталогРасширенныхДанныхКорняПриемник, КаталогРасширенныхДанныхКорняИсточник);
	КонецЕсли;
	
	// Теперь считываем из этого корня языки
	// Если есть языки, выгружаем их и подкидываем туда в корень
	СтруктураDOM = ОбщегоНазначения.СтруктураDOM(КаталогВыгрузкиКорня + "Configuration.xml");
	ИменаЯзыков = ОбщегоНазначения.ИменаЯзыковКонфигурацииXML(СтруктураDOM);
	Если ИменаЯзыков.Количество() > 0 Тогда
		ИменаОбъектов = "Language." + СтрСоединить(ИменаЯзыков, Символы.ПС + "Language.");
		КаталогВыгрузкиЯзыков = ВыгрузитьОбъектыВКаталог(Контекст, ИменаОбъектов, "language");
		СкопироватьКаталогЦеликом(Контекст.КаталогВыгрузкиВXML + "Languages", КаталогВыгрузкиЯзыков + "Languages");
	КонецЕсли;
	
КонецПроцедуры

// Загружает выгрузку XML формата 1С:Предприятие в проект EDT и составляет индекс.
//
// Параметры:
//   ПараметрыХранилища - Структура - См. КонвертацияХранилища.ПараметрыХранилища.
//   ПараметрыВерсии - Структура - См. Справочники.ВерсииХранилища.ПараметрыВерсии.
//
Процедура ЗагрузитьВерсиюВEDT(ПараметрыВерсии, ПараметрыХранилища) Экспорт
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат;
	КонецЕсли;
	Если Не Справочники.ВерсииХранилища.НачатьОбработкуВерсии(
			ПараметрыВерсии.Ссылка,
			ПараметрыВерсии,
			Перечисления.СостоянияВерсии.ВыгруженаВXML,
			Перечисления.СостоянияВерсии.ЗагружаетсяВEDT) Тогда
		Возврат;
	КонецЕсли;
	Попытка
		
		Контекст = КонтекстРаботыСВерсией(ПараметрыВерсии, ПараметрыХранилища);
		Контекст.ВерсияКонфигурации = ВерсияКонфигурации(Контекст);
		
		ИмпортироватьВерсиюВEDTCLI(Контекст);
		
		// Копируем файл дампа в каталог проекта EDT чтобы был доступен для формирования частичной выгрузки
		ИмяФайлаИсточника = Контекст.КаталогВременныхФайлов + "ConfigDumpInfo.xml";
		ИмяФайлаПриемника = Контекст.КаталогИсходниковEDT + "ConfigDumpInfo.xml";
		Если ОбщегоНазначения.ФайлСуществует(ИмяФайлаИсточника) Тогда
			СоздатьКаталог(Контекст.КаталогИсходниковEDT);
			КопироватьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника);
		КонецЕсли;
		
		ПрочитатьСтруктуруВыгрузкиВерсии(Контекст);
		
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить("Состояние", Перечисления.СостоянияВерсии.ЗагруженаВEDT);
		СтруктураРеквизитов.Вставить("КоличествоМетаданных", Контекст.КоличествоМетаданных);
		СтруктураРеквизитов.Вставить("ВерсияКонфигурации", Контекст.ВерсияКонфигурации);
		Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(ПараметрыВерсии.Ссылка, СтруктураРеквизитов);
		
	Исключение
		Справочники.ВерсииХранилища.ВозниклаОшибка(ПараметрыВерсии.Ссылка, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Загружает XML-выгрузку конфигурации в проект EDT при помощи EDT cli.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
Процедура ИмпортироватьВерсиюВEDTCLI(Контекст)
	ЗаписатьВЛог(Контекст, 3, "ru='Импорт в 1C:EDT: Начало'", , 5);
	
	ОбщегоНазначения.ОчиститьКаталог(Контекст.РабочийКаталогEDT, Истина);
	ОбщегоНазначения.ОчиститьКаталог(Контекст.КаталогПроектаEDT, Истина);
	
	Фрагменты = Новый Массив;
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		Фрагменты.Добавить("cmd /C chcp 65001 &&");
	КонецЕсли;
	Фрагменты.Добавить(КонвертацияХранилищаПовтИсп.ФайлПрограммногоИнтерфейсаEDT(Контекст.ВерсияEDTCLI));
	
	// -data — Расположение рабочей области 1C:EDT. https://its.1c.ru/db/edtdoc#content:10330:hdoc.
	Фрагменты.Добавить("-data " + ОбщегоНазначения.УдалитьКонечныйРазделительПути(Контекст.РабочийКаталогEDT));
	
	// -vmargs — Аргументы JVM.
	Фрагменты.Добавить("-vmargs -Dfile.encoding=UTF-8"); // -Dosgi.nl=ru
	
	// Импортирует .xml-файлы конфигурации в проект 1C:EDT. https://its.1c.ru/db/edtdoc#content:10608:hdoc:t000608__import
	//  --version — Необязательный аргумент. Версия платформы "1С:Предприятия", которая будет назначена проекту.
	//    Например, 8.3.22. Если версия не задана, то она будет определена по версии .xml-файлов конфигурации.
	//  --base-project-name — Имя базового проекта. Для проектов расширений, внешних отчетов и обработок.
	//  --configuration-files — Обязательный аргумент. Каталог, содержащий .xml-файлы конфигурации.
	//  --build — если этот аргумент имеет значение true, то проект 1С:EDT запускается сразу после завершения импорта.
	//    Выполняется сборка объектов конфигурации и языковых модулей;
	//  Один из следующих обязательных аргументов:
	//    --project — путь к каталогу проекта 1C:EDT, в который следует импортировать .xml-файлы.
	//      Если каталог уже содержит какие-то файлы, то новые файлы будут добавлены к существующим.
	//      Если этот проект не импортирован в рабочую область, переданную в параметре -data, то перед импортом в него 
	//      .xml-файлов конфигурации будет выполнен импорт этого проекта в рабочую область.
	//    --project-name — имя проекта 1C:EDT, в который следует импортировать .xml-файлы.
	//      Если такой проект уже существует в рабочей области, переданной в параметре -data, то будет выдана ошибка.
	Фрагменты.Добавить("-command import");
	Если Контекст.ТипХранилища = Перечисления.ТипыХранилищаКонфигураций.Расширение Тогда
		Фрагменты.Добавить(СтрШаблон("--base-project-name ""%1""", Контекст.БазовыйПроект));
	КонецЕсли;
	Фрагменты.Добавить(СтрШаблон("--project ""%1""",
		ОбщегоНазначения.УдалитьКонечныйРазделительПути(Контекст.КаталогПроектаEDT)));
	Фрагменты.Добавить(СтрШаблон("--configuration-files ""%1""",
		ОбщегоНазначения.УдалитьКонечныйРазделительПути(Контекст.КаталогВыгрузкиВXML)));
	
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		Фрагменты.Добавить(СтрШаблон(">> ""%1"" 2>&1", Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	Команда = СтрСоединить(Фрагменты, " ");
	КодВозврата = Неопределено;
	ЗапуститьПриложение(Команда, Контекст.КаталогВременныхФайлов, Истина, КодВозврата);
	Успех = (КодВозврата = 0);
	
	ПопытатьсяИсправитьОшибку = (Не Успех И Не Контекст.ОтключитьЛогирование И ЗначениеЗаполнено(Контекст.ИмяФайлаЛога));
	ПервыйПроцент = 45;
	ВторойПроцент = 70;
	
	ТекстЛога = СтрШаблон("ru='Импорт в 1C:EDT: Завершение. Код возврата: %1.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
	ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога, , ?(ПопытатьсяИсправитьОшибку, ПервыйПроцент, ВторойПроцент));
	
	Если ПопытатьсяИсправитьОшибку Тогда
		ПовторитьИмпорт = Ложь;
		ТекстОшибокИмпортаEDT = СтроковыеФункции.СтрокаИзФайла(Контекст.ИмяФайлаЛога);
		ПриОшибкеИмпортаВEDT(Контекст, ТекстОшибокИмпортаEDT, ПовторитьИмпорт);
		КонвертацияХранилищаПереопределяемый.ПриОшибкеИмпортаВEDT(Контекст, ТекстОшибокИмпортаEDT, ПовторитьИмпорт);
		
		Если ПовторитьИмпорт Тогда
			ЗаписатьВЛог(Контекст, 3, "ru='Повторный импорт в 1C:EDT'", , ПервыйПроцент + 5);
			ОбщегоНазначения.ОчиститьКаталог(Контекст.РабочийКаталогEDT, Истина);
			ОбщегоНазначения.ОчиститьКаталог(Контекст.КаталогПроектаEDT, Истина);
			
			КодВозврата = Неопределено;
			ЗапуститьПриложение(Команда, Контекст.КаталогВременныхФайлов, Истина, КодВозврата);
			Успех = (КодВозврата = 0);
			
			ТекстЛога = СтрШаблон("ru='Импорт в 1C:EDT: Завершение. Код возврата: %1.'",
				?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
			ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога, , ВторойПроцент);
		КонецЕсли;
	КонецЕсли;
	
	Если Не Успех Тогда
		ВызватьИсключениеПриОбработкеВерсии(Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Получает список веток репозитория или возвращает текст ошибки доступа.
//
// Параметры:
//   АдресРепозиторияGit - Строка
//   ПользовательСервераGit - Строка
//   ПарольСервераGit - Строка
//
// Возвращаемое значение:
//   Структура - Результат запроса информации с сервера.
//       * Успех - Булево - Истина, если запрос к серверу был успешный.
//       * ТекстОшибки - Строка - Текст ошибки, если запрос к серверу был не успешный.
//       * Ветки - Массив из Строка - Список имен веток репозитория, если запрос к серверу был успешный.
//
Функция ПолучитьВеткиРепозиторияGit(Знач АдресРепозиторияGit, Знач ПользовательСервераGit, Знач ПарольСервераGit) Экспорт
	Если ЗначениеЗаполнено(АдресРепозиторияGit) И ЗначениеЗаполнено(ПарольСервераGit) Тогда
		ПозицияРазделителя = СтрНайти(АдресРепозиторияGit, "://");
		Если ПозицияРазделителя > 0 Тогда
			АдресРепозиторияGit = Лев(АдресРепозиторияGit, ПозицияРазделителя + 2)
				+ ПользовательСервераGit + ":" + ПарольСервераGit + "@"
				+ Сред(АдресРепозиторияGit, ПозицияРазделителя + 3);
		КонецЕсли;
	КонецЕсли;
	
	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
	
	ИмяФайлаВывода = ПолучитьИмяВременногоФайла("txt");
	
	СтрокаКоманды = "git ls-remote --heads %АдресРепозиторияGit%> ""%ИмяФайлаВывода%"" 2>&1";
	
	
	СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%ИмяФайлаВывода%", ИмяФайлаВывода);
	СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%АдресРепозиторияGit%", АдресРепозиторияGit);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(?(ЭтоWindowsСервер, "cmd /C ", "")
		+ СтрокаКоманды, КаталогВременныхФайлов(), Истина, КодВозврата);
	
	Результат = Новый Структура("Успех, ТекстОшибки, Ветки", Ложь, "", Новый Массив());
	
	ФайлВывода = Новый ТекстовыйДокумент();
	ФайлВывода.Прочитать(ИмяФайлаВывода, КодировкаТекста.UTF8);
	
	Если КодВозврата = 0 Тогда
		Результат.Успех = Истина;
		Для НомерСтроки = 1 По ФайлВывода.КоличествоСтрок() Цикл
			ИмяВетки = СокрЛП(ФайлВывода.ПолучитьСтроку(НомерСтроки));
			ПозицияТаб = СтрНайти(ИмяВетки, Символы.Таб);
			Если ПозицияТаб > 0 Тогда
				ИмяВетки = СокрЛП(Сред(ИмяВетки, ПозицияТаб + 1));
			КонецЕсли;
			Если СтрНачинаетсяС(ИмяВетки, "refs/heads/") Тогда
				ИмяВетки = Сред(ИмяВетки, 12);
			КонецЕсли;
			Результат.Ветки.Добавить(ИмяВетки);
		КонецЦикла;
		
	Иначе
		Результат.Успех = Ложь;
		Результат.ТекстОшибки = ФайлВывода.ПолучитьТекст();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Считывает структуру выгрузки версии из файлов
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
Процедура ПрочитатьСтруктуруВыгрузкиВерсии(Контекст) Экспорт
	
	ЗаписатьВЛог(Контекст, 3, "ru='Поиск и подсчет количества файлов'", , 80);
	
	ТаблицаИндексов = СозадатьТаблицуИндексов();
	ТаблицаИндексов.Индексы.Добавить("ХешПолногоИмени, Уровень, ПолноеИмя");
	ТаблицаИндексов.Колонки.Добавить("ПодчиненныеОбъекты");
	
	КвалифицированныеИменаДочернихОбъектов = ОбщегоНазначенияПовтИсп.КвалифицированныеИменаДочернихОбъектов();

	КвалифицированныеОбъекты = Новый Соответствие;
	Для каждого КлючИЗначение Из КвалифицированныеИменаДочернихОбъектов Цикл
		КвалифицированныеОбъекты.Вставить(КлючИЗначение.Значение, КлючИЗначение.Ключ);
	КонецЦикла;
	
	КоличествоОбработано = ТаблицаИндексов.Количество();
	
	ИмяФайлаИндексов = Контекст.КаталогИсходниковEDT + "DumpFilesIndex.txt";
	
	Файлы = НайтиФайлы(Контекст.КаталогИсходниковEDT, "*", Истина);
	
	КоличествоВсего = Файлы.Количество();
	Если КоличествоВсего = 0 Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"ru = '%1: После загрузки XML в EDT не найдено ни одного файла в каталоге.
			|  Каталог XML: %2;
			|  Каталог проекта EDT: %3;
			|  Искали файлы в каталоге src проекта EDT: %4.'",
			Контекст.Ссылка,
			Контекст.КаталогВыгрузкиВXML,
			Контекст.КаталогПроектаEDT,
			Контекст.КаталогИсходниковEDT);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	НачалоЗагрузки = ТекущаяДатаСеанса();
	
	ЗаписатьВЛог(Контекст, 3, "ru='Определение хеш-сумм файлов'", , 81);
	
	Для Каждого Файл Из Файлы Цикл
		Если Файл.ПолноеИмя = ИмяФайлаИндексов Тогда
			Продолжить;
		КонецЕсли;
		
		Если Файл.ЭтоФайл() Тогда
			ПолноеИмя = СтрЗаменить(Файл.ПолноеИмя, Контекст.КаталогИсходниковEDT, "");

			Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
			Хеширование.Добавить(ПолноеИмя);
			ХешПолногоИмени = Строка(Хеширование.ХешСумма);
			ХешПолногоИмени = СтрЗаменить(ХешПолногоИмени, " ", "");
			Пути = СтрРазделить(ПолноеИмя, ПолучитьРазделительПути());
			Отбор = Новый Структура;
			Отбор.Вставить("ХешПолногоИмени", ХешПолногоИмени);
			Отбор.Вставить("ПолноеИмя", ПолноеИмя);
			Отбор.Вставить("Уровень", Пути.Количество());

			НайденныеСтроки = ТаблицаИндексов.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда

				ПодчиненныеОбъекты = Новый Массив();

				Если СтрЗаканчиваетсяНа(ПолноеИмя, ".mdo") Тогда
					Отбор.Вставить("ФайлПолноеИмя", Файл.ПолноеИмя);
					ПрочитатьСвойстваОбъектаМетаданныхEDT(Отбор, КвалифицированныеОбъекты, ПодчиненныеОбъекты);
				КонецЕсли;

				НоваяСтрока = ТаблицаИндексов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Отбор);
				НоваяСтрока.ПодчиненныеОбъекты = ПодчиненныеОбъекты;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;
	
	ЗаписатьВЛог(Контекст, 3, "ru='Расчет идентификаторов подчиненных объектов'", , 94);
	
	Для Каждого СтрокаТЧ Из ТаблицаИндексов Цикл
		Если ПустаяСтрока(СтрокаТЧ.UUID) Тогда
			СтрокаТЧ.UUID = СформироватьUUIDПоРодителюEDT(СтрокаТЧ.ПолноеИмя, ТаблицаИндексов);
		КонецЕсли;
	КонецЦикла;
	
	// Проверки.
	КоличествоМетаданных = ТаблицаИндексов.Количество();
	Если Не Контекст.ВыгруженыТолькоИзменения
		И Контекст.МинимальноеКоличествоМетаданных > 0
		И Контекст.МинимальноеКоличествоМетаданных > КоличествоМетаданных Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"ru = 'Количество метаданных в выгрузке EDT (%1) ниже установленного минимума (%2) для хранилища.'",
			КоличествоМетаданных,
			Контекст.МинимальноеКоличествоМетаданных);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Если Не ОбщегоНазначения.КаталогСуществует(Контекст.КаталогИсходниковEDT) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"ru = 'Пока создавалась ТаблицаИндексов каталог %1 исчез. Содержимое таблицы индексов: %2'",
			Контекст.КаталогИсходниковEDT,
			Символы.ПС + ОбщегоНазначения.ЗначениеВСтрокуXML(ТаблицаИндексов));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ЗаписатьВЛог(Контекст, 3, "ru='Запись таблицы индексов'", , 98);
	
	ЗаписатьТаблицуИндексов(ТаблицаИндексов, ИмяФайлаИндексов);
	Контекст.КоличествоМетаданных = КоличествоМетаданных;
	
КонецПроцедуры

// Выполняет поиск уникального идентификатора родителя для указанного файла и формирует UUID для файла
// 
// Параметры:
// 	ПолноеИмя - Строка - полное имя файла для которого необходимо найти UUID родителя
// 	ТаблицаИндексов - ТаблицаЗначений - Таблица индексов для поиска
// Возвращаемое значение:
// 	Строка - Уникальный идентификатор для текущего файла
Функция СформироватьUUIDПоРодителюEDT(ПолноеИмя, ТаблицаИндексов)

	UUID = ПолноеИмя;

	Пути = СтрРазделить(ПолноеИмя, ПолучитьРазделительПути());
	ПолноеИмяРодителя = "";
	Уровень = 0;
	Путь = "";
	ИмяДочернегоОбъекта = "";
	ТипДочернегоОбъекта = "";
	
	КвалифицированныеИмена = ОбщегоНазначенияПовтИсп.КвалифицированныеИменаДочернихОбъектов();

	Если Пути.Количество() > 1 И Пути[0] = "Configuration" Тогда
		Пути.Очистить();
		Пути.Добавить("Configuration");
		Пути.Добавить("Configuration");
		Уровень = Пути.Количество();
		ПолноеИмяРодителя = СтрСоединить(Пути, ПолучитьРазделительПути()) + ".mdo";
		Пути.Удалить(Пути.ВГраница());
	Иначе
		Пока Пути.Количество() > 1 Цикл
			Путь = Пути[Пути.ВГраница()];
			Пути.Удалить(Пути.ВГраница());
			Если Пути.Количество() = 2 Тогда
				Пути.Добавить(Пути[Пути.ВГраница()] + ".mdo");
				ПолноеИмяРодителя = СтрСоединить(Пути, ПолучитьРазделительПути());
				Уровень = Пути.Количество();
				Пути.Удалить(Пути.ВГраница());
				Прервать;
			ИначеЕсли Пути.Количество() > 2 И КвалифицированныеИмена.Получить(Пути[Пути.ВГраница()]) <> Неопределено Тогда
				ИмяДочернегоОбъекта = Путь;
				СегментПутиДочернегоОбъекта = Пути[Пути.ВГраница()];
				ТипДочернегоОбъекта = КвалифицированныеИмена.Получить(СегментПутиДочернегоОбъекта);
				Пути.Удалить(Пути.ВГраница());
				Пути.Добавить(Пути[Пути.ВГраница()] + ".mdo");
				ПолноеИмяРодителя = СтрСоединить(Пути, ПолучитьРазделительПути());
				Уровень = Пути.Количество();
				Пути.Удалить(Пути.ВГраница());
				Пути.Добавить(СегментПутиДочернегоОбъекта);
				Пути.Добавить(ИмяДочернегоОбъекта);
				Прервать;
			ИначеЕсли Пути[0] = "Subsystems" И Пути[Пути.ВГраница()-1] = "Subsystems" Тогда
				Пути.Добавить(Пути[Пути.ВГраница()] + ".mdo");
				ПолноеИмяРодителя = СтрСоединить(Пути, ПолучитьРазделительПути());
				Уровень = Пути.Количество();
				Пути.Удалить(Пути.ВГраница());
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПолноеИмяРодителя) Тогда
		Отбор = Новый Структура();
		Отбор.Вставить("ПолноеИмя", ПолноеИмяРодителя);
		Отбор.Вставить("Уровень", Уровень);
		Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
		Хеширование.Добавить(ПолноеИмяРодителя);
		ХешПолногоИмени = Строка(Хеширование.ХешСумма);
		ХешПолногоИмени = СтрЗаменить(ХешПолногоИмени, " ", "");
		Отбор.Вставить("ХешПолногоИмени", ХешПолногоИмени);

		Имя = СтрЗаменить(ПолноеИмя, СтрСоединить(Пути, ПолучитьРазделительПути())
			+ ПолучитьРазделительПути(), "");

		НайденныеСтроки = ТаблицаИндексов.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(ИмяДочернегоОбъекта)
					И ТипЗнч(НайденныеСтроки[0].ПодчиненныеОбъекты) = Тип("Массив") Тогда
				Для Каждого ПодчиненныйОбъект Из НайденныеСтроки[0].ПодчиненныеОбъекты Цикл
					Если ПодчиненныйОбъект.Тип = ТипДочернегоОбъекта
							И ПодчиненныйОбъект.Имя = ИмяДочернегоОбъекта Тогда
						UUID = ПодчиненныйОбъект.UUID + "_" + Имя;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ЗначениеЗаполнено(НайденныеСтроки[0].UUID) Тогда
				UUID = НайденныеСтроки[0].UUID + "_" + Имя;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат UUID;
КонецФункции

// Выполняет инициализацию хранилища в Git
//
// Параметры:
//   Хранилище - СправочникСсылка.ХранилищаКонфигураций
//   Клонировать - Булево - Если Истина, то локальная копия будет создана клонированием существующего репозитория.
//   СоздатьВетку - Булево - Если Истина, то будет создана новая ветка репозитория с указанным именем.
//   ОднуВетку - Булево - Если Истина, то локальная копия будет содержать историю только одной указанной ветки.
//
Функция СоздатьРепозиторийGit(Хранилище, Клонировать = Ложь, СоздатьВетку = Ложь, ОднуВетку = Ложь) Экспорт
	ПараметрыВерсии = Справочники.ВерсииХранилища.ПараметрыВерсии(Неопределено);
	ПараметрыВерсии.Состояние = "git_init";
	Контекст = КонтекстРаботыСВерсией(ПараметрыВерсии, Хранилище);
	Контекст.Ссылка = Хранилище;
	
	ЗаписатьВЛог(Контекст, 3, "ru='Создание Git репозитория: Начало'");
	
	СоздатьКаталог(Контекст.КаталогВыгрузкиВерсий);
	ОбщегоНазначения.ОчиститьКаталог(Контекст.ЛокальныйКаталогGit, Истина);
	
	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
	
	Команды = Новый Массив;
	Если ЭтоWindowsСервер Тогда
		Команды.Добавить("chcp 65001");
		ШаблонПеременной = "set %1=""%2""";
	Иначе
		Команды.Добавить("#!/bin/bash");
		ШаблонПеременной = "export %1=""%2""";
	КонецЕсли;
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		Команды.Добавить(СтрШаблон(ШаблонПеременной, "LOGFILE", Контекст.ИмяФайлаЛога));
		Если ЭтоWindowsСервер Тогда
			ВыводЛога = ">> %LOGFILE% 2>&1";
			ШаблонКоманды = 
			"echo. [ВыводЛога]
			|echo [%time:~0,8%] [Команда] [ВыводЛога]
			|[Команда] [ВыводЛога]";
		Иначе
			ВыводЛога = ">> $LOGFILE 2>&1";
			ШаблонКоманды = 
			"echo [ВыводЛога]
			|echo [$(date +""%T"")] [Команда] [ВыводЛога]
			|[Команда] [ВыводЛога]";
		КонецЕсли;
	Иначе
		ВыводЛога = "";
		ШаблонКоманды = "[Команда]";
	КонецЕсли;
	Если ЭтоWindowsСервер Тогда
		Команда = СтрШаблон("cd /D ""%1"" [ВыводЛога]", Контекст.ЛокальныйКаталогGit);
	Иначе
		Команда = СтрШаблон("cd ""%1"" [ВыводЛога]", Контекст.ЛокальныйКаталогGit);
	КонецЕсли;
	Команды.Добавить(Команда);
	
	// Параметры аутентификации.
	АдресРепозиторияGit = Контекст.АдресРепозиторияGit;
	Если ЗначениеЗаполнено(АдресРепозиторияGit) И ЗначениеЗаполнено(Контекст.ПарольСервераGit) Тогда
		ПозицияРазделителя = СтрНайти(АдресРепозиторияGit, "://");
		Если ПозицияРазделителя > 0 Тогда
			АдресРепозиторияGit = Лев(АдресРепозиторияGit, ПозицияРазделителя + 2)
				+ Контекст.ПользовательСервераGit + ":" + Контекст.ПарольСервераGit + "@"
				+ Сред(АдресРепозиторияGit, ПозицияРазделителя + 3);
		КонецЕсли;
	КонецЕсли;
	
	// Инициализация репозитория
	Если Клонировать И ЗначениеЗаполнено(АдресРепозиторияGit) Тогда
		Если СоздатьВетку Тогда
			Команда = СтрШаблон("git clone %1 .", АдресРепозиторияGit);
			Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", Команда));
			Команда = СтрШаблон("git checkout -b ""%1""", Контекст.ИмяВетки);
			Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", Команда));
		ИначеЕсли ОднуВетку Тогда
			Команда = СтрШаблон("git clone -b ""%1"" --single-branch %2 .", Контекст.ИмяВетки, АдресРепозиторияGit);
			Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", Команда));
		Иначе
			Команда = СтрШаблон("git clone -b ""%1"" %2 .", Контекст.ИмяВетки, АдресРепозиторияGit);
			Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", Команда));
		КонецЕсли;
	Иначе
		Команда = "git init";
		Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", Команда));
		Если ЗначениеЗаполнено(АдресРепозиторияGit) Тогда
			Команда = СтрШаблон("git remote add origin %1", АдресРепозиторияGit);
			Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", Команда));
			Команда = "git fetch origin";
			Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", Команда));
		КонецЕсли;
	КонецЕсли;
	
	// Делаем пути к файлам русскоязычными
	Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", "git config --local core.quotepath false"));
	
	// кодировка по умолчанию при просмотре
	Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", "git config --local gui.encoding utf-8"));
	
	// Кодировка сообщений в коммитах
	Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", "git config --local i18n.commitEncoding utf-8"));
	
	// Устанавливаем количество переименованных файлов = 0, т.к. все переименования мы делаем вручную
	Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", "git config --local diff.renameLimit 1"));
	
	// Отключаем автоопределение переименования, переименования устанавливаем вручную
	Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", "git config --local diff.renames false"));
	
	// В рабочей копии будут использоваться "родные" для операционной системы символы окончания строк,
	// а в репозитории всегда будет использоваться LF.
	Если ЭтоWindowsСервер Тогда
		Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", "git config --local core.autocrlf true"));
	Иначе
		Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", "git config --local core.autocrlf input"));
	КонецЕсли;
	Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", "git config --local core.safecrlf true"));
	
	// Текущее состояние локального репозитория для проверки.
	Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", "git status"));
	
	ИсполняемыйФайл = Контекст.ПрефиксФайлов + "_1" + ?(ЭтоWindowsСервер, ".bat", ".sh");
	ТекстыКоманд = СтрСоединить(Команды, Символы.ПС + Символы.ПС);
	ТекстыКоманд = СтрЗаменить(ТекстыКоманд, "[ВыводЛога]", ВыводЛога);
	СтроковыеФункции.СтрокаВФайл(ТекстыКоманд, ИсполняемыйФайл, "UTF-8", Ложь, Ложь);
	
	ЗапуститьПриложение(?(ЭтоWindowsСервер, "", "bash ") + ИсполняемыйФайл, Контекст.ЛокальныйКаталогGit, Истина);
	
	СоздатьКаталог(Контекст.КаталогGitИсходниковEDT);
	
	// Список файлов локального хранилища не помещаемых в удаленный репозиторий.
	ФайлИсключений = Контекст.ЛокальныйКаталогGit + ".gitignore";
	ТекстФайла = СокрЛП(СтроковыеФункции.СтрокаИзФайла(ФайлИсключений, КодировкаТекста.UTF8));
	МассивСтрок = СтрРазделить(ТекстФайла, Символы.ПС, Ложь);
	ЕстьИзменения = Ложь;
	Если МассивСтрок.Найти("DumpFilesIndex.txt") = Неопределено Тогда
		ТекстФайла = ТекстФайла + Символы.ПС + "DumpFilesIndex.txt";
		ЕстьИзменения = Истина;
	КонецЕсли;
	Если МассивСтрок.Найти("ConfigDumpInfo.xml") = Неопределено Тогда
		ТекстФайла = ТекстФайла + Символы.ПС + "ConfigDumpInfo.xml";
		ЕстьИзменения = Истина;
	КонецЕсли;
	Если МассивСтрок.Найти("/.metadata") = Неопределено Тогда
		ТекстФайла = ТекстФайла + Символы.ПС + "/.metadata";
		ЕстьИзменения = Истина;
	КонецЕсли;
	Если МассивСтрок.Найти("**/src/Configuration/ParentConfigurations/*") = Неопределено Тогда
		ТекстФайла = ТекстФайла + Символы.ПС + "**/src/Configuration/ParentConfigurations/*";
		ЕстьИзменения = Истина;
	КонецЕсли;
	Если МассивСтрок.Найти("**/src/Configuration/ParentConfigurations.bin") = Неопределено Тогда
		ТекстФайла = ТекстФайла + Символы.ПС + "**/src/Configuration/ParentConfigurations.bin";
		ЕстьИзменения = Истина;
	КонецЕсли;
	Если ЕстьИзменения Тогда
		СтроковыеФункции.СтрокаВФайл(СокрЛП(ТекстФайла), ФайлИсключений, КодировкаТекста.UTF8, Ложь, Ложь);
	КонецЕсли;
	
	// В атрибуты добавляем настройки для бинарных файлов
	ФайлАтрибутов = Контекст.ЛокальныйКаталогGit + ".gitattributes";
	Если Не ОбщегоНазначения.ФайлСуществует(ФайлАтрибутов) Тогда
		ТекстФайла =
		"# Binary file extensions that should not be modified.
		|*.bin binary
		|*.axdt binary
		|*.addin binary
		|*.oform binary
		|# LFS
		|*.cf filter=lfs diff=lfs merge=lfs -text
		|*.bin filter=lfs diff=lfs merge=lfs -text
		|*.png filter=lfs diff=lfs merge=lfs -text
		|*.gif filter=lfs diff=lfs merge=lfs -text
		|*.bmp filter=lfs diff=lfs merge=lfs -text
		|*.jpg filter=lfs diff=lfs merge=lfs -text
		|*.ico filter=lfs diff=lfs merge=lfs -text
		|*.svg filter=lfs diff=lfs merge=lfs -text
		|*.zip filter=lfs diff=lfs merge=lfs -text
		|*.axdt filter=lfs diff=lfs merge=lfs -text
		|*.addin filter=lfs diff=lfs merge=lfs -text
		|*.oform filter=lfs diff=lfs merge=lfs -text";
		СтроковыеФункции.СтрокаВФайл(ТекстФайла, ФайлАтрибутов, КодировкаТекста.UTF8, Ложь, Ложь);
	КонецЕсли;
	
	// Добавляем изменения в индекс и проверяем статус
	СтрокаКоманды = "git add --all ./ >> ""%ФайлЛога%"" 2>&1 && git status >> ""%ФайлЛога%"" 2>&1";
	СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%ФайлЛога%", Контекст.ИмяФайлаЛога);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(?(ЭтоWindowsСервер, "cmd /C ", "")
		+ СтрокаКоманды, Контекст.ЛокальныйКаталогGit, Истина, КодВозврата);
	Успех = (КодВозврата = Неопределено Или КодВозврата = 0);
	ТекстЛога = СтрШаблон("ru='Создание Git репозитория: Завершение. Код возврата: %1.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
	ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Результат = Новый Структура("Успех, Лог");
	Результат.Успех = ОбщегоНазначения.ФайлСуществует(Контекст.ЛокальныйКаталогGit + ".git");
	Результат.Лог = СтроковыеФункции.СтрокаИзФайла(Контекст.ИмяФайлаЛога, КодировкаТекста.UTF8);
	
	Возврат Результат;
КонецФункции

// Оптимизирует хранилище в Git.
//
// Параметры:
//   Хранилище - СправочникСсылка.ХранилищаКонфигураций
//   Клонировать - Булево - Если Истина, то локальная копия будет создана клонированием существующего репозитория.
//   СоздатьВетку - Булево - Если Истина, то будет создана новая ветка репозитория с указанным именем.
//   ОднуВетку - Булево - Если Истина, то локальная копия будет содержать историю только одной указанной ветки.
//
Функция ОптимизироватьРепозиторийGit(Хранилище) Экспорт
	ПараметрыВерсии = Справочники.ВерсииХранилища.ПараметрыВерсии(Неопределено);
	ПараметрыВерсии.Состояние = "git_gc";
	Контекст = КонтекстРаботыСВерсией(ПараметрыВерсии, Хранилище);
	Контекст.Ссылка = Хранилище;
	
	ЗаписатьВЛог(Контекст, 3, "ru='Оптимизация репозитория Git: Начало'");
	
	СоздатьКаталог(Контекст.КаталогВыгрузкиВерсий);
	СоздатьКаталог(Контекст.ЛокальныйКаталогGit);
	
	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
	
	Команды = Новый Массив;
	Если ЭтоWindowsСервер Тогда
		Команды.Добавить("chcp 65001");
		ШаблонПеременной = "set %1=""%2""";
	Иначе
		Команды.Добавить("#!/bin/bash");
		ШаблонПеременной = "export %1=""%2""";
	КонецЕсли;
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		Команды.Добавить(СтрШаблон(ШаблонПеременной, "LOGFILE", Контекст.ИмяФайлаЛога));
		Если ЭтоWindowsСервер Тогда
			ВыводЛога = ">> %LOGFILE% 2>&1";
			ШаблонКоманды = 
			"echo. [ВыводЛога]
			|echo [%time:~0,8%] [Команда] [ВыводЛога]
			|[Команда] [ВыводЛога]";
		Иначе
			ВыводЛога = ">> $LOGFILE 2>&1";
			ШаблонКоманды = 
			"echo [ВыводЛога]
			|echo [$(date +""%T"")] [Команда] [ВыводЛога]
			|[Команда] [ВыводЛога]";
		КонецЕсли;
	Иначе
		ВыводЛога = "";
		ШаблонКоманды = "[Команда]";
	КонецЕсли;
	Если ЭтоWindowsСервер Тогда
		Команда = СтрШаблон("cd /D ""%1"" [ВыводЛога]", Контекст.ЛокальныйКаталогGit);
	Иначе
		Команда = СтрШаблон("cd ""%1"" [ВыводЛога]", Контекст.ЛокальныйКаталогGit);
	КонецЕсли;
	Команды.Добавить(Команда);
	
	// Оптимизация репозитория.
	Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", "git reflog expire --expire=now --all"));
	Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", "git gc --prune=now --aggressive"));
	
	ИсполняемыйФайл = Контекст.ПрефиксФайлов + "_1" + ?(ЭтоWindowsСервер, ".bat", ".sh");
	ТекстыКоманд = СтрСоединить(Команды, Символы.ПС + Символы.ПС);
	ТекстыКоманд = СтрЗаменить(ТекстыКоманд, "[ВыводЛога]", ВыводЛога);
	СтроковыеФункции.СтрокаВФайл(ТекстыКоманд, ИсполняемыйФайл, "UTF-8", Ложь, Ложь);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(?(ЭтоWindowsСервер, "", "bash ") + ИсполняемыйФайл,
		Контекст.ЛокальныйКаталогGit, Истина, КодВозврата);
	Успех = (КодВозврата = Неопределено Или КодВозврата = 0);
	ТекстЛога = СтрШаблон("ru='Оптимизация репозитория Git: Завершение. Код возврата: %1.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
	ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Результат = Новый Структура("Успех, Лог");
	Результат.Успех = ОбщегоНазначения.ФайлСуществует(Контекст.ЛокальныйКаталогGit + ".git");
	Результат.Лог = СтроковыеФункции.СтрокаИзФайла(Контекст.ИмяФайлаЛога, КодировкаТекста.UTF8);
	
	Возврат Результат;
КонецФункции

// Устанавливает адрес серверного хранилища в Git в локальный репозиторий
// 
// Параметры:
// 	Хранилище - СправочникСсылка.ХранилищаКонфигураций - Ссылка на хранилище, по которому выполняются коммиты
// 	ЛогОперации - ТабличныйДокумент - документ в который будет прочитан лог выполенения операции
// 	ВеткаСуществует - Булево - серверная ветка существует
Функция УстановитьАдресРепозиторияGit(Хранилище, ВеткаСуществует) Экспорт
	Результат = Новый Структура("Успех, Лог");
	
	ПараметрыВерсии = Справочники.ВерсииХранилища.ПараметрыВерсии(Неопределено);
	ПараметрыВерсии.Состояние = "git_origin_connect";
	Контекст = КонтекстРаботыСВерсией(ПараметрыВерсии, Хранилище);
	Контекст.Ссылка = Хранилище;
	
	Если Не ЗначениеЗаполнено(Контекст.АдресРепозиторияGit) Тогда
		Результат.Успех = Ложь;
		Результат.Лог = НСтр("ru = 'Не заполнен АдресРепозиторияGit'");
		Возврат Результат;
	КонецЕсли;
	
	ЗаписатьВЛог(Контекст, 3, "ru='Установка адреса Git репозитория: Начало'");
	
	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
	
	Команды = Новый Массив;
	Если ЭтоWindowsСервер Тогда
		Команды.Добавить("chcp 65001");
		ШаблонПеременной = "set %1=""%2""";
	Иначе
		Команды.Добавить("#!/bin/bash");
		ШаблонПеременной = "export %1=""%2""";
	КонецЕсли;
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		Команды.Добавить(СтрШаблон(ШаблонПеременной, "LOGFILE", Контекст.ИмяФайлаЛога));
		Если ЭтоWindowsСервер Тогда
			ВыводЛога = ">> %LOGFILE% 2>&1";
			ШаблонКоманды = 
			"echo. [ВыводЛога]
			|echo [%time:~0,8%] [Команда] [ВыводЛога]
			|[Команда] [ВыводЛога]";
		Иначе
			ВыводЛога = ">> $LOGFILE 2>&1";
			ШаблонКоманды = 
			"echo [ВыводЛога]
			|echo [$(date +""%T"")] [Команда] [ВыводЛога]
			|[Команда] [ВыводЛога]";
		КонецЕсли;
	Иначе
		ВыводЛога = "";
		ШаблонКоманды = "[Команда]";
	КонецЕсли;
	Если ЭтоWindowsСервер Тогда
		Команда = СтрШаблон("cd /D ""%1"" [ВыводЛога]", Контекст.ЛокальныйКаталогGit);
	Иначе
		Команда = СтрШаблон("cd ""%1"" [ВыводЛога]", Контекст.ЛокальныйКаталогGit);
	КонецЕсли;
	Команды.Добавить(Команда);
	
	Если ЭтоWindowsСервер Тогда
		ТекстКоманды = "git remote remove origin [ВыводЛога] || set ERRORLEVEL=0";
	Иначе
		ТекстКоманды = "git remote remove origin [ВыводЛога] || true";
	КонецЕсли;
	Команды.Добавить(ТекстКоманды);
	
	// Инициализация репозитория
	АдресРепозиторияGit = Контекст.АдресРепозиторияGit;
	Если ЗначениеЗаполнено(Контекст.ПарольСервераGit) Тогда
		ПозицияРазделителя = СтрНайти(АдресРепозиторияGit, "://");
		Если ПозицияРазделителя > 0 Тогда
			АдресРепозиторияGit = Лев(АдресРепозиторияGit, ПозицияРазделителя + 2)
				+ Контекст.ПользовательСервераGit + ":" + Контекст.ПарольСервераGit + "@"
				+ Сред(АдресРепозиторияGit, ПозицияРазделителя + 3);
		КонецЕсли;
	КонецЕсли;
	Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", СтрШаблон("git remote add origin %1", АдресРепозиторияGit)));
	Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", "git fetch origin"));
	Если ВеткаСуществует Тогда
		Команда = СтрШаблон("git branch --set-upstream-to=origin/%1 %1", Контекст.ИмяВетки);
		Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", Команда));
	КонецЕсли;
	
	ИсполняемыйФайл = Контекст.ПрефиксФайлов + "_1" + ?(ЭтоWindowsСервер, ".bat", ".sh");
	ТекстыКоманд = СтрСоединить(Команды, Символы.ПС + Символы.ПС);
	ТекстыКоманд = СтрЗаменить(ТекстыКоманд, "[ВыводЛога]", ВыводЛога);
	СтроковыеФункции.СтрокаВФайл(ТекстыКоманд, ИсполняемыйФайл, "UTF-8", Ложь, Ложь);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(?(ЭтоWindowsСервер, "", "bash ")
		+ ИсполняемыйФайл, Контекст.ЛокальныйКаталогGit, Истина, КодВозврата);
	Успех = (КодВозврата = Неопределено Или КодВозврата = 0);
	ТекстЛога = СтрШаблон("ru='Установка адреса Git репозитория: Завершение. Код возврата: %1.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
	ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Результат.Успех = Успех;
	Результат.Лог = СтроковыеФункции.СтрокаИзФайла(Контекст.ИмяФайлаЛога, КодировкаТекста.UTF8);
	
	Возврат Результат;
КонецФункции

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

#Область ПакетныеОперации

// Создает пустую файловую базу.
//
// Параметры:
//   Контекст - Структура - Параметры создания. См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
Процедура СоздатьФайловуюИнформационнуюБазу(Контекст) Экспорт
	ЗаписатьВЛог(Контекст, 3, "ru='Создание базы: Начало.'");
	
	ФайлПараметров = Контекст.ПрефиксФайлов + "_CreateDB_params.txt";
	ФайлРезультатов = Контекст.ПрефиксФайлов + "_CreateDB_result.txt";
	
	ОбщегоНазначения.ОчиститьКаталог(Контекст.КаталогИБ, Истина);
	
	КаталогПлатформыХранилища = КаталогПлатформыХранилища(Контекст);
	
	СтрокаКоманды = СтрШаблон("""%1"" /@ ""%2""",
		КаталогПлатформыХранилища + "1cv8",
		ФайлПараметров);
	
	ПараметрыЗапуска = Новый Массив;
	ПараметрыЗапуска.Добавить(СтрШаблон("CREATEINFOBASE File=""%1""", Контекст.КаталогИБ));
	ПараметрыЗапуска.Добавить("/DisableStartupDialogs /DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableUnrecoverableErrorMessage /DisableSplash /L ru /VL ru");
	
	// В старых версиях платформы параметр назывался AddInList.
	// Если ФО включена - базы добавляются в список, а чистильщик мусора чистит от них кэш.
	// Если ФО не включена - базы не добавляются в список, поэтому чистильщик мусора может ничего не чистить.
	Если ПолучитьФункциональнуюОпцию("ДобавлятьВременныеБазыВСписок") Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/AddInList ""%1""", Контекст.КаталогИБ));
	КонецЕсли;
	
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpResult ""%1""", ФайлРезультатов));
	
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/Out ""%1"" -NoTruncate", Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		Кодировка = КодировкаТекста.ANSI;
	Иначе
		Кодировка = КодировкаТекста.UTF8;
	КонецЕсли;
	СтроковыеФункции.СтрокаВФайл(СтрСоединить(ПараметрыЗапуска, " "), ФайлПараметров, Кодировка);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаКоманды, КаталогПлатформыХранилища, Истина, КодВозврата);
	КодРезультата = ПрочитатьФайлРезультата(ФайлРезультатов);
	Успех = (КодВозврата = 0 И КодРезультата = 0);
	
	// Пропуск ошибок вида "Информационная база с указанным именем или параметрами соединения уже зарегистрирована".
	Если Не Успех И ОбщегоНазначения.ФайлСуществует(Контекст.КаталогИБ + "1Cv8.1CD") Тогда
		Успех = Истина;
	КонецЕсли;
	
	ТекстЛога = СтрШаблон("ru='Создание базы: Завершение. Код возврата: %1, Код результата: %2.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата), КодРезультата);
	ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Если Не Успех Тогда
		ВызватьИсключениеПриОбработкеВерсии(Контекст);
	КонецЕсли;
КонецПроцедуры

// Добавляет пустое расширение в файловую базу.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
Процедура ДобавитьПустоеРасширениеКонфигурации(Контекст) Экспорт
	Если Контекст.ТипХранилища <> Перечисления.ТипыХранилищаКонфигураций.Расширение Тогда
		Возврат;
	КонецЕсли;
	ЗаписатьВЛог(Контекст, 3, "ru='Добавление пустого расширения конфигурации: Начало.'");
	
	ФайлПараметров = Контекст.ПрефиксФайлов + "_AddEmptyExt_params.txt";
	ФайлРезультатов = Контекст.ПрефиксФайлов + "_AddEmptyExt_result.txt";
	
	КаталогПустогоРасширения = Контекст.КаталогВременныхФайлов + "empty_ext" + ПолучитьРазделительПути();
	ОбщегоНазначения.УдалитьФайлИлиКаталог(КаталогПустогоРасширения);
	
	КаталогПлатформыХранилища = КаталогПлатформыХранилища(Контекст);
	СтрокаКоманды = СтрШаблон("""%1"" /@ ""%2""",
		КаталогПлатформыХранилища + "1cv8",
		ФайлПараметров);
	
	ПараметрыЗапуска = Новый Массив;
	ПараметрыЗапуска.Добавить(СтрШаблон("DESIGNER /WA- %1", Контекст.СтрокаСоединенияИБ));
	ПараметрыЗапуска.Добавить("/AllowExecuteScheduledJobs -Off /DisableStartupDialogs /DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableUnrecoverableErrorMessage /DisableSplash /UsePrivilegedMode /L ru /VL ru");
	
	Если ЗначениеЗаполнено(Контекст.ИмяПользователяИБ) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/N ""%1""", Контекст.ИмяПользователяИБ));
		Если ЗначениеЗаполнено(Контекст.ПарольПользователяИБ) Тогда
			ПараметрыЗапуска.Добавить(СтрШаблон("/P ""%1""", Контекст.ПарольПользователяИБ));
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыЗапуска.Добавить(СтрШаблон("/LoadConfigFromFiles ""%1""", КаталогПустогоРасширения));
	ПараметрыЗапуска.Добавить(СтрШаблон("-Extension %1", Контекст.ИмяРасширения));
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpResult ""%1""", ФайлРезультатов));
	
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/Out ""%1"" -NoTruncate", Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	СоздатьКаталог(КаталогПустогоРасширения);
	ТекстовыйДокумент = Справочники.ХранилищаКонфигураций.ПолучитьМакет("ПустоеРасширение");
	ТекстовыйДокумент.Записать(КаталогПустогоРасширения + "Configuration.xml");
	
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		Кодировка = КодировкаТекста.ANSI;
	Иначе
		Кодировка = КодировкаТекста.UTF8;
	КонецЕсли;
	СтроковыеФункции.СтрокаВФайл(СтрСоединить(ПараметрыЗапуска, " "), ФайлПараметров, Кодировка);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаКоманды, КаталогПлатформыХранилища, Истина, КодВозврата);
	КодРезультата = ПрочитатьФайлРезультата(ФайлРезультатов);
	Успех = (КодВозврата = 0 И КодРезультата = 0);
	ОбщегоНазначения.УдалитьФайлИлиКаталог(КаталогПустогоРасширения);
	
	ТекстЛога = СтрШаблон("ru='Добавление пустого расширения конфигурации: Завершение. Код возврата: %1, Код результата: %2.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата), КодРезультата);
	ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Если Не Успех Тогда
		ВызватьИсключениеПриОбработкеВерсии(Контекст);
	КонецЕсли;
КонецПроцедуры

// Формирует отчет по истории хранилища начиная с указанной версии.
//   Поднимает исключение в случае неудачи.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
Процедура СформироватьОтчетПоВерсиямХранилища(Контекст) Экспорт
	ЗаписатьВЛог(Контекст, 3, "ru='Формирование отчета по хранилищу: Начало.'");
	
	ФайлПараметров = Контекст.ПрефиксФайлов + "_RepositoryReport_params.txt";
	ФайлРезультатов = Контекст.ПрефиксФайлов + "_RepositoryReport_result.txt";
	
	КаталогПлатформыХранилища = КаталогПлатформыХранилища(Контекст);
	СтрокаКоманды = СтрШаблон("""%1"" /@ ""%2""",
		КаталогПлатформыХранилища + "1cv8",
		ФайлПараметров);
	
	ПараметрыЗапуска = Новый Массив;
	// Адрес, логин и пароль базы.
	ПараметрыЗапуска.Добавить(СтрШаблон("DESIGNER /WA- %1", Контекст.СтрокаСоединенияИБ));
	ПараметрыЗапуска.Добавить("/AllowExecuteScheduledJobs -Off /DisableStartupDialogs /DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableUnrecoverableErrorMessage /DisableSplash /UsePrivilegedMode /L ru /VL ru");
	Если ЗначениеЗаполнено(Контекст.ИмяПользователяИБ) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/N ""%1""", Контекст.ИмяПользователяИБ));
		Если ЗначениеЗаполнено(Контекст.ПарольПользователяИБ) Тогда
			ПараметрыЗапуска.Добавить(СтрШаблон("/P ""%1""", Контекст.ПарольПользователяИБ));
		КонецЕсли;
	КонецЕсли;
	// Адрес, логин и пароль хранилища.
	ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryF ""%1""", Контекст.АдресХранилища));
	ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryN ""%1""", Контекст.ИмяПользователяХранилища));
	Если ЗначениеЗаполнено(Контекст.ПарольПользователяХранилища) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryP ""%1""", Контекст.ПарольПользователяХранилища));
	КонецЕсли;
	
	// Построить отчет по истории хранилища. https://its.1c.ru/db/v8327doc#bookmark:adm:TI000000807
	//  /ConfigurationRepositoryReport <имя файла> [-NBegin <номер версии>] [-NEnd <номер версии>]
	//    [-DateBegin <дата начала>] [-DateEnd <дата окончания>] [-GroupByObject] [-GroupByComment]
	//    [-DoNotIncludeVersionsWithLabels] [-IncludeOnlyVersionsWithLabels] [-IncludeCommentLinesWithDoubleSlash]
	//    [-ConfigurationVersion <версия конфигурации>] [-ReportFormat <txt|mxl>] [-Extension <Имя расширения>]
	ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryReport ""%1""", Контекст.ИмяФайлаОтчета));
	// Номер сохраненной версии, от которой начинается строиться отчет. Если -1, то отчет строится для последней версии.
	Если Контекст.Свойство("ВерсияНачала") Тогда
		Если ТипЗнч(Контекст.ВерсияНачала) <> Тип("Строка") Тогда
			Контекст.Вставить("ВерсияНачала", Формат(Контекст.ВерсияНачала, "ЧДЦ=; ЧГ=0"));
		КонецЕсли;
		ПараметрыЗапуска.Добавить(СтрШаблон("-NBegin ""%1""", Контекст.ВерсияНачала));
	КонецЕсли;
	// Номер сохраненной версии, по которую строится отчет.
	Если Контекст.Свойство("ВерсияОкончания") Тогда
		Если ТипЗнч(Контекст.ВерсияОкончания) <> Тип("Строка") Тогда
			Контекст.Вставить("ВерсияОкончания", Формат(Контекст.ВерсияОкончания, "ЧДЦ=; ЧГ=0"));
		КонецЕсли;
		ПараметрыЗапуска.Добавить(СтрШаблон("-NEnd ""%1""", Контекст.ВерсияОкончания));
	КонецЕсли;
	// Включить в отчет строки комментариев.
	ПараметрыЗапуска.Добавить("-IncludeCommentLinesWithDoubleSlash");
	// Имя расширения, с хранилищем которого будет выполняться команда.
	Если Контекст.ТипХранилища = Перечисления.ТипыХранилищаКонфигураций.Расширение Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("-Extension ""%1""", Контекст.ИмяРасширения));
	КонецЕсли;
	
	// Записать результат работы конфигуратора в файл. Результат - число (0 - в случае успеха).
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpResult ""%1""", ФайлРезультатов));
	// Файл для вывода служебных сообщений. Если задан параметр -NoTruncate (через пробел), файл не очищается.
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/Out ""%1"" -NoTruncate", Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		Кодировка = КодировкаТекста.ANSI;
	Иначе
		Кодировка = КодировкаТекста.UTF8;
	КонецЕсли;
	СтроковыеФункции.СтрокаВФайл(СтрСоединить(ПараметрыЗапуска, " "), ФайлПараметров, Кодировка);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаКоманды, КаталогПлатформыХранилища, Истина, КодВозврата);
	КодРезультата = ПрочитатьФайлРезультата(ФайлРезультатов);
	Успех = (КодВозврата = 0 И КодРезультата = 0);
	
	ТекстЛога = СтрШаблон("ru='Формирование отчета по хранилищу: Завершение. Код возврата: %1, Код результата: %2.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата), КодРезультата);
	ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Если Не Успех Тогда
		ВызватьИсключениеПриОбработкеВерсии(Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Получает версию конфигурации из хранилища.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
Процедура ОбновитьИнформационнуюБазуИзХранилища(Контекст, НомерВерсииХранилища) Экспорт
	ЗаписатьВЛог(Контекст, 3, "ru='Получение версии конфигурации из хранилища: Начало.'");
	
	ФайлПараметров = Контекст.ПрефиксФайлов + "_RepositoryCheckout_params.txt";
	ФайлРезультатов = Контекст.ПрефиксФайлов + "_RepositoryCheckout_result.txt";
	
	КаталогПлатформыХранилища = КаталогПлатформыХранилища(Контекст);
	СтрокаКоманды = СтрШаблон("""%1"" /@ ""%2""",
		КаталогПлатформыХранилища + "1cv8",
		ФайлПараметров);
	
	ПараметрыЗапуска = Новый Массив;
	// Адрес, логин и пароль базы.
	ПараметрыЗапуска.Добавить(СтрШаблон("DESIGNER /WA- %1", Контекст.СтрокаСоединенияИБ));
	ПараметрыЗапуска.Добавить("/AllowExecuteScheduledJobs -Off /DisableStartupDialogs /DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableUnrecoverableErrorMessage /DisableSplash /UsePrivilegedMode /L ru /VL ru");
	Если ЗначениеЗаполнено(Контекст.ИмяПользователяИБ) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/N ""%1""", Контекст.ИмяПользователяИБ));
		Если ЗначениеЗаполнено(Контекст.ПарольПользователяИБ) Тогда
			ПараметрыЗапуска.Добавить(СтрШаблон("/P ""%1""", Контекст.ПарольПользователяИБ));
		КонецЕсли;
	КонецЕсли;
	// Адрес, логин и пароль хранилища.
	ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryF ""%1""", Контекст.АдресХранилища));
	ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryN ""%1""", Контекст.ИмяПользователяХранилища));
	Если ЗначениеЗаполнено(Контекст.ПарольПользователяХранилища) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryP ""%1""", Контекст.ПарольПользователяХранилища));
	КонецЕсли;
	
	// Обновить конфигурацию из хранилища. https://its.1c.ru/db/v8327doc#bookmark:adm:TI000000496
	//  /ConfigurationRepositoryUpdateCfg [-v <номер версии хранилища>] [-revised] [-force]
	//    [-Objects <имя файла>] [-Extension <Имя расширения>]
	Если ТипЗнч(НомерВерсииХранилища) = Тип("Число") Тогда
		НомерВерсииХранилища = Формат(НомерВерсииХранилища, "ЧДЦ=; ЧГ=0");
	ИначеЕсли Не ЗначениеЗаполнено(НомерВерсииХранилища) Тогда
		НомерВерсииХранилища = "-1";
	КонецЕсли;
	ПараметрыЗапуска.Добавить(СтрШаблон("/ConfigurationRepositoryUpdateCfg -force -v %1", НомерВерсииХранилища));
	Если Контекст.ТипХранилища = Перечисления.ТипыХранилищаКонфигураций.Расширение Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("-Extension ""%1""", Контекст.ИмяРасширения));
	КонецЕсли;
	
	// Записать результат работы конфигуратора в файл. Результат - число (0 - в случае успеха).
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpResult ""%1""", ФайлРезультатов));
	// Файл для вывода служебных сообщений. Если задан параметр -NoTruncate (через пробел), файл не очищается.
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/Out ""%1"" -NoTruncate", Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		Кодировка = КодировкаТекста.ANSI;
	Иначе
		Кодировка = КодировкаТекста.UTF8;
	КонецЕсли;
	СтроковыеФункции.СтрокаВФайл(СтрСоединить(ПараметрыЗапуска, " "), ФайлПараметров, Кодировка);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаКоманды, КаталогПлатформыХранилища, Истина, КодВозврата);
	КодРезультата = ПрочитатьФайлРезультата(ФайлРезультатов);
	Успех = (КодВозврата = 0 И КодРезультата = 0);
	
	ТекстЛога = СтрШаблон("ru='Получение версии конфигурации из хранилища: Завершение. Код возврата: %1, Код результата: %2.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата), КодРезультата);
	ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Если Не Успех Тогда
		ВызватьИсключениеПриОбработкеВерсии(Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Выгружает конфигурацию базы данных в файлы XML.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//       * СтрокаСоединенияИБ - Строка
//       * ИмяПользователяИБ - Строка
//       * ПарольПользователяИБ - Строка
//       * КаталогВыгрузкиВXML - Строка
//       * ТипХранилища - ПеречислениеСсылка.ТипыХранилищаКонфигураций
//       * ИмяРасширения - Строка
//       * ФайлСостоянияПредыдущейВерсии - Строка
//       * ФайлИзменений - Строка
//       * ИмяФайлаЛога - Строка
//   ВыгрузитьИзменения - Булево - Если Истина то выгрузка будет в режиме "-update -force". Если заполнен
//       Контекст.ФайлСостоянияПредыдущейВерсии, то отличия будут вычисляться относительно указанного файла.
//   ФайлСписка - Строка - Полное имя файла со списком полных имен объектов метаданных для частичной выгрузки.
//       Указанные объекты будут выгружены независимо от того, были ли они изменены, или нет.
//   ПолучитьСписокИзменений - Булево - Если Истина то выгрузка будет в режиме "–getChanges [Контекст.ФайлИзменений]".
//
Процедура ВыгрузитьКонфигурациюВФайлы(Контекст, ВыгрузитьИзменения = Ложь, ФайлСписка = "", ПолучитьСписокИзменений = Ложь) Экспорт
	ЗаписатьВЛог(Контекст, 3, "ru='Выгрузка конфигурации в XML: Начало.'");
	
	ФайлПараметров = Контекст.ПрефиксФайлов + "_DumpXML_params.txt";
	ФайлРезультатов = Контекст.ПрефиксФайлов + "_DumpXML_result.txt";
	
	Если Не ОбщегоНазначения.КаталогСуществует(Контекст.КаталогВыгрузкиВXML) Тогда
		СоздатьКаталог(Контекст.КаталогВыгрузкиВXML);
	КонецЕсли;
	
	КаталогПлатформыВыгрузкиXML = КаталогПлатформыВыгрузкиXML(Контекст);
	СтрокаКоманды = СтрШаблон("""%1"" /@ ""%2""",
		КаталогПлатформыВыгрузкиXML + "1cv8",
		ФайлПараметров);
	
	ПараметрыЗапуска = Новый Массив;
	// Адрес, логин и пароль базы.
	ПараметрыЗапуска.Добавить(СтрШаблон("DESIGNER /WA- %1", Контекст.СтрокаСоединенияИБ));
	ПараметрыЗапуска.Добавить("/AllowExecuteScheduledJobs -Off /DisableStartupDialogs /DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableUnrecoverableErrorMessage /DisableSplash /UsePrivilegedMode /L ru /VL ru");
	Если ЗначениеЗаполнено(Контекст.ИмяПользователяИБ) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/N ""%1""", Контекст.ИмяПользователяИБ));
		Если ЗначениеЗаполнено(Контекст.ПарольПользователяИБ) Тогда
			ПараметрыЗапуска.Добавить(СтрШаблон("/P ""%1""", Контекст.ПарольПользователяИБ));
		КонецЕсли;
	КонецЕсли;
	
	// Выгрузить конфигурацию в файлы. https://its.1c.ru/db/v8327doc#bookmark:adm:TI000000527
	//  /DumpConfigToFiles <каталог выгрузки> [-Format <режим>] [-Extension <Имя расширения>] [-AllExtensions]
	//    [–update] [–force] [–getChanges <имя файла>] [–configDumpInfoForChanges <имя файла>] [-listFile <имя файла>]
	//    [-configDumpInfoOnly] [-Server [-JobsCount <количество>]] [-Archive <имя файла>] [-ignoreUnresolvedReferences]
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpConfigToFiles ""%1""", Контекст.КаталогВыгрузкиВXML));
	Если Контекст.ТипХранилища = Перечисления.ТипыХранилищаКонфигураций.Расширение Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("-Extension ""%1""", Контекст.ИмяРасширения));
	КонецЕсли;
	
	//    [–update] - Обновить ранее совершенную выгрузку.
	//      Будут выгружены только те объекты, версии которых отличаются от версий ранее выгруженных объектов.
	//      Файл версий (ConfigDumpInfo.xml) будет получен из текущего каталога выгрузки.
	//      Если текущая версия формата выгрузки не совпадает с версией формата в файле версий или если файл версий
	//      не найден, будет сгенерирована ошибка. По завершении выгрузки файл версий обновляется.
	//      Возможно совместное использование с параметрами:
	//    [–force] - Если текущая версия формата выгрузки не совпадает с версией формата в файле версий,
	//      будет выполнена полная выгрузка.
	//    [–configDumpInfoForChanges <имя файла>] - Файл версий (ConfigDumpInfo.xml) для сравнения изменений.
	//      Имя файла является обязательным. Если текущий каталог выгрузки перед началом работы не пустой,
	//      то будет сгенерирована ошибка. Соответствие текущей версии формата выгрузки и версии формата
	//      выгрузки в файле версий не проверяется. При выгрузке генерируется новый файл версий.
	//      Файл, указанный в параметре -configDumpInfoForChanges не изменяется.
	Если ВыгрузитьИзменения Тогда
		ПараметрыЗапуска.Добавить("-update -force");
		Если ЗначениеЗаполнено(Контекст.ФайлСостоянияПредыдущейВерсии) Тогда
			ПараметрыЗапуска.Добавить(СтрШаблон("-configDumpInfoForChanges ""%1""", Контекст.ФайлСостоянияПредыдущейВерсии));
		КонецЕсли;
	КонецЕсли;
	
	//    [-listFile <имя файла>] - Файл со списком объектов, которые будут выгружены независимо от того,
	//      были ли они изменены, или нет. Имя файла является обязательным. Объекты из списка будут выгружены полностью,
	//      за исключением подчиненных объектов, которые выступают как отдельные объекты разработки. Для выгрузки таких
	//      подчиненных объектов их следует явно указать в списке. Если объект из списка имеет подчиненные объекты, не
	//      являющиеся отдельными объектами разработки, но имеющие внешние свойства, то внешние свойства таких объектов
	//      также будут выгружены. Идентификаторы Configuration и Configuration.ИмяКонфигурации являются эквивалентными.
	Если ЗначениеЗаполнено(ФайлСписка) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("-listFile ""%1""", ФайлСписка));
	КонецЕсли;
	
	//    [–getChanges <имя файла>]- В указанном файле будет сформирован список изменений текущей конфигурации
	//      относительно выгрузки и, соответственно, файла версий, каталог которой указан параметром команды
	//      /DumpConfigToFiles. Имя файла является обязательным.
	//      Может использоваться совместно с параметром –configDumpInfoForChanges.
	//    [–configDumpInfoForChanges <имя файла>] - Файл версий (ConfigDumpInfo.xml) для вычисления изменений.
	//      Имя файла является обязательным. Если файл версии не найден, то будет сгенерирована ошибка.
	Если ПолучитьСписокИзменений Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("-getChanges ""%1""", Контекст.ФайлИзменений));
		Если ЗначениеЗаполнено(Контекст.ФайлСостоянияПредыдущейВерсии) Тогда
			ПараметрыЗапуска.Добавить(СтрШаблон("-configDumpInfoForChanges ""%1""", Контекст.ФайлСостоянияПредыдущейВерсии));
		КонецЕсли;
	КонецЕсли;
	
	// Записать результат работы конфигуратора в файл. Результат - число (0 - в случае успеха).
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpResult ""%1""", ФайлРезультатов));
	// Файл для вывода служебных сообщений. Если задан параметр -NoTruncate (через пробел), файл не очищается.
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/Out ""%1"" -NoTruncate", Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		Кодировка = КодировкаТекста.ANSI;
	Иначе
		Кодировка = КодировкаТекста.UTF8;
	КонецЕсли;
	СтроковыеФункции.СтрокаВФайл(СтрСоединить(ПараметрыЗапуска, " "), ФайлПараметров, Кодировка);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаКоманды, КаталогПлатформыВыгрузкиXML, Истина, КодВозврата);
	КодРезультата = ПрочитатьФайлРезультата(ФайлРезультатов);
	Успех = (КодВозврата = 0 И КодРезультата = 0);
	
	ТекстЛога = СтрШаблон("ru='Выгрузка конфигурации в XML: Завершение. Код возврата: %1, Код результата: %2.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата), КодРезультата);
	ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Если Не Успех Тогда
		ВызватьИсключениеПриОбработкеВерсии(Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Выгружает файл сведений о конфигурации ConfigDumpInfo.xml.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//       * СтрокаСоединенияИБ - Строка
//       * ИмяПользователяИБ - Строка
//       * ПарольПользователяИБ - Строка
//       * КаталогВыгрузкиВXML - Строка
//       * ТипХранилища - ПеречислениеСсылка.ТипыХранилищаКонфигураций
//       * ИмяРасширения - Строка
//       * ИмяФайлаЛога - Строка
//
Процедура СохранитьФайлИнформацииВыгрузки(Контекст) Экспорт
	ЗаписатьВЛог(Контекст, 3, "ru='Сохранения файла информации выгрузки: Начало.'");
	
	ФайлПараметров = Контекст.ПрефиксФайлов + "_DumpCDI_params.txt";
	ФайлРезультатов = Контекст.ПрефиксФайлов + "_DumpCDI_result.txt";
	
	ОбщегоНазначения.УдалитьФайлИлиКаталог(Контекст.КаталогВыгрузкиВXML + "ConfigDumpInfo.xml");
	Если Не ОбщегоНазначения.КаталогСуществует(Контекст.КаталогВыгрузкиВXML) Тогда
		СоздатьКаталог(Контекст.КаталогВыгрузкиВXML);
	КонецЕсли;
	
	КаталогПлатформыВыгрузкиXML = КаталогПлатформыВыгрузкиXML(Контекст);
	СтрокаКоманды = СтрШаблон("""%1"" /@ ""%2""",
		КаталогПлатформыВыгрузкиXML + "1cv8",
		ФайлПараметров);
	
	ПараметрыЗапуска = Новый Массив;
	// Адрес, логин и пароль базы.
	ПараметрыЗапуска.Добавить(СтрШаблон("DESIGNER /WA- %1", Контекст.СтрокаСоединенияИБ));
	ПараметрыЗапуска.Добавить("/AllowExecuteScheduledJobs -Off /DisableStartupDialogs /DisableStartupMessages");
	ПараметрыЗапуска.Добавить("/DisableUnrecoverableErrorMessage /DisableSplash /UsePrivilegedMode /L ru /VL ru");
	Если ЗначениеЗаполнено(Контекст.ИмяПользователяИБ) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/N ""%1""", Контекст.ИмяПользователяИБ));
		Если ЗначениеЗаполнено(Контекст.ПарольПользователяИБ) Тогда
			ПараметрыЗапуска.Добавить(СтрШаблон("/P ""%1""", Контекст.ПарольПользователяИБ));
		КонецЕсли;
	КонецЕсли;
	
	// Выгрузить конфигурацию в файлы. https://its.1c.ru/db/v8327doc#bookmark:adm:TI000000527
	//  /DumpConfigToFiles <каталог выгрузки> [-Format <режим>] [-Extension <Имя расширения>] [-AllExtensions]
	//    [–update] [–force] [–getChanges <имя файла>] [–configDumpInfoForChanges <имя файла>] [-listFile <имя файла>]
	//    [-configDumpInfoOnly] [-Server [-JobsCount <количество>]] [-Archive <имя файла>] [-ignoreUnresolvedReferences]
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpConfigToFiles ""%1""", Контекст.КаталогВыгрузкиВXML));
	Если Контекст.ТипХранилища = Перечисления.ТипыХранилищаКонфигураций.Расширение Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("-Extension ""%1""", Контекст.ИмяРасширения));
	КонецЕсли;
	ПараметрыЗапуска.Добавить("-configDumpInfoOnly");
	
	ПараметрыЗапуска.Добавить(СтрШаблон("/DumpResult ""%1""", ФайлРезультатов));
	
	Если ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		ПараметрыЗапуска.Добавить(СтрШаблон("/Out ""%1"" -NoTruncate", Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
		Кодировка = КодировкаТекста.ANSI;
	Иначе
		Кодировка = КодировкаТекста.UTF8;
	КонецЕсли;
	СтроковыеФункции.СтрокаВФайл(СтрСоединить(ПараметрыЗапуска, " "), ФайлПараметров, Кодировка);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаКоманды, КаталогПлатформыВыгрузкиXML, Истина, КодВозврата);
	КодРезультата = ПрочитатьФайлРезультата(ФайлРезультатов);
	Успех = (КодВозврата = 0 И КодРезультата = 0);
	
	ТекстЛога = СтрШаблон("ru='Сохранения файла информации выгрузки: Завершение. Код возврата: %1, Код результата: %2.'",
		?(КодВозврата = Неопределено, "Неопределено", КодВозврата), КодРезультата);
	ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Если Не Успех Тогда
		ВызватьИсключениеПриОбработкеВерсии(Контекст);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Импорт_в_EDT

// Возникает при ошибке импорта выгрузки XML в EDT.
//   Позволяет "на лету" исправить ошибки в выгрузке XML и повторить операцию импорта.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//   ТекстОшибокИмпортаEDT - Строка - Лог импорта в EDT.
//   ПовторитьИмпорт - Булево
//
Процедура ПриОшибкеИмпортаВEDT(Контекст, ТекстОшибокИмпортаEDT, ПовторитьИмпорт) Экспорт
	
	Обработанные = Новый Соответствие;
	
	// Удаление дублей языков.
	Если СтрНайти(ТекстОшибокИмпортаEDT, "Configuration.xml") > 0 Тогда
		ПолноеИмяОшибочногоXML = Контекст.КаталогВыгрузкиВXML + "Configuration.xml";
		Обработанные.Вставить(ВРег(ПолноеИмяОшибочногоXML), Истина);
		Если УдалитьДублиЯзыков(Контекст, ПолноеИмяОшибочногоXML) Тогда
			ПовторитьИмпорт = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Удаление дублей форм, исправление свойств ViewStatusLocation.
	РасширениеXML = ".xml";
	Подстроки = СтрРазделить(ТекстОшибокИмпортаEDT, """");
	Для Каждого Подстрока Из Подстроки Цикл
		Если Не СтрЗаканчиваетсяНа(Подстрока, РасширениеXML) Тогда
			Продолжить;
		КонецЕсли;
		ПолноеИмяОшибочногоXML = Контекст.КаталогВыгрузкиВXML + Подстрока;
		Если Обработанные[ВРег(ПолноеИмяОшибочногоXML)] = Истина Тогда
			Продолжить;
		КонецЕсли;
		Обработанные.Вставить(ВРег(ПолноеИмяОшибочногоXML), Истина);
		// Удаление дублей форм.
		Если УдалитьДублиФорм(Контекст, ПолноеИмяОшибочногоXML) Тогда
			ПовторитьИмпорт = Истина;
		КонецЕсли;
		// Исправление свойств ViewStatusLocation.
		Если ИсправитьЭлементыФорм(Контекст, ПолноеИмяОшибочногоXML) Тогда
			ПовторитьИмпорт = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСВыгрузкойXML

// Возвращает версию выгруженной конфигурации.
//
// Параметры:
//   Контекст - Структура
//       * ВерсияКонфигурации - Строка
//       * КаталогВыгрузкиВXML - Строка
//
// Возвращаемое значение:
//   Строка - Версия конфигурации по данным XML.
//
Функция ВерсияКонфигурации(Контекст)
	Если ЗначениеЗаполнено(Контекст.ВерсияКонфигурации) Тогда
		Возврат Контекст.ВерсияКонфигурации;
	КонецЕсли;
	ОбщегоНазначения.ПроверитьФайлСуществует(Контекст.КаталогВыгрузкиВXML + "Configuration.xml");
	СтруктураDOM = ОбщегоНазначения.СтруктураDOM(Контекст.КаталогВыгрузкиВXML + "Configuration.xml");
	Возврат ОбщегоНазначения.ВерсияКонфигурацииXML(СтруктураDOM);
КонецФункции

Функция УдалитьДублиЯзыков(Контекст, ПолноеИмяОшибочногоXML) Экспорт
	ДокументDOM = ОбщегоНазначения.ДокументDOM(ПолноеИмяОшибочногоXML);
	Если ДокументDOM = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Удаляем дубли языков.
	ЗаписатьВЛог(Контекст, 3, СтрШаблон("ru = 'Начало поиска дублей языков в %1.'", ПолноеИмяОшибочногоXML));
	
	XMLИзменен = Ложь;
	ИзвестныеЯзыки = Новый Соответствие;
	Разыменователь = Новый РазыменовательПространствИменDOM(ДокументDOM);
	РезультатXPath = ДокументDOM.ВычислитьВыражениеXPath("/xmlns:MetaDataObject/xmlns:Configuration/xmlns:ChildObjects/xmlns:Language", ДокументDOM, Разыменователь);
	Пока Истина Цикл
		ЭлементDOM = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOM = Неопределено Тогда
			Прервать;
		КонецЕсли;
		ИмяЯзыка = ВРег(СокрЛП(ЭлементDOM.ТекстовоеСодержимое));
		Если ИзвестныеЯзыки[ИмяЯзыка] = Неопределено Тогда
			ИзвестныеЯзыки.Вставить(ИмяЯзыка, Истина);
		Иначе
			РодительскийУзел = ЭлементDOM.РодительскийУзел;
			РодительскийУзел.УдалитьДочерний(ЭлементDOM);
			XMLИзменен = Истина;
			ЗаписатьВЛог(Контекст, 3, СтрШаблон("ru = 'Удален дубль языка %1.'", ЭлементDOM.ТекстовоеСодержимое));
		КонецЕсли;
	КонецЦикла;
	
	Если Не XMLИзменен Тогда
		ЗаписатьВЛог(Контекст, 3, СтрШаблон("ru = 'В %1 не найдено дублей языков.'", ПолноеИмяОшибочногоXML));
		Возврат Ложь;
	КонецЕсли;
	
	ЗаписатьВЛог(Контекст, 3, СтрШаблон("ru = 'Сохранение изменений в %1.'", ПолноеИмяОшибочногоXML));
	ОбщегоНазначения.ЗаписатьДокументDOM(ДокументDOM, ПолноеИмяОшибочногоXML);
	Возврат Истина;
КонецФункции

Функция УдалитьДублиФорм(Контекст, ПолноеИмяОшибочногоXML) Экспорт
	ДокументDOM = ОбщегоНазначения.ДокументDOM(ПолноеИмяОшибочногоXML);
	Если ДокументDOM = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗаписатьВЛог(Контекст, 3, СтрШаблон("ru = 'Начало поиска дублей форм в %1.'", ПолноеИмяОшибочногоXML));
	
	XMLИзменен = Ложь;
	ИзвестныеФормы = Новый Соответствие;
	Разыменователь = Новый РазыменовательПространствИменDOM(ДокументDOM);
	РезультатXPath = ДокументDOM.ВычислитьВыражениеXPath("//xmlns:ChildObjects/xmlns:Form", ДокументDOM, Разыменователь);
	Пока Истина Цикл
		ЭлементDOM = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOM = Неопределено Тогда
			Прервать;
		КонецЕсли;
		ИмяФормы = ВРег(СокрЛП(ЭлементDOM.ТекстовоеСодержимое));
		Если ИзвестныеФормы[ИмяФормы] = Неопределено Тогда
			ИзвестныеФормы.Вставить(ИмяФормы, Истина);
		Иначе
			РодительскийУзел = ЭлементDOM.РодительскийУзел;
			РодительскийУзел.УдалитьДочерний(ЭлементDOM);
			XMLИзменен = Истина;
			ЗаписатьВЛог(Контекст, 3, СтрШаблон("ru = 'Удален дубль формы %1.'", ЭлементDOM.ТекстовоеСодержимое));
		КонецЕсли;
	КонецЦикла;
	
	Если Не XMLИзменен Тогда
		ЗаписатьВЛог(Контекст, 3, СтрШаблон("ru = 'В %1 не найдено дублей форм.'", ПолноеИмяОшибочногоXML));
		Возврат Ложь;
	КонецЕсли;
	
	ЗаписатьВЛог(Контекст, 3, СтрШаблон("ru = 'Сохранение изменений в %1.'", ПолноеИмяОшибочногоXML));
	ОбщегоНазначения.ЗаписатьДокументDOM(ДокументDOM, ПолноеИмяОшибочногоXML);
	Возврат Истина;
КонецФункции

Функция ИсправитьЭлементыФорм(Контекст, ПолноеИмяОшибочногоXML) Экспорт
	ДокументDOM = ОбщегоНазначения.ДокументDOM(ПолноеИмяОшибочногоXML);
	Если ДокументDOM = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Текст = СтрШаблон("ru = 'Начало поиска некорректных свойств элементов формы %1.'", ПолноеИмяОшибочногоXML);
	ЗаписатьВЛог(Контекст, 3, Текст);
	
	XMLИзменен = Ложь;
	Разыменователь = Новый РазыменовательПространствИменDOM(ДокументDOM);
	РезультатXPath = ДокументDOM.ВычислитьВыражениеXPath("//xmlns:ViewStatusLocation[text()='1']", ДокументDOM, Разыменователь);
	Пока Истина Цикл
		ЭлементDOM = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOM = Неопределено Тогда
			Прервать;
		КонецЕсли;
		РодительскийУзел = ЭлементDOM.РодительскийУзел;
		РодительскийУзел.УдалитьДочерний(ЭлементDOM);
		XMLИзменен = Истина;
		ЗаписатьВЛог(Контекст, 3, "ru = 'Удалено некорректное свойство формы ViewStatusLocation = 1.'");
	КонецЦикла;
	
	Если Не XMLИзменен Тогда
		Текст = СтрШаблон("ru = 'В %1 не найдено некорректных свойств элементов формы.'", ПолноеИмяОшибочногоXML);
		ЗаписатьВЛог(Контекст, 3, Текст);
		Возврат Ложь;
	КонецЕсли;
	
	ЗаписатьВЛог(Контекст, 3, СтрШаблон("ru = 'Сохранение изменений в %1.'", ПолноеИмяОшибочногоXML));
	ОбщегоНазначения.ЗаписатьДокументDOM(ДокументDOM, ПолноеИмяОшибочногоXML);
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область ОчисткаОтМусора

// Находит версии с ошибками не достигшие предельного количества ошибок и сбрасывает их состояние.
Процедура СброситьСостоянияВерсийСОшибками(МаксимальноеКоличествоОшибокВерсии = Неопределено) Экспорт
	Если ТипЗнч(МаксимальноеКоличествоОшибокВерсии) <> Тип("Число") Тогда
		МаксимальноеКоличествоОшибокВерсии = МаксимальноеКоличествоОшибокВерсии();
	КонецЕсли;
	Если МаксимальноеКоличествоОшибокВерсии = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Поиск версий, завершившихся с ошибками.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 10
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.Код КАК Код,
	|	Таблица.ПометкаУдаления КАК ПометкаУдаления,
	|	Таблица.Владелец КАК Владелец,
	|	Таблица.КоличествоОшибок КАК КоличествоОшибок,
	|	Таблица.ВыгруженыТолькоИзменения КАК ВыгруженыТолькоИзменения,
	|	Таблица.ТребуетсяПолнаяВыгрузка КАК ТребуетсяПолнаяВыгрузка,
	|	Таблица.ВозниклаОшибка КАК ВозниклаОшибка,
	|	Таблица.Состояние КАК Состояние,
	|	Таблица.ТекстОшибки КАК ТекстОшибки
	|ИЗ
	|	Справочник.ВерсииХранилища КАК Таблица
	|ГДЕ
	|	Таблица.ВозниклаОшибка
	|	И Таблица.КоличествоОшибок < &МаксимальноеКоличествоОшибокВерсии
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	Запрос.УстановитьПараметр("МаксимальноеКоличествоОшибокВерсии", МаксимальноеКоличествоОшибокВерсии);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураРеквизитов = Новый Структура("Состояние,ВозниклаОшибка,ВыгруженыТолькоИзменения,ТребуетсяПолнаяВыгрузка");
		СтруктураРеквизитов.ВозниклаОшибка = Ложь;
		СтруктураРеквизитов.ВыгруженыТолькоИзменения = Ложь;
		// Полная выгрузка включается с 3й попытки обработки версии.
		СтруктураРеквизитов.ТребуетсяПолнаяВыгрузка = (Выборка.КоличествоОшибок >= 2) Или Выборка.ТребуетсяПолнаяВыгрузка;
		
		Если Выборка.Состояние = Перечисления.СостоянияВерсии.ВыгружаетсяВXML
			И (СтрНайти(Выборка.ТекстОшибки, "Структура информационной базы несовместима") > 0
			Или СтрНайти(Выборка.ТекстОшибки, "Структура информационной базы не совместима") > 0) Тогда
			
			// Битый CF - требуется повторное получение из хранилища.
			СтруктураРеквизитов.Состояние = Перечисления.СостоянияВерсии.ПустаяСсылка();
			
		ИначеЕсли Выборка.КоличествоОшибок >= 4 // CF переполучается с 5й попытки обработки версии.
			Или Выборка.Состояние = Перечисления.СостоянияВерсии.ПолучаетсяCF
			Или Выборка.Состояние = Перечисления.СостоянияВерсии.ПолученCF Тогда
			
			// Ошибка повторяется, требуется полная перепроверка.
			СтруктураРеквизитов.Состояние = Перечисления.СостоянияВерсии.ПустаяСсылка();
			
		ИначеЕсли Выборка.КоличествоОшибок >= 2
			Или Выборка.Состояние = Перечисления.СостоянияВерсии.ВыгружаетсяВXML
			Или Выборка.Состояние = Перечисления.СостоянияВерсии.ВыгруженаВXML Тогда
			
			// Сбой выгрузки XML.
			СтруктураРеквизитов.Состояние = Перечисления.СостоянияВерсии.ПолученCF;
			
		ИначеЕсли Выборка.Состояние = Перечисления.СостоянияВерсии.ЗагружаетсяВEDT
			Или Выборка.Состояние = Перечисления.СостоянияВерсии.ЗагруженаВEDT
			Или Выборка.Состояние = Перечисления.СостоянияВерсии.ПомещаетсяВGit
			Или Выборка.Состояние = Перечисления.СостоянияВерсии.ПомещенаВGit Тогда
			
			// Сбой загрузки в EDT или помещения в Git.
			СтруктураРеквизитов.Состояние = Перечисления.СостоянияВерсии.ВыгруженаВXML;
			
		Иначе
			СтруктураРеквизитов.Состояние = Перечисления.СостоянияВерсии.ПустаяСсылка();
		КонецЕсли;
		
		Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(Выборка.Ссылка, СтруктураРеквизитов);
		
	КонецЦикла;
КонецПроцедуры

// Очищает версии хранилищ с флажком "УдалятьВременныеДанныеВерсииПослеКоммита".
Процедура ОчиститьВерсииПослеКоммитов() Экспорт
	
	// Запрос в цикле - проектное решение.
	// Количество удаляемых файлов может быть большим, удаление может занять продолжительное время.
	// За это время картина в базе данных может измениться, могут появиться новые версии требующие очистки.
	// Поэтому очистка выполняется циклом по хранилищам, для каждого хранилища выбирается до 10 версий за проход.
	ОтборХранилищ = Новый Структура("ПометкаУдаления, УдалятьВременныеДанныеВерсииПослеКоммита", Ложь, Истина);
	АктивныеХранилища = Справочники.ХранилищаКонфигураций.ЗапросПоЭлементам(ОтборХранилищ).Выполнить().Выгрузить();
	Для Каждого РеквизитыХранилища Из АктивныеХранилища Цикл
		ОтборВерсий = Новый Структура;
		ОтборВерсий.Вставить("Владелец", РеквизитыХранилища.Ссылка);
		ОтборВерсий.Вставить("ПерваяВерсия", РеквизитыХранилища.ПерваяВерсия);
		ОтборВерсий.Вставить("ПоследняяВерсия", РеквизитыХранилища.ПоследняяВерсия);
		ОтборВерсий.Вставить("КаталогВременныхФайловУказан", Истина);
		ОтборВерсий.Вставить("Состояние", Перечисления.СостоянияВерсии.ПомещенаВGit);
		
		Запрос = Справочники.ВерсииХранилища.ЗапросПоЭлементам(ОтборВерсий, "Код", 10);
		
		ВерсииДляОчисткиФайлов = Запрос.Выполнить().Выгрузить();
		ВГраница = ВерсииДляОчисткиФайлов.Количество() - 1;
		Для Индекс = 0 По ВГраница Цикл
			ПараметрыВерсии = ВерсииДляОчисткиФайлов[Индекс];
			ДопСвойства = Новый Структура("ОчищатьКаталогВерсииВТекущемСеансе", Истина);
			Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(ПараметрыВерсии.Ссылка, Новый Структура, ДопСвойства);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Убийство зависших заданий.
Процедура ЗавершитьЗависшиеПроцессы(МаксимальноеКоличествоОшибокВерсии = Неопределено, МинутДоПринудительнойОстановки = Неопределено, МинутДоПроверкиЗависания = Неопределено) Экспорт
	Если ТипЗнч(МаксимальноеКоличествоОшибокВерсии) <> Тип("Число") Тогда
		МаксимальноеКоличествоОшибокВерсии = МаксимальноеКоличествоОшибокВерсии();
	КонецЕсли;
	Если ТипЗнч(МинутДоПринудительнойОстановки) <> Тип("Число") Тогда
		МинутДоПринудительнойОстановки = МинутДоПринудительнойОстановки();
	КонецЕсли;
	Если ТипЗнч(МинутДоПроверкиЗависания) <> Тип("Число") Тогда
		МинутДоПроверкиЗависания = МинутДоПроверкиЗависания();
	КонецЕсли;
	ДатаРаньшеКоторойПроцессСчитаетсяЗависшим = ТекущаяДата() - 60*МинутДоПринудительнойОстановки;
	ДатаРаньшеКоторойПроверяетсяНаличиеСеанса = ТекущаяДата() - 60*МинутДоПроверкиЗависания;
	БлижайшаяДата = Макс(ДатаРаньшеКоторойПроцессСчитаетсяЗависшим, ДатаРаньшеКоторойПроверяетсяНаличиеСеанса);
	
	Отбор = Новый Структура("ДатаНачалаОбработкиМеньшеИлиРавно", БлижайшаяДата);
	Запрос = Справочники.ВерсииХранилища.ЗапросПоЭлементам(Отбор, "Код", 10);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗавершитьПринудительно = (Выборка.ДатаНачалаОбработки < ДатаРаньшеКоторойПроцессСчитаетсяЗависшим);
		ПроверитьНаличиеСеанса = Не ЗавершитьПринудительно И (Выборка.ДатаНачалаОбработки < ДатаРаньшеКоторойПроверяетсяНаличиеСеанса);
		Если Не ПроверитьНаличиеСеанса И СеансВерсииЕщеЗапущен(Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		Если Выборка.КоличествоОшибок > МаксимальноеКоличествоОшибокВерсии Тогда
			
			// Количество ошибок превысило лимит.
			// Включение флажка "ВозниклаОшибка" и остановка без снятия процессов.
			Если Не Выборка.ВозниклаОшибка Тогда
				СтруктураРеквизитов = Новый Структура("ВозниклаОшибка");
				СтруктураРеквизитов.ВозниклаОшибка = Истина;
				Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(Выборка.Ссылка, СтруктураРеквизитов);
			КонецЕсли;
			
		Иначе
			
			// Увеличение счетчика ошибок и очистка состояния (отключение флажка ВозниклаОшибка).
			Если Не Выборка.ВозниклаОшибка Тогда
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Состояние ""%1"" длится дольше %4 минут (запуск: %2, сейчас: %3).
					|Согласно настройкам считается что процесс завис. У версии включен флажок ошибки.
					|Дальше сборщик мусора сбросит ее состояние и удалит лишние файлы.'"),
					Выборка.Состояние,
					Выборка.ДатаНачалаОбработки,
					ТекущаяДата(),
					МинутДоПринудительнойОстановки);
				Справочники.ВерсииХранилища.ВозниклаОшибка(Выборка.Ссылка, ТекстОшибки);
			КонецЕсли;
			
			// Поиск и снятие всех процессов, которые относятся к версии.
			КаталогВременныхФайловВерсии = Выборка.КаталогВременныхФайлов;
			Если ЗначениеЗаполнено(КаталогВременныхФайловВерсии) Тогда
				// На актуальности списка запущенных процессов лучше не экономить
				// и получать его перед "срубанием" каждой версии.
				ЗапущенныеПроцессы = ПроцессыСервера.ЗапущенныеПроцессы();
				Для Каждого ОписаниеПроцесса Из ЗапущенныеПроцессы Цикл
					Если СтрНайти(ОписаниеПроцесса.КоманднаяСтрока, КаталогВременныхФайловВерсии) > 0 Тогда
						ПроцессыСервера.ЗавершитьЗависшийПроцесс(КаталогВременныхФайловВерсии, Выборка.Ссылка, ОписаниеПроцесса);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	// Убийство зависших java.exe.
	ОтборХранилищ = Новый Структура("ПометкаУдаления", Ложь);
	КонвертируемыеХранилища = Справочники.ХранилищаКонфигураций.ЗапросПоЭлементам(ОтборХранилищ).Выполнить().Выгрузить();
	Для Каждого РеквизитыХранилища Из КонвертируемыеХранилища Цикл
		ОтборВерсий = Новый Структура;
		ОтборВерсий.Вставить("Владелец", РеквизитыХранилища.Ссылка);
		ОтборВерсий.Вставить("ПерваяВерсия", РеквизитыХранилища.ПерваяВерсия);
		ОтборВерсий.Вставить("ПоследняяВерсия", РеквизитыХранилища.ПоследняяВерсия);
		ОтборВерсий.Вставить("КаталогВременныхФайловУказан", Истина);
		ОтборВерсий.Вставить("Состояние", Перечисления.СостоянияВерсии.ЗагружаетсяВEDT);
		
		Запрос = Справочники.ВерсииХранилища.ЗапросПоЭлементам(ОтборВерсий, "Код", 1);
		
		КонтролируемыеВерсии = Запрос.Выполнить().Выгрузить();
		Для Каждого ДанныеВерсии Из КонтролируемыеВерсии Цикл
			СостояниеВерсии = СостояниеВерсии(ДанныеВерсии.Ссылка);
			Если СостояниеВерсии.Период > ДатаРаньшеКоторойПроцессСчитаетсяЗависшим Тогда
				Продолжить; // Еще не завис.
			КонецЕсли;
			
			Попытка
				// Зависших процессов не больше количества очередей.
				//@skip-check query-in-loop
				Контекст = КонтекстРаботыСВерсией(ДанныеВерсии, РеквизитыХранилища);
			Исключение
				Продолжить;
			КонецПопытки;
			РабочийКаталогEDT = ОбщегоНазначения.УдалитьКонечныйРазделительПути(Контекст.РабочийКаталогEDT);
			
			// Задание зависло. Требуется найти соответствующий процесс java.exe, Снять процесс и перезапустить выгрузку.
			ЗапущенныеПроцессы = ПроцессыСервера.ЗапущенныеПроцессы();
			ПроцессыJava = ЗапущенныеПроцессы.НайтиСтроки(Новый Структура("ИмяВРег", ВРег("java.exe")));
			Если ПроцессыJava.Количество() = 0 Тогда
				ПроцессыJava = ЗапущенныеПроцессы.НайтиСтроки(Новый Структура("ИмяВРег", ВРег("java")));
			КонецЕсли;
			НайденыЗависшиеПроцессы = Ложь;
			Для Каждого ОписаниеПроцесса Из ПроцессыJava Цикл
				Если ОписаниеПроцесса.ДатаНачала < ДатаРаньшеКоторойПроцессСчитаетсяЗависшим
					И СтрНайти(ОписаниеПроцесса.КоманднаяСтрока, "edt workspace import") > 0
					И СтрНайти(ОписаниеПроцесса.КоманднаяСтрока, РабочийКаталогEDT) > 0 Тогда
					НайденыЗависшиеПроцессы = Истина;
					ПроцессыСервера.ЗавершитьЗависшийПроцесс(Контекст.КаталогВременныхФайлов, ДанныеВерсии.Ссылка, ОписаниеПроцесса);
				КонецЕсли;
			КонецЦикла;
			Если НайденыЗависшиеПроцессы Тогда
				Справочники.ВерсииХранилища.ВозниклаОшибка(ДанныеВерсии.Ссылка, НСтр("ru = 'Завис процесс java.'"));
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	// Убийство зависших 1cv8.exe.
	ЗапущенныеПроцессы = ПроцессыСервера.ЗапущенныеПроцессы();
	Для Каждого ОписаниеПроцесса Из ЗапущенныеПроцессы Цикл
		Если ОписаниеПроцесса.ИмяВРег = "1CV8.EXE"
			И ОписаниеПроцесса.ДатаНачала < ДатаРаньшеКоторойПроцессСчитаетсяЗависшим
			И СтрНайти(ОписаниеПроцесса.КоманднаяСтрока, "\bin\1cv8"" /@ """) > 0 Тогда
			Для Каждого РеквизитыХранилища Из КонвертируемыеХранилища Цикл
				Если Не ЗначениеЗаполнено(РеквизитыХранилища.КаталогВыгрузкиВерсий) Тогда
					Продолжить;
				КонецЕсли;
				КаталогВыгрузкиВерсий = ОбщегоНазначения.ПолноеИмяКаталога(РеквизитыХранилища.КаталогВыгрузкиВерсий, Ложь, Ложь);
				Если СтрНайти(НРег(ОписаниеПроцесса.КоманднаяСтрока), НРег(КаталогВыгрузкиВерсий)) > 0 Тогда
					КаталогВременныхФайлов = КаталогВыгрузкиВерсий + ПолучитьРазделительПути() + "Common" + ПолучитьРазделительПути();
					ПроцессыСервера.ЗавершитьЗависшийПроцесс(КаталогВременныхФайлов, РеквизитыХранилища.Ссылка, ОписаниеПроцесса);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает количество ошибок до остановки обработки версии.
Функция МаксимальноеКоличествоОшибокВерсии() Экспорт
	МаксимальноеКоличествоОшибокВерсии = Константы.МаксимальноеКоличествоОшибокВерсии.Получить();
	Если МаксимальноеКоличествоОшибокВерсии = 0 Тогда
		МаксимальноеКоличествоОшибокВерсии = 10;
	КонецЕсли;
	Возврат МаксимальноеКоличествоОшибокВерсии;
КонецФункции

// Возвращает количество секунд до остановки процессов.
Функция МинутДоПринудительнойОстановки() Экспорт
	Результат = Константы.МинутДоПринудительнойОстановки.Получить();
	Если Результат = 0 Тогда
		Результат = 3*60; // По умолчанию - 3 часа ожидания до завершени.
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Возвращает количество секунд до остановки процессов.
Функция МинутДоПроверкиЗависания() Экспорт
	Результат = Константы.МинутДоПроверкиЗависания.Получить();
	Если Результат = 0 Тогда
		Результат = 30; // По умолчанию - 30 минут ожидания до проверки наличия сеансов.
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция СеансВерсииЕщеЗапущен(ВерсияХранилища) Экспорт
	СостояниеВерсии = СостояниеВерсии(ВерсияХранилища);
	Если СостояниеВерсии.НомерСеанса = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Каждого Сеанс Из ПолучитьСеансыИнформационнойБазы() Цикл
		Если Сеанс.НомерСеанса = СостояниеВерсии.НомерСеанса
			И Сеанс.НачалоСеанса = СостояниеВерсии.НачалоСеанса Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Функция СостояниеВерсии(ВерсияХранилища) Экспорт
	СрезПоследних = РегистрыСведений.СостоянияВерсий.СрезПоследних(, Новый Структура("ВерсияХранилища", ВерсияХранилища));
	Если СрезПоследних.Количество() = 0 Тогда
		Результат = СрезПоследних.Добавить();
		Результат.ВерсияХранилища = ВерсияХранилища;
		Результат.Состояние = Перечисления.СостоянияВерсии.ПустаяСсылка();
		Результат.Период = Дата(1,1,1);
		Результат.НомерСеанса = 0;
		Результат.НачалоСеанса = Дата(1,1,1);
		Возврат Результат;
	Иначе
		Возврат СрезПоследних[0];
	КонецЕсли;
КонецФункции

// Удаляет временные файлы версии которые использовались для конвертации в формат EDT.
//   Оставляет только файл лога коммита в git для истории.
Функция ОчиститьКаталогВременныхФайловВерсии(ПараметрыВерсии, ПараметрыХранилища) Экспорт
	Если Не ЗначениеЗаполнено(ПараметрыВерсии.КаталогВременныхФайлов) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВсеКаталогиОчищены = Истина;
	
	// Удаление каталога версии.
	Попытка
		УдалитьФайлы(ПараметрыВерсии.КаталогВременныхФайлов);
	Исключение
		ВсеКаталогиОчищены = Ложь;
		ОбщегоНазначения.ЗаписатьОшибку(
			"ru = 'Очистка каталога файлов версии'",
			ИнформацияОбОшибке(),
			ПараметрыВерсии.Ссылка);
	КонецПопытки;
	
	// Удаление "внешних" файлов Git.
	Попытка
		Каталог = Новый Файл(ПараметрыВерсии.КаталогВременныхФайлов);
		Для Каждого НайденныйФайл Из НайтиФайлы(Каталог.Путь, Каталог.Имя + "*", Ложь) Цикл
			Если СтрНайти(НайденныйФайл.Имя, "_git_log") = 0 Тогда
				ОбщегоНазначения.УдалитьФайлИлиКаталог(НайденныйФайл.ПолноеИмя);
			КонецЕсли;
		КонецЦикла;
	Исключение
		ВсеКаталогиОчищены = Ложь;
		ОбщегоНазначения.ЗаписатьОшибку(
			"ru = 'Очистка файлов Git'",
			ИнформацияОбОшибке(),
			ПараметрыВерсии.Ссылка);
	КонецПопытки;
	
	// Удаление кэшей 1С.
	Если ПолучитьФункциональнуюОпцию("ДобавлятьВременныеБазыВСписок") Тогда
		Попытка
			// https://its.1c.ru/db/v8327doc#bookmark:adm:TI000000368
			КаталогAppData = ОбщегоНазначения.СистемныйКаталог(26);
			КаталогLocalAppData = ОбщегоНазначения.СистемныйКаталог(28);
			Если ЗначениеЗаполнено(КаталогAppData) Тогда
				Если Не ЗначениеЗаполнено(КаталогLocalAppData) Тогда
					КаталогLocalAppData = КаталогAppData;
				КонецЕсли;
				
				КолонкиФайлаБаз = Новый Структура;
				КолонкиФайлаБаз.Вставить("ID", "Идентификатор");
				НайденныеФайлы = НайтиФайлы(КаталогAppData, "ibases.v8i", Истина);
				Для Каждого ФайлСпискаИБ Из НайденныеФайлы Цикл
					
					ТаблицаБаз = ОбщегоНазначения.ТаблицаИзIniФайла(ФайлСпискаИБ.ПолноеИмя, "UTF-8", КолонкиФайлаБаз);
					Для Каждого СтрокаТаблицыБаз Из ТаблицаБаз Цикл
						Если СтрНачинаетсяС(СтрокаТаблицыБаз.СекцияНРег, НРег(ПараметрыВерсии.КаталогВременныхФайлов)) Тогда
							НайденныеКаталоги = НайтиФайлы(КаталогLocalAppData, СтрокаТаблицыБаз.Идентификатор, Истина);
							Для Каждого НайденныйКаталог Из НайденныеКаталоги Цикл
								ОбщегоНазначения.УдалитьФайлИлиКаталог(НайденныйКаталог.ПолноеИмя);
							КонецЦикла;
							НайденныеКаталоги = НайтиФайлы(КаталогAppData, СтрокаТаблицыБаз.Идентификатор, Истина);
							Для Каждого НайденныйКаталог Из НайденныеКаталоги Цикл
								ОбщегоНазначения.УдалитьФайлИлиКаталог(НайденныйКаталог.ПолноеИмя);
							КонецЦикла;
							ОбщегоНазначения.УдалитьСекциюIniФайла(ФайлСпискаИБ.ПолноеИмя, СтрокаТаблицыБаз.Секция, "UTF-8", Ложь);
						КонецЕсли;
					КонецЦикла;
					
				КонецЦикла;
			КонецЕсли;
		Исключение
			ВсеКаталогиОчищены = Ложь;
			ОбщегоНазначения.ЗаписатьОшибку(
				"ru = 'Очистка временных баз версии'",
				ИнформацияОбОшибке(),
				ПараметрыВерсии.Ссылка);
		КонецПопытки;
	КонецЕсли;
	
	Возврат ВсеКаталогиОчищены;
КонецФункции

#КонецОбласти

#Область Параметры

// Компонует все параметры версии в одну структуру для работы с версией хранилища.
//
// Параметры:
//   ПараметрыВерсии - Структура, СтрокаТаблицыЗначений - Значения реквизитов версии хранилища.
//   Хранилище - СправочникСсылка.ХранилищаКонфигураций, СтрокаТаблицыЗначений, Структура - Реквизиты хранилища.
//
// Возвращаемое значение:
//   Структура - Контекст работы с версией хранилища.
//
Функция КонтекстРаботыСВерсией(ПараметрыВерсии, Хранилище) Экспорт
	Если ТипЗнч(ПараметрыВерсии) = Тип("СтрокаТаблицыЗначений") Тогда
		ПараметрыВерсии = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ПараметрыВерсии);
	КонецЕсли;
	
	// Параметры версии.
	Контекст = ОбщегоНазначения.СкопироватьСтруктуру(ПараметрыВерсии);
	
	// Параметры хранилища.
	ПараметрыХранилища = ПараметрыХранилища(Хранилище);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Контекст, ПараметрыХранилища, Ложь);
	
	// Аутентификация хранилища.
	Контекст.Вставить("АдресХранилища", ПараметрыХранилища.Адрес);
	Контекст.Вставить("Владелец", ПараметрыХранилища.Ссылка);
	
	ДополнитьКонтекстРаботыСВерсией(Контекст);
	
	Возврат Контекст;
КонецФункции

// Добавляет в структуру контекста прочие каталоги.
Процедура ДополнитьКонтекстРаботыСВерсией(Контекст) Экспорт
	Разделитель = ПолучитьРазделительПути();
	
	// Каталоги версии.
	Контекст.КаталогВыгрузкиВерсий = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Контекст.КаталогВыгрузкиВерсий);
	
	Если Не ЗначениеЗаполнено(Контекст.КаталогВременныхФайлов) Тогда
		ИмяПодкаталога = ?(ТипЗнч(Контекст.Код) = Тип("Число"), Формат(Контекст.Код, "ЧДЦ=; ЧГ=0"), СокрЛП(Контекст.Код));
		Контекст.Вставить("КаталогВременныхФайлов", Контекст.КаталогВыгрузкиВерсий + ИмяПодкаталога);
	КонецЕсли;
	Контекст.КаталогВременныхФайлов = ОбщегоНазначения.ПолноеИмяКаталога(Контекст.КаталогВременныхФайлов, Истина, Истина);
	
	Контекст.Вставить("КаталогВыгрузкиВXML", Контекст.КаталогВременныхФайлов + "dump" + Разделитель);
	
	// https://its.1c.ru/db/edtdoc#content:10330:hdoc
	// В рабочей области хранится часть настроек EDT.
	Контекст.Вставить("РабочийКаталогEDT", Контекст.КаталогВременныхФайлов + "ws" + Разделитель);
	
	// Каталог проекта, в который следует импортировать проект в формате 1C:EDT.
	Контекст.Вставить("КаталогПроектаEDT", Контекст.КаталогВременныхФайлов + "p" + Разделитель);
	
	Контекст.Вставить("КаталогИсходниковEDT", Контекст.КаталогПроектаEDT + "src" + Разделитель);
	Контекст.Вставить("КаталогИБ", Контекст.КаталогВременныхФайлов + "db" + Разделитель);
	
	// Включение логирование с 3й ошибки.
	Если Контекст.ОтключитьЛогирование И Контекст.КоличествоОшибок > 1 Тогда
		Контекст.ОтключитьЛогирование = Ложь;
	КонецЕсли;
	
	// Файлы состояния версии.
	ПрефиксИмениФайла = Перечисления.СостоянияВерсии.ПрефиксИмениФайла(Контекст.Состояние);
	Контекст.Вставить("ПрефиксФайлов", Контекст.КаталогВременныхФайлов + ПрефиксИмениФайла);
	Контекст.Вставить("ИмяФайлаЛога", ОбщегоНазначения.ИмяФайлаЛога(Контекст.КаталогВременныхФайлов, ПрефиксИмениФайла));
	
	// Очистка лога от предшествующего запуска.
	ОбщегоНазначения.УдалитьФайлИлиКаталог(Контекст.ИмяФайлаЛога);
КонецПроцедуры

// Добавляет в структуру контекста прочие каталоги.
Процедура ДополнитьКонтекстПараметрамиКоммитаВGit(Контекст) Экспорт
	
	// Email и псевдоним коммиттера для Git.
	Информация = КонвертацияХранилищаПовтИсп.ИнформацияОПользователе(Контекст.Владелец, Контекст.Пользователь);
	Контекст.Вставить("ПользовательEMail", Информация.Email);
	Контекст.Вставить("ПользовательИмяGit", Информация.ИмяGit);
	
	// Email и псевдоним автора для Git.
	ЕстьАвтор = ЗначениеЗаполнено(Контекст.Автор) И СтрСравнить(Контекст.Пользователь, Контекст.Автор) <> 0;
	Контекст.Вставить("ЕстьАвтор", ЕстьАвтор);
	Если ЕстьАвтор Тогда
		Информация = КонвертацияХранилищаПовтИсп.ИнформацияОПользователе(Контекст.Владелец, Контекст.Автор);
		Контекст.Вставить("АвторEmail", Информация.Email);
		Контекст.Вставить("АвторИмяGit", Информация.ИмяGit);
	КонецЕсли;
	
	// Файлы Git.
	КаталогВременныхФайловБезСлеша = ОбщегоНазначения.УдалитьКонечныйРазделительПути(Контекст.КаталогВременныхФайлов);
	Контекст.Вставить("ФайлЛогаGit", ПолноеИмяФайлаЛогаGit(КаталогВременныхФайловБезСлеша));
	Контекст.Вставить("ФайлКомандыGit", КаталогВременныхФайловБезСлеша
		+ ?(ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер(), "_git_command.bat", "_git_command.sh"));
	Контекст.Вставить("ФайлКомментарияGit", КаталогВременныхФайловБезСлеша + "_git_comment.txt");
	
КонецПроцедуры

// Возвращает строку - полное имя файла лога Git.
Функция ПолноеИмяФайлаЛогаGit(КаталогВременныхФайловБезСлеша) Экспорт
	Возврат КаталогВременныхФайловБезСлеша + "_git_log.txt";
КонецФункции

// Получает параметры хранилища в виде структуры.
//
// Параметры:
//   Хранилище - СправочникСсылка.ХранилищаКонфигураций, СтрокаТаблицыЗначений, Структура - Реквизиты хранилища.
//
// Возвращаемое значение:
//   Структура - Параметры хранилища.
//
Функция ПараметрыХранилища(Хранилище) Экспорт
	Если ТипЗнч(Хранилище) = Тип("СправочникСсылка.ХранилищаКонфигураций") Тогда
		Запрос = Справочники.ХранилищаКонфигураций.ЗапросПоЭлементам(Новый Структура("Ссылка", Хранилище), , 1);
		Таблица = Запрос.Выполнить().Выгрузить();
		Если Таблица.Количество() > 0 Тогда
			ПараметрыХранилища = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Таблица[0]);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Хранилище) = Тип("СтрокаТаблицыЗначений") Тогда
		ПараметрыХранилища = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Хранилище);
	ИначеЕсли ТипЗнч(Хранилище) = Тип("Структура") Тогда
		ПараметрыХранилища = Хранилище;
		Если ПараметрыХранилища.Свойство("КаталогGitПроектаEDT") Тогда
			Возврат ПараметрыХранилища;
		КонецЕсли;
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип первого параметра Хранилище: %1'"), Строка(ТипЗнч(Хранилище)));
	КонецЕсли;
	
	КаталогВыгрузкиВерсий = ОбщегоНазначения.ПолноеИмяКаталога(ПараметрыХранилища.КаталогВыгрузкиВерсий, Истина, Ложь);
	
	// Путь к папке репозитория Git: "</path_to_git>/".
	ЛокальныйКаталогGit = ОбщегоНазначения.ПолноеИмяКаталога(ПараметрыХранилища.ЛокальныйКаталогGit, Истина, Ложь);
	
	// Путь к папке проекта в репозитории Git: "<ProjectName>/".
	ОтносительноеИмяКаталогаПроектаEDT = ПараметрыХранилища.ИмяПроектаEDT + ПолучитьРазделительПути();
	
	// Путь к проекту в репозитории: "</path_to_git>/<ProjectName>/.
	КаталогGitПроектаEDT = ЛокальныйКаталогGit + ОтносительноеИмяКаталогаПроектаEDT;
	
	// Путь к папке src в репозитории Git: "<ProjectName>/src/".
	ОтносительноеИмяКаталогаGitИсходниковEDT = ОтносительноеИмяКаталогаПроектаEDT + "src" + ПолучитьРазделительПути();
	
	// Путь к файлам конфигурации проекта в репозитории: "</path_to_git>/<ProjectName>/src/.
	КаталогGitИсходниковEDT = ЛокальныйКаталогGit + ОтносительноеИмяКаталогаGitИсходниковEDT;
	
	ПараметрыХранилища.КаталогВыгрузкиВерсий = КаталогВыгрузкиВерсий;
	ПараметрыХранилища.ЛокальныйКаталогGit = ЛокальныйКаталогGit;
	ПараметрыХранилища.Вставить("КаталогGitПроектаEDT", КаталогGitПроектаEDT);
	ПараметрыХранилища.Вставить("ОтносительноеИмяКаталогаGitИсходниковEDT", ОтносительноеИмяКаталогаGitИсходниковEDT);
	ПараметрыХранилища.Вставить("КаталогGitИсходниковEDT", КаталогGitИсходниковEDT);
	
	Возврат ПараметрыХранилища;
КонецФункции

// Возвращает полное имя каталога bin платформы используемой при работе с хранилищем.
Функция КаталогПлатформыХранилища(Контекст) Экспорт
	Перем Результат;
	Если Контекст.Свойство("КаталогПлатформыХранилища", Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контекст.ВерсияПлатформыХранилища) Тогда
		ВерсияПлатформыХранилища = Контекст.ВерсияПлатформыХранилища;
	ИначеЕсли ЗначениеЗаполнено(Контекст.ВерсияПлатформы) Тогда
		ВерсияПлатформыХранилища = Контекст.ВерсияПлатформы;
	Иначе
		ВерсияПлатформыХранилища = КонвертацияХранилищаПовтИсп.ВерсияПлатформыПоУмолчанию();
	КонецЕсли;
	
	ШаблонКаталогаПлатформы = ШаблонКаталогаПлатформы(Контекст);
	Результат = СтрЗаменить(ШаблонКаталогаПлатформы, "%ВерсияПлатформы%", ВерсияПлатформыХранилища);
	Результат = ОбщегоНазначения.ПолноеИмяКаталога(Результат, Истина, Ложь);
	
	Если Не ОбщегоНазначения.КаталогСуществует(Результат) Тогда
		ТекстОшибки = НСтр("ru = 'На [ИмяСервера] не найдена платформа [ВерсияПлатформы] по пути [Путь]. Путь, указанный в константе ШаблонКаталогаПлатформы: [ПутьВНастройках].'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[ВерсияПлатформы]", ВерсияПлатформыХранилища);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[ИмяСервера]", ИмяКомпьютера());
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[Путь]", Результат);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[ПутьВНастройках]", ШаблонКаталогаПлатформы);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Контекст.Вставить("КаталогПлатформыХранилища", Результат);
	Возврат Результат;
КонецФункции

// Возвращает полное имя каталога bin платформы используемой при выгрузке в XML.
Функция КаталогПлатформыВыгрузкиXML(Контекст) Экспорт
	Перем Результат;
	Если Контекст.Свойство("КаталогПлатформыВыгрузкиXML", Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВерсияПлатформы = ВерсияПлатформыВыгрузкиXML(Контекст);
	
	ШаблонКаталогаПлатформы = ШаблонКаталогаПлатформы(Контекст);
	Результат = СтрЗаменить(ШаблонКаталогаПлатформы, "%ВерсияПлатформы%", ВерсияПлатформы);
	Результат = ОбщегоНазначения.ПолноеИмяКаталога(Результат, Истина, Ложь);
	
	Если Не ОбщегоНазначения.КаталогСуществует(Результат) Тогда
		ТекстОшибки = НСтр("ru = 'На [ИмяСервера] не найдена платформа [ВерсияПлатформы] по пути [Путь]. Путь, указанный в константе ШаблонКаталогаПлатформы: [ПутьВНастройках].'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[ВерсияПлатформы]", ВерсияПлатформы);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[ИмяСервера]", ИмяКомпьютера());
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[Путь]", Результат);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "[ПутьВНастройках]", ШаблонКаталогаПлатформы);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Контекст.Вставить("КаталогПлатформыВыгрузкиXML", Результат);
	Возврат Результат;
КонецФункции

// Возвращает версию платформы используемую при выгрузке в XML.
Функция ВерсияПлатформыВыгрузкиXML(Контекст) Экспорт
	Если ЗначениеЗаполнено(Контекст.ВерсияПлатформы) Тогда
		Возврат Контекст.ВерсияПлатформы;
	ИначеЕсли ЗначениеЗаполнено(Контекст.ВерсияПлатформыХранилища) Тогда
		Возврат Контекст.ВерсияПлатформыХранилища;
	Иначе
		Возврат КонвертацияХранилищаПовтИсп.ВерсияПлатформыПоУмолчанию();
	КонецЕсли;
КонецФункции

// Возвращает шаблон полного имени каталога bin платформы. В шаблоне присутствует параметр %ВерсияПлатформы%.
Функция ШаблонКаталогаПлатформы(Контекст = Неопределено) Экспорт
	Перем Результат;
	Если Контекст <> Неопределено И Контекст.Свойство("ШаблонКаталогаПлатформы", Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Константы.ШаблонКаталогаПлатформы.Получить();
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ШаблонКаталогаПлатформыПоУмолчанию();
	КонецЕсли;
	
	Если Контекст <> Неопределено Тогда
		Контекст.Вставить("ШаблонКаталогаПлатформы", Результат);
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Возвращает шаблон полного имени каталога bin платформы по умолчанию (на основе каталога текущего приложения).
Функция ШаблонКаталогаПлатформыПоУмолчанию() Экспорт
	ТекущаяВерсия = ОбщегоНазначения.ВерсияПлатформы();
	КаталогПрограммы = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(КаталогПрограммы());
	Возврат СтрЗаменить(КаталогПрограммы, ТекущаяВерсия, "%ВерсияПлатформы%");
КонецФункции

// Формирует имя базового проекта расширения для EDT.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
// Возвращаемое значение:
//   Строка - Имя базового проекта расширения для EDT.
//
Функция ИмяБазовогоПроектаРасширения(Контекст) Экспорт
	Перем Результат;
	Если Контекст.Свойство("ИмяБазовогоПроектаРасширения", Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	Если Контекст.ТипХранилища <> Перечисления.ТипыХранилищаКонфигураций.Расширение Тогда
		Результат = "";
	ИначеЕсли ТипЗнч(Контекст.БазовыйПроект) = Тип("СправочникСсылка.ХранилищаКонфигураций") 
		И ЗначениеЗаполнено(Контекст.БазовыйПроект) Тогда
		ИмяПроектаEDT = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контекст.БазовыйПроект, "ИмяПроектаEDT");
		СегментыПути = СтрРазделить(ИмяПроектаEDT, ПолучитьРазделительПути());
		Если СегментыПути.Количество() > 0 Тогда
			Результат = СегментыПути[СегментыПути.ВГраница()];
		Иначе
			Результат = ИмяПроектаEDT;
		КонецЕсли;
	Иначе
		Результат = Строка(Контекст.БазовыйПроект);
	КонецЕсли;
	Контекст.Вставить("ИмяБазовогоПроектаРасширения", Результат);
	Возврат Результат;
КонецФункции

// Поднимает исключение в контексте текущего состояния версии хранилища. Прикладывает к сообщению лог, если есть.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
Процедура ВызватьИсключениеПриОбработкеВерсии(Контекст) Экспорт
	Если Контекст.Код = "Common" Тогда
		ТекстОшибки = НСтр("ru = 'Хранилище %1: При выполнении операции %2 возникла ошибка.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Контекст.Владелец, Контекст.Состояние);
	Иначе
		ТекстОшибки = НСтр("ru = 'Версия %1: При выполнении операции %2 возникла ошибка.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Контекст.Код, Контекст.Состояние);
	КонецЕсли;
	
	Если Контекст.ОтключитьЛогирование Или Не ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		ТекстОшибки = ТекстОшибки + " "
			+ НСтр("ru = 'Подробнее см. журнал регистрации. Включите логирование и повторите операцию для анализа ошибок.'");
	Иначе
		ТекстОшибки = ТекстОшибки + " "
			+ НСтр("ru = 'Подробнее см. журнал регистрации и лог в %1.
				|
				|--- %1:
				|%2'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Контекст.ИмяФайлаЛога, СтроковыеФункции.СтрокаИзФайла(Контекст.ИмяФайлаЛога));
	КонецЕсли;
	
	ВызватьИсключение ТекстОшибки;
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Получает отчет по коммитам хранилища 1С и загружает его в базу данных (заполняет список версий).
//
// Параметры:
//   Хранилище - СправочникСсылка.ХранилищаКонфигураций
//   ПараметрыХранилища - Структура - См. КонвертацияХранилища.ПараметрыХранилища.
//
Процедура ПостроитьОтчетПоХранилищуИЗаполнитьСписокВерсий(Хранилище, ПараметрыХранилища) Экспорт
	
	ПараметрыВерсии = Справочники.ВерсииХранилища.ПараметрыВерсии(Неопределено);
	ПараметрыВерсии.Состояние = "ReportDB";
	Контекст = КонтекстРаботыСВерсией(ПараметрыВерсии, ПараметрыХранилища);
	
	ОбщегоНазначения.ОчиститьКаталог(Контекст.КаталогВременныхФайлов, Истина);
	
	СоздатьФайловуюИнформационнуюБазу(Контекст);
	
	Контекст.Вставить("СтрокаСоединенияИБ", " /F """ + Контекст.КаталогИБ + """");
	Контекст.Вставить("ИмяПользователяИБ", "");
	Контекст.Вставить("ПарольПользователяИБ", "");
	
	ДобавитьПустоеРасширениеКонфигурации(Контекст);
	
	ПоследняяВерсия = Справочники.ВерсииХранилища.ПоследняяВерсияХранилища(Хранилище);
	
	Контекст.Вставить("ИмяФайлаОтчета", Контекст.КаталогВременныхФайлов + "Report.mxl");
	Контекст.Вставить("ВерсияНачала", ПоследняяВерсия.Код + 1);
	
	СформироватьОтчетПоВерсиямХранилища(Контекст);
	
	Справочники.ВерсииХранилища.ЗагрузитьВерсииИзОтчета(Хранилище, Контекст.ИмяФайлаОтчета);
	
КонецПроцедуры

// Получает версию хранилища в базу.
//
// Параметры:
//   Источник - СправочникСсылка.ХранилищаКонфигураций, СправочникСсылка.КопииХранилищКонфигурации
//       - Хранилище версии.
//   ВерсияХранилища - СправочникСсылка.ВерсииХранилища
//       - Получаемая версия.
//
Функция ПолучитьВерсиюХранилищаВБазу(Источник, ВерсияХранилища)
	Если Константы.КонвертацияОстановлена.Получить() Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Не Справочники.ВерсииХранилища.НачатьОбработкуВерсии(
			ВерсияХранилища,
			Неопределено,
			Перечисления.СостоянияВерсии.ПустаяСсылка(),
			Перечисления.СостоянияВерсии.ПолучаетсяCF,
			Новый Структура("Источник", Источник)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ПараметрыВерсии = Справочники.ВерсииХранилища.ПараметрыВерсии(ВерсияХранилища);
		Контекст = КонтекстРаботыСВерсией(ПараметрыВерсии, ПараметрыВерсии.Владелец);
		
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.КопииХранилищКонфигурации") Тогда
			ИменаРеквизитов = "Адрес, ИмяПользователяХранилища, ПарольПользователяХранилища";
			РеквизитыКопии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, ИменаРеквизитов);
			Контекст.АдресХранилища = РеквизитыКопии.Адрес;
			Если ЗначениеЗаполнено(РеквизитыКопии.ИмяПользователяХранилища) Тогда
				Контекст.ИмяПользователяХранилища = РеквизитыКопии.ИмяПользователяХранилища;
				Контекст.ПарольПользователяХранилища = РеквизитыКопии.ПарольПользователяХранилища;
			КонецЕсли;
		КонецЕсли;
		
		ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Создание базы'"));
		
		СоздатьФайловуюИнформационнуюБазу(Контекст);
		
		Контекст.Вставить("СтрокаСоединенияИБ", "/F """ + Контекст.КаталогИБ + """");
		Контекст.Вставить("ИмяПользователяИБ", "");
		Контекст.Вставить("ПарольПользователяИБ", "");
		
		ДобавитьПустоеРасширениеКонфигурации(Контекст);
		
		ДлительныеОперации.СообщитьПрогресс(20, НСтр("ru = 'Получение версии из хранилища'"));
		
		ОбновитьИнформационнуюБазуИзХранилища(Контекст, Контекст.Код);
		
		ДлительныеОперации.СообщитьПрогресс(90, НСтр("ru = 'Сохранение файла информации выгрузки'"));
		
		Контекст.Вставить("КаталогВыгрузкиВXML", Контекст.КаталогВременныхФайлов);
		СохранитьФайлИнформацииВыгрузки(Контекст);
		
		ДлительныеОперации.СообщитьПрогресс(100, НСтр("ru = 'Версия получена из хранилища'"));
		
		ЗначенияРеквизитов = Новый Структура("Состояние, КоличествоОшибок", Перечисления.СостоянияВерсии.ПолученCF, 0);
		Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(ВерсияХранилища, ЗначенияРеквизитов);
		
	Исключение
		Справочники.ВерсииХранилища.ВозниклаОшибка(ВерсияХранилища, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

// Подбирает версию для обработки очереди выгрузки в XML или загрузки в EDT.
//
// Параметры:
//   ПараметрыХранилища - Структура - См. КонвертацияХранилища.ПараметрыХранилища.
//   ТребуемоеСостояние - ПеречислениеСсылка.СостоянияВерсии - Состояние версии до начала обработки.
//   ПредыдущаяОбработаннаяВерсия - Неопределено, Структура - См. Справочники.ВерсииХранилища.ПараметрыВерсии.
//
// Возвращаемое значение:
//   Неопределено - Версия не найдена.
//   Структура - Версия для обработки. См. Справочники.ВерсииХранилища.ПараметрыВерсии.
//
Функция ВыбратьВерсиюДляОбработки(ПараметрыХранилища, ТребуемоеСостояние, ПредыдущаяОбработаннаяВерсия = Неопределено) Экспорт
	// Самым наилучшим считается последовательная обработка версий по порядку.
	Если ПредыдущаяОбработаннаяВерсия <> Неопределено Тогда
		ПараметрыСледующейВерсииВОчереди = Справочники.ВерсииХранилища.СледующаяВерсия(ПараметрыХранилища.Ссылка, ПредыдущаяОбработаннаяВерсия.Код);
		Если ПараметрыСледующейВерсииВОчереди = Неопределено Тогда
			Возврат Неопределено; // Версия является последней в очереди.
		КонецЕсли;
		Если ПараметрыСледующейВерсииВОчереди.ВозниклаОшибка = Ложь
			И ПараметрыСледующейВерсииВОчереди.Состояние = ТребуемоеСостояние
			И ПараметрыСледующейВерсииВОчереди.Код <> ПредыдущаяОбработаннаяВерсия.Код Тогда
			Возврат ПараметрыСледующейВерсииВОчереди;
		КонецЕсли;
	КонецЕсли;
	
	// Если по порядку версия уже обработана, то подбирается наилучшая версия из списка доступных.
	
	СостояниеПолученCF = Перечисления.СостоянияВерсии.ПолученCF;
	Если ТребуемоеСостояние = СостояниеПолученCF // Это задание по выгрузке в XML.
		И ПараметрыХранилища.ВыгружатьИзменения // В настройках хранилища включен флажок выгрузки изменений.
		Тогда
		
		// Для частичной выгрузки в XML подходящая версия подбираются в соответствии с приоритетом:
		// 1. Версия является первой на очереди выгрузки в XML (перед ней нет других с состоянием = ПолученCF, ВыгружаетсяВXML).
		// 2. Предыдущая версия выгружена в XML (Состояние = ВыгруженаВXML, ЗагружаетсяВEDT, ЗагруженаВEDT).
		// 3. Версия требует полную выгрузку в XML (в соответствии с настройками версии, хранилища и базы).
		// 4. У предыдущей версии выгружен ConfigDumpInfo.xml (Состояние = ПолученCF).
		// 5. Версия требует частичную выгрузку в XML. В этом случае возвращается Неопределено,
		//    т.к. из соображений производительности лучше подождать появления подходящей версии.
		
		Таблица = Справочники.ВерсииХранилища.СостоянияПодготавливаемыхВерсий(ПараметрыХранилища);
		Таблица.Сортировать("Код Возр");
		
		ПараметрыПредыдущейВерсии = Неопределено;
		ЭтоПерваяВыгрузкаВXML = Истина;
		СостояниеВыгружаетсяВXML = Перечисления.СостоянияВерсии.ВыгружаетсяВXML;
		КодПредыдущейПолнойВыгрузкиXML = Неопределено;
		ПерваяВерсияПриоритета3 = Неопределено;
		ПерваяВерсияПриоритета4 = Неопределено;
		СостоянияВКоторыхЕстьXML = Перечисления.СостоянияВерсии.СостоянияВКоторыхЕстьXML();
		
		Для Каждого ПараметрыВерсии Из Таблица Цикл
			Если ПараметрыВерсии.Состояние = СостояниеПолученCF Тогда
				Если ЭтоПерваяВыгрузкаВXML Тогда
					Возврат ПараметрыВерсии; // Приоритет 1 срабатывает только для 1й версии по порядку, его можно возвращать сразу.
				ИначеЕсли СостоянияВКоторыхЕстьXML.Найти(ПараметрыПредыдущейВерсии.Состояние) <> Неопределено Тогда
					Возврат ПараметрыВерсии; // Приоритет 2 тоже можно возвращать сразу, т.к. версии идут по порядку и лучше не найдем.
				ИначеЕсли ПерваяВерсияПриоритета3 = Неопределено
					И ТребуетсяПолнаяВыгрузкаВерсииВXML(ПараметрыВерсии, ПараметрыХранилища, КодПредыдущейПолнойВыгрузкиXML) Тогда
					ПерваяВерсияПриоритета3 = ПараметрыВерсии;
				ИначеЕсли ПерваяВерсияПриоритета4 = Неопределено
					И ЕстьФайлСостоянияПредыдущейВерсии(ПараметрыПредыдущейВерсии) Тогда
					ПерваяВерсияПриоритета4 = ПараметрыВерсии;
				КонецЕсли;
			ИначеЕсли ПараметрыВерсии.Состояние = СостояниеВыгружаетсяВXML Тогда
				ЭтоПерваяВыгрузкаВXML = Ложь;
			КонецЕсли;
			ПараметрыПредыдущейВерсии = ПараметрыВерсии;
		КонецЦикла;
		
		// Версий приоритета 1 и 2 нет.
		Если ПерваяВерсияПриоритета3 <> Неопределено Тогда
			Возврат ПерваяВерсияПриоритета3;
		ИначеЕсли ПерваяВерсияПриоритета4 <> Неопределено Тогда
			Возврат ПерваяВерсияПриоритета4;
		КонецЕсли;
		
		Возврат Неопределено; // Ждем появления подходящих версий (либо вообще нет версий, либо если версии приоритета 5 - см. выше).
	КонецЕсли;
	
	// В остальных случаях выбирается первая по порядку версия с подходящим состоянием.
	// Например, если это задание по загрузке в EDT,
	// либо по выгрузке в XML при условии, что в настройках хранилища НЕ включен флажок выгрузки изменений).
	Отбор = Новый Структура("ВозниклаОшибка, Состояние", Ложь, ТребуемоеСостояние);
	Таблица = Справочники.ВерсииХранилища.СостоянияПодготавливаемыхВерсий(ПараметрыХранилища, Отбор, 1);
	Если Таблица.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Таблица[0];
	
КонецФункции

// Зачитываются реквизиты объекта метаданных из mdo файла
// 
// Параметры:
// 	СтруктураФайла - Структура - параметры файла
// 	КвалифицированныеОбъекты - Структура - список квалифицированных объектов для поиска в файле
// 	ПодчиненныеОбъекты - Массив - список подчиненных объектов
Процедура ПрочитатьСвойстваОбъектаМетаданныхEDT(СтруктураФайла, КвалифицированныеОбъекты, ПодчиненныеОбъекты)

	Попытка

		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(СтруктураФайла.ФайлПолноеИмя);

		Если ЧтениеXML.Прочитать() И СтрНачинаетсяС(ЧтениеXML.Имя, "mdclass:")
				И ЧтениеXML.КоличествоАтрибутов() > 0 Тогда
			Пока ЧтениеXML.ПрочитатьАтрибут() Цикл

				Если ЧтениеXML.Имя = "uuid" Тогда

					СтруктураФайла.Вставить("UUID", ЧтениеXML.Значение);
					Прервать;
				КонецЕсли;
			КонецЦикла;

			Пока ЧтениеXML.Прочитать() Цикл
				Если КвалифицированныеОбъекты.Получить(ЧтениеXML.Имя) <> Неопределено Тогда
					Если ЧтениеXML.КоличествоАтрибутов() > 0 Тогда

						ПодчиненныйОбъект = Новый Структура;
						ПодчиненныйОбъект.Вставить("Тип", ЧтениеXML.Имя);

						Пока ЧтениеXML.ПрочитатьАтрибут() Цикл

							Если ЧтениеXML.Имя = "uuid" Тогда

								ПодчиненныйОбъект.Вставить("UUID", ЧтениеXML.Значение);
								Прервать;
							КонецЕсли;
						КонецЦикла;

						Пока ЧтениеXML.Прочитать()
							И ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл

							Если ЧтениеXML.Имя = "name" Тогда

								ЧтениеXML.Прочитать();
								ПодчиненныйОбъект.Вставить("Имя", ЧтениеXML.Значение);
								ПодчиненныеОбъекты.Добавить(ПодчиненныйОбъект);
								ЧтениеXML.Пропустить();
							Иначе
								ЧтениеXML.Пропустить();
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ЧтениеXML.Закрыть();

	Исключение

	КонецПопытки;

КонецПроцедуры

// Составляет список объектов дополнительных объектов для выгрузки
// 
// Параметры:
// 	ФайлИзменений - ТекстовыйДокумент - Файл с описанием измененений
// 	ИмяФайлаДампа - Строка - Имя файл информации дампа
// Возвращаемое значение:
// 	Массив из Строка - список объектов которые необходимо выгрузить дополнительно
Функция ПолучитьСписокОбъектовДовыгрузки(ТекстИзменений, ИмяФайлаДампа)
	
	СписокОбъектов = Новый Массив;
	
	ВыгруженныеИзменения = Новый Соответствие();
	
	КоличествоСтрок = СтрЧислоСтрок(ТекстИзменений);
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		СтрокаИзменений = СтрПолучитьСтроку(ТекстИзменений, НомерСтроки);
		СтрокаИзменений = СтрЗаменить(СтрокаИзменений, "New:", "");
		СтрокаИзменений = СтрЗаменить(СтрокаИзменений, "Modified:", "");
		СтрокаИзменений = СокрЛП(СтрокаИзменений);
		Если ПустаяСтрока(СтрокаИзменений) Тогда
			Продолжить;
		КонецЕсли;
		Сегменты = СтрРазделить(СтрокаИзменений, ".");
		Если Сегменты.Количество() > 0  И (Сегменты[0] = "Language" ИЛИ Сегменты[0] = "Configuration") Тогда
			Родитель = Сегменты[0];
		ИначеЕсли Сегменты.Количество() > 1 Тогда
			Родитель = Сегменты[0] + "." + Сегменты[1];
		Иначе
			Родитель = СтрокаИзменений;
		КонецЕсли;
		Изменения = ВыгруженныеИзменения.Получить(Родитель);
		Если Изменения = Неопределено Тогда
			Изменения = Новый Массив;
		КонецЕсли;
		Если Изменения.Найти(СтрокаИзменений) = Неопределено Тогда
			Изменения.Добавить(СтрокаИзменений);
		КонецЕсли;
		ВыгруженныеИзменения.Вставить(Родитель, Изменения);
		
		// Добавляем для корня конфигурации - языки, а для языков - корень конфигурации
		Если Сегменты.Количество() > 0  И (Сегменты[0] = "Language" ИЛИ Сегменты[0] = "Configuration") Тогда
			Если Сегменты[0] = "Configuration" Тогда
				Родитель = "Language";
			Иначе
				Родитель = "Configuration";
			КонецЕсли;
			Изменения = ВыгруженныеИзменения.Получить(Родитель);
			Если Изменения = Неопределено Тогда
				Изменения = Новый Массив;
				ВыгруженныеИзменения.Вставить(Родитель, Изменения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДочерниеОбъекты = Новый Массив;
	ДочерниеОбъекты.Добавить("Form");
	ДочерниеОбъекты.Добавить("Template");
	ДочерниеОбъекты.Добавить("Recalculation");
	ДочерниеОбъекты.Добавить("Subsystem");
	
	Попытка

		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяФайлаДампа);

		Если ЧтениеXML.Прочитать() И  ЧтениеXML.Имя = "ConfigDumpInfo" И ЧтениеXML.Прочитать() И ЧтениеXML.Имя = "ConfigVersions"  Тогда
			Стек = 0;
			Пока ЧтениеXML.Прочитать() И  ЧтениеXML.Имя = "Metadata" Цикл
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					Стек = Стек - 1;
					Продолжить;
				КонецЕсли;
				
				Стек = Стек + 1;
				Если Стек > 1 Тогда
					Продолжить;
				КонецЕсли;
				ИмяОбъекта = "";
				Если ЧтениеXML.КоличествоАтрибутов() > 0 Тогда
					Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
						Если ЧтениеXML.Имя = "name" Тогда

							ИмяОбъекта = ЧтениеXML.Значение;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
					Сегменты = СтрРазделить(ИмяОбъекта, ".");
					Если Сегменты.Количество() > 0 И (Сегменты[0] = "Language" ИЛИ Сегменты[0] = "Configuration") Тогда
						Родитель = Сегменты[0];
					ИначеЕсли Сегменты.Количество() > 1 Тогда
						Родитель = Сегменты[0] + "." + Сегменты[1];
					Иначе
						Родитель = ИмяОбъекта;
					КонецЕсли;
					
					Если Сегменты.Количество() > 2 И ДочерниеОбъекты.Найти(Сегменты[2]) = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					Изменения = ВыгруженныеИзменения.Получить(Родитель);
					Если Изменения <> Неопределено И Изменения.Найти(ИмяОбъекта) = Неопределено Тогда
						СписокОбъектов.Добавить(ИмяОбъекта);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		ЧтениеXML.Закрыть();

	Исключение

	КонецПопытки;
	
	Возврат СписокОбъектов;
	
КонецФункции

// Формирует файлы коммита и записывает в зависимости от ОС
Процедура ЗаписатьФайлыКоммитаВерсии(Контекст, РеквизитыПредыдущейВерсии)
	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
	
	Команды = Новый Массив;
	Если ЭтоWindowsСервер Тогда
		Команды.Добавить("chcp 65001");
		ШаблонПеременной = "set %1=""%2""";
	Иначе
		Команды.Добавить("#!/bin/bash");
		ШаблонПеременной = "export %1=""%2""";
	КонецЕсли;
	Если ЗначениеЗаполнено(Контекст.ФайлЛогаGit) Тогда
		Команды.Добавить(СтрШаблон(ШаблонПеременной, "LOGFILE", Контекст.ФайлЛогаGit));
		Если ЭтоWindowsСервер Тогда
			ВыводЛога = ">> %LOGFILE% 2>&1";
			ШаблонКоманды = 
			"echo. [ВыводЛога]
			|echo [%time:~0,8%] [Команда] [ВыводЛога]
			|[Команда] [ВыводЛога]";
		Иначе
			ВыводЛога = ">> $LOGFILE 2>&1";
			ШаблонКоманды = 
			"echo [ВыводЛога]
			|echo [$(date +""%T"")] [Команда] [ВыводЛога]
			|[Команда] [ВыводЛога]";
		КонецЕсли;
	Иначе
		ВыводЛога = "";
		ШаблонКоманды = "[Команда]";
	КонецЕсли;
	Если ЭтоWindowsСервер Тогда
		Команда = СтрШаблон("cd /D ""%1"" [ВыводЛога]", Контекст.ЛокальныйКаталогGit);
	Иначе
		Команда = СтрШаблон("cd ""%1"" [ВыводЛога]", Контекст.ЛокальныйКаталогGit);
	КонецЕсли;
	Команды.Добавить(Команда);
	
	// Удаление index.lock для обхода ошибки: fatal: Unable to create 'index.lock': File exists.
	ФайлЗахвата = Новый Файл(Контекст.ЛокальныйКаталогGit + ".git" + ПолучитьРазделительПути() + "index.lock");
	Если ФайлЗахвата.Существует()
		И ФайлЗахвата.ЭтоФайл()
		И ФайлЗахвата.ПолучитьУниверсальноеВремяИзменения() + 60*МинутДоПроверкиЗависания() < ТекущаяУниверсальнаяДата() Тогда
		Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
			КомандаУдаления = "del """ + ФайлЗахвата.ПолноеИмя + """";
		Иначе
			КомандаУдаления = "rm """ + ФайлЗахвата.ПолноеИмя + """";
		КонецЕсли;
		Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", КомандаУдаления));
	КонецЕсли;
	
	ИмяФайлаИндексов = Контекст.КаталогИсходниковEDT + "DumpFilesIndex.txt";
	
	ТаблицаИндексов = ПрочитатьТаблицуИндексов(ИмяФайлаИндексов);
	ТаблицаИндексов.Сортировать("Уровень, ПолноеИмя");
	
	ДатаСоздания = Формат(Контекст.ДатаСоздания, "ДФ='yyyy-MM-dd HH:mm:ss'");
	Если СтрНайти(Контекст.ПользовательEMail, "@") = 0 Тогда
		ПользовательEMail = "<anonymous@localhost>";
	Иначе
		ПользовательEMail = "<" + Контекст.ПользовательEMail + ">";
	КонецЕсли;
	Если Контекст.ЕстьАвтор Тогда
		АвторИмяGit = Контекст.АвторИмяGit;
		Если СтрНайти(Контекст.АвторEmail, "@") = 0 Тогда
			АвторEmail = "<anonymous@localhost>";
		Иначе
			АвторEmail = "<" + Контекст.АвторEmail + ">";
		КонецЕсли;
	Иначе
		АвторИмяGit = Контекст.ПользовательИмяGit;
		АвторEmail = ПользовательEMail;
	КонецЕсли;
	
	Команды.Добавить(СтрШаблон(ШаблонПеременной, "GIT_AUTHOR_DATE", ДатаСоздания));
	Команды.Добавить(СтрШаблон(ШаблонПеременной, "GIT_COMMITTER_DATE", ДатаСоздания));
	Команды.Добавить(СтрШаблон(ШаблонПеременной, "GIT_AUTHOR_NAME", АвторИмяGit));
	Команды.Добавить(СтрШаблон(ШаблонПеременной, "GIT_AUTHOR_EMAIL", АвторEmail));
	Команды.Добавить(СтрШаблон(ШаблонПеременной, "GIT_COMMITTER_NAME", Контекст.ПользовательИмяGit));
	Команды.Добавить(СтрШаблон(ШаблонПеременной, "GIT_COMMITTER_EMAIL", ПользовательEMail));
	
	КомандаКоммита = СтрШаблон("git commit -F ""%1"" --allow-empty-message --cleanup=verbatim", Контекст.ФайлКомментарияGit);
	
	// Определение переименований и удалений.
	// Если выгружены только изменения, то версия не содержит переименований и удалений.
	// Если выгрузка полная, то необходимо сообщить git какие объекты были переименованы, а какие - удалены.
	// Для этого используется 2 таблицы индексов - текущей версии и предыдущей (помещенной в git).
	ПредыдущийФайлИндексов = "";
	Если ЗначениеЗаполнено(РеквизитыПредыдущейВерсии.Код) И Не Контекст.ВыгруженыТолькоИзменения Тогда
		ПолноеИмя1 = Контекст.КаталогGitИсходниковEDT + "DumpFilesIndex.txt";
		Если ОбщегоНазначения.ФайлСуществует(ПолноеИмя1) Тогда
			ПредыдущийФайлИндексов = ПолноеИмя1;
		Иначе
			ПолноеИмя2 = КаталогИсходниковEDT(РеквизитыПредыдущейВерсии) + "DumpFilesIndex.txt";
			Если ОбщегоНазначения.ФайлСуществует(ПолноеИмя2) Тогда
				ПредыдущийФайлИндексов = ПолноеИмя2;
			Иначе
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Невозможно корректно вычислить переименования и удаления объектов метаданных.
					|Не найден файл индексов предыдущей версии.
					|Искали: ""%1"" и ""%2"".'"), ПолноеИмя1, ПолноеИмя2);
				Если Контекст.ЕстьИзмененияПрепятствующиеИнкрементальнойВыгрузке Тогда
					Справочники.ВерсииХранилища.ОстановитьКонвертацию(Контекст.Ссылка);
					ВызватьИсключение ТекстОшибки;
				Иначе
					ЗаписатьВЛог(Контекст, 1, ТекстОшибки);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПредыдущийФайлИндексов) Тогда
		// Присутствующие только в новой таблице - добавленные объекты.
		// Присутствующие только в старой таблице - удаленные объекты.
		// Присутствующие в обеих таблицах - переименованные объекты.
		ТаблицаИндексовПредыдущейВерсии = ПрочитатьТаблицуИндексов(ПредыдущийФайлИндексов);
		ТаблицаИндексовПредыдущейВерсии.Сортировать("Уровень, UUID");
		ТаблицаИндексовПредыдущейВерсии.Индексы.Добавить("Уровень, UUID");
		
		ТекстыКомандПереименования = Новый Массив;
		// В местах пересечения регистрируются переименования и строки удаляются из таблицы.
		Для Каждого СтрокаТЧ Из ТаблицаИндексов Цикл
			Отбор = Новый Структура();
			Отбор.Вставить("Уровень", СтрокаТЧ.Уровень);
			Отбор.Вставить("UUID",    СтрокаТЧ.UUID);
			
			НайденныеСтроки = ТаблицаИндексовПредыдущейВерсии.НайтиСтроки(Отбор);
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Если НайденнаяСтрока.ХешПолногоИмени <> СтрокаТЧ.ХешПолногоИмени Тогда
					// Создание кататалога.
					ДиректорияПриемника = Контекст.ОтносительноеИмяКаталогаGitИсходниковEDT + СтрокаТЧ.ПолноеИмя;
					МассивПутей = СтрРазделить(ДиректорияПриемника, ПолучитьРазделительПути());
					МассивПутей.Удалить(МассивПутей.ВГраница());
					ДиректорияПриемника = СтрСоединить(МассивПутей, ПолучитьРазделительПути());
					Если ЭтоWindowsСервер Тогда
						Команда = СтрШаблон("mkdir ""%1""", ДиректорияПриемника);
					Иначе
						Команда = СтрШаблон("mkdir -p ""%1""", ДиректорияПриемника);
					КонецЕсли;
					ТекстыКомандПереименования.Добавить(Команда);
					// Указание git на переименование (перемещение).
					Источник = Контекст.ОтносительноеИмяКаталогаGitИсходниковEDT + НайденнаяСтрока.ПолноеИмя;
					Приемник = Контекст.ОтносительноеИмяКаталогаGitИсходниковEDT + СтрокаТЧ.ПолноеИмя;
					Команда = СтрШаблон("git mv -f %1 %2", Источник, Приемник);
					ТекстыКомандПереименования.Добавить(Команда);
				КонецЕсли;
				ТаблицаИндексовПредыдущейВерсии.Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЦикла;
		
		// Оставшиеся строки старой таблицы - удаленные объекты.
		Для Каждого СтрокаТЧ Из ТаблицаИндексовПредыдущейВерсии Цикл
			Команда = "git rm -f " + Контекст.ОтносительноеИмяКаталогаGitИсходниковEDT + СтрокаТЧ.ПолноеИмя;
			Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", Команда));
		КонецЦикла;
		Если ТаблицаИндексовПредыдущейВерсии.Количество() > 0 Тогда
			Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", КомандаКоммита));
		КонецЕсли;
		
		// Переименования вставляются после удаления т.к. могут быть конфликты,
		// если новое имя при переименовании совпадает с объектом, который удаляется
		Для Каждого КомандаПереименования Из ТекстыКомандПереименования Цикл
			Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", КомандаПереименования));
		КонецЦикла;
		Если ТекстыКомандПереименования.Количество() > 0 Тогда
			Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", КомандаКоммита));
		КонецЕсли;
	КонецЕсли;
	
	КаталогИсходниковEDT = ОбщегоНазначения.УдалитьКонечныйРазделительПути(Контекст.КаталогИсходниковEDT);
	КаталогGitИсходниковEDT = ОбщегоНазначения.УдалитьКонечныйРазделительПути(Контекст.КаталогGitИсходниковEDT);
	Если ОбщегоНазначения.КаталогиНаОдномУстройстве(Контекст.КаталогGitПроектаEDT, Контекст.КаталогПроектаEDT) Тогда
		// Если файлы на одном диске - для ускорения используется перемещение (меняется только путь).
		Если ЭтоWindowsСервер Тогда
			Если Не Контекст.ВыгруженыТолькоИзменения Тогда
				// Старый каталог src перемещаются из каталога гита в каталог версии, который затем будет удален в фоне.
				ТекстКоманды = "move /y ""%Источник%*"" ""%Приемник%""";
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", КаталогGitИсходниковEDT);
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", Контекст.КаталогВременныхФайлов + "EDT_src_prev");
				Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", ТекстКоманды));
				// В каталог Git'а перемещается новая версия каталога src.
				ТекстКоманды = "move /y ""%Источник%*"" ""%Приемник%""";
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", КаталогИсходниковEDT);
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", КаталогGitИсходниковEDT);
				Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", ТекстКоманды));
			КонецЕсли;
			// В каталог Git'а перемещаются оставшиеся файлы проекта EDT.
			ТекстКоманды = "for /d %%A in (""%Источник%*"") do IF EXIST ""%Приемник%%%~nxA"" ( robocopy ""%%~A"" ""%Приемник%%%~nxA"" /E /MOVE /NFL /NDL /NJH /NJS /NC /NS /NP) ELSE ( move /y ""%%~A"" ""%Приемник%"" )";
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", Контекст.КаталогПроектаEDT);
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", Контекст.КаталогGitПроектаEDT);
			Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", ТекстКоманды));
		Иначе
			Если НЕ Контекст.ВыгруженыТолькоИзменения Тогда
				// Старые файлы перемещаются в каталог версии, который затем будет удален в фоне.
				ТекстКоманды = "mv -f ""%Источник%"" ""%Приемник%""";
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", КаталогGitИсходниковEDT);
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", Контекст.КаталогВременныхФайлов + "EDT_src_prev");
				Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", ТекстКоманды));
				// В каталог Git'а перемещается папка src новой версии.
				ТекстКоманды = "mv -f ""%Источник%"" ""%Приемник%""";
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", КаталогИсходниковEDT);
				ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", КаталогGitИсходниковEDT);
				Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", ТекстКоманды));
			КонецЕсли;
			// В каталог Git'а перемещаются оставшиеся файлы проекта EDT.
			ТекстКоманды = "mv -f ""%Источник%""{.[!.],}* ""%Приемник%""";
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", Контекст.КаталогПроектаEDT);
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", Контекст.КаталогGitПроектаEDT);
			Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", ТекстКоманды));
		КонецЕсли;
	Иначе
		// Если файлы на разных дисках - необходимо удалить старые файлы и скопировать новые.
		Если ЭтоWindowsСервер Тогда
			Если Не Контекст.ВыгруженыТолькоИзменения Тогда
				// Сначала удаляются все файлы, минуя вывод текстовой информации на экран (что также значительно экономит время).
				ТекстКоманды = СтрШаблон("del /f /s /q %1 > nul", КаталогGitИсходниковEDT);
				Команды.Добавить(ТекстКоманды);
				// Затем удаляются все оставшиеся пустые папки.
				ТекстКоманды = СтрШаблон("rmdir /s /q %1", КаталогGitИсходниковEDT);
				Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", ТекстКоманды));
			КонецЕсли;
			// В каталог Git'а перемещаются оставшиеся файлы проекта EDT.
			ТекстКоманды = "for /d %%A in (""%Источник%*"") do IF EXIST ""%Приемник%%%~nxA"" ( robocopy ""%%~A"" ""%Приемник%%%~nxA"" /E /MOVE /NFL /NDL /NJH /NJS /NC /NS /NP) ELSE ( move /y ""%%~A"" ""%Приемник%"" )";
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", Контекст.КаталогПроектаEDT);
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", Контекст.КаталогGitПроектаEDT);
			Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", ТекстКоманды));
		Иначе
			Если НЕ Контекст.ВыгруженыТолькоИзменения Тогда
				// Старые файлы удаляются.
				ТекстКоманды = СтрШаблон("rm -rf ""%1""", КаталогGitИсходниковEDT);
				Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", ТекстКоманды));
			КонецЕсли;
			// В каталог Git'а перемещаются оставшиеся файлы проекта EDT.
			ТекстКоманды = "mv -f ""%Источник%""{.[!.],}* ""%Приемник%""";
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Источник%", Контекст.КаталогПроектаEDT);
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%Приемник%", Контекст.КаталогGitПроектаEDT);
			Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", ТекстКоманды));
		КонецЕсли;
	КонецЕсли;
	
	// Все файлы новой версии добавляем в индекс
	Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", "git add --all ./"));
	Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", КомандаКоммита));
	
	Комментарий = КомментарийКоммитаGit(Контекст);
	СтроковыеФункции.СтрокаВФайл(Комментарий, Контекст.ФайлКомментарияGit, "UTF-8", Ложь, Ложь);
	
	// Выполнение регламентных действий с репозиторием, если необходимо
	Команды.Добавить(СтрЗаменить(ШаблонКоманды, "[Команда]", "git gc --auto"));
	
	ТекстыКоманд = СтрСоединить(Команды, Символы.ПС + Символы.ПС);
	ТекстыКоманд = СтрЗаменить(ТекстыКоманд, "[ВыводЛога]", ВыводЛога);
	СтроковыеФункции.СтрокаВФайл(ТекстыКоманд, Контекст.ФайлКомандыGit, "UTF-8", Ложь, Ложь);
	
КонецПроцедуры

// Выполняются действия перед коммитом версии, перед запуском командного файла, выполняющего копирование 
// файлов версии в каталог репозитория и последующим коммитом изменений. Этот метод можно дополнять в 
// подключаемых расширениях для реализации дополнительной логики после выполнения коммита 
// в локальный репозиторий.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
// Возвращаемое значение:
//   Булево - Истина, если действия выполнены успешно, Ложь - если необходимо прервать коммит версии.
//
Функция ВыполнитьДействияПередКоммитом(Контекст, РеквизитыПредыдущейВерсии)

	Если ЗначениеЗаполнено(Контекст.АдресРепозиторияGit) И ЗначениеЗаполнено(Контекст.ВерсияВGit) Тогда
		ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
		
		Если Контекст.КоличествоОшибок > 0 Тогда
			ТекстКоманды = "git reset --hard&&git clean -fd";
		ИначеЕсли Контекст.ДобавлятьМеткиСВерсиейКонфигурации Тогда
			ТекстКоманды = "git pull --tags -f";
		Иначе
			ТекстКоманды = "git pull";
		КонецЕсли;
		Если Контекст.Свойство("ИмяФайлаЛога") И ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
			ТекстКоманды = ТекстКоманды + " >> ""%ФайлЛога%"" 2>&1";
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ФайлЛога%", Контекст.ИмяФайлаЛога);
		КонецЕсли;
		
		ЗаписатьВЛог(Контекст, 3, "ru='Получение коммитов из удаленного репозитория: Начало'");
		
		КодВозврата = Неопределено;
		ЗапуститьПриложение(?(ЭтоWindowsСервер, "cmd /C ", "bash -c ")
			+ ТекстКоманды, Контекст.ЛокальныйКаталогGit, Истина, КодВозврата);
		Успех = (КодВозврата = Неопределено Или КодВозврата = 0);
		ТекстЛога = СтрШаблон("ru='Получение коммитов из удаленного репозитория: Завершение. Код возврата: %1.'",
			?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
		ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога);
		
		Если КодВозврата <> Неопределено И КодВозврата <> 0 Тогда
			ВызватьИсключениеПриОбработкеВерсии(Контекст);
		КонецЕсли;
	КонецЕсли;
	
	МеткаКоммита = МеткаКоммита(Контекст, РеквизитыПредыдущейВерсии);
	Если ЗначениеЗаполнено(МеткаКоммита) Тогда
		ДобавитьМеткуСНомеромСборки(Контекст, МеткаКоммита);
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

// Возвращает метку коммита.
//
// Параметры:
//   Контекст - Структура -
//       Реквизиты версии помещаемой в Git. См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//   РеквизитыПредыдущейВерсии - Структура -
//       Реквизиты последней версии помещенной в Git. См. Справочники.ВерсииХранилища.ПараметрыВерсии.
//
// Возвращаемое значение:
//   Строка - Тег коммита.
//
Функция МеткаКоммита(Контекст, РеквизитыПредыдущейВерсии) Экспорт
	СтандартнаяОбработка = Истина;
	Метка = "";
	КонвертацияХранилищаПереопределяемый.ПриОпределенииМеткиКоммита(Контекст, РеквизитыПредыдущейВерсии, Метка, СтандартнаяОбработка);
	Если СтандартнаяОбработка
		И Контекст.ДобавлятьМеткиСВерсиейКонфигурации
		И Контекст.ВерсияКонфигурации <> ВерсияКонфигурации(РеквизитыПредыдущейВерсии) Тогда
		Метка = "v" + Контекст.ВерсияКонфигурации;
	КонецЕсли;
	Возврат Метка;
КонецФункции

// Выполняются действия после коммита. Если установлен адрес Git-сервера, то выполняется отправка коммитов 
// на сервер. Этот метод можно дополнять в подключаемых расширениях для реализации дополнительной логики 
// после выполнения коммита в локальный репозиторий.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
// Возвращаемое значение:
//   Булево - Истина, если действия выполнены успешно, Ложь - если необходимо прервать дальнейшую обработку.
//
Функция ВыполнитьДействияПослеКоммита(Контекст)
	
	// Перед отправкой коммитов на сервер необходимо проверить лог на ошибки.
	ТекстЛога = СтроковыеФункции.СтрокаИзФайла(Контекст.ФайлЛогаGit);
	// Есть недопустимые сообщения в логе гита при которых необходимо остановить конвертацию или повторить коммит.
	НедопустимыеСтроки = Новый Массив;
	// Не все измененные файлы помещены в хранилище.
	// Changes not staged for commit:
	//    modified:   <... file name ...>
	НедопустимыеСтроки.Добавить("Changes not staged for commit");
	// Есть изменения в неотслеживаемых файлах.
	//  Untracked files: <... file name ...>
	НедопустимыеСтроки.Добавить("Untracked files");
	// Ничего не изменилось в хранилище.
	НедопустимыеСтроки.Добавить("no changes added to commit");
	// Критичные ошибки.
	НедопустимыеСтроки.Добавить("fatal");
	НедопустимыеСтроки.Добавить("failed");
	// Среди недопустимых строк есть допустимые исключения.
	Исключения = Новый Массив;
	// Замер производительности и напоминание по оптимизации.
	// It took NNN seconds to enumerate untracked files. 'status -uno' may speed it up, ....
	Исключения.Добавить("to enumerate untracked files");
	СтандартнаяОбработка = Истина;
	КонвертацияХранилищаПереопределяемый.ПриПроверкеЛогаКоммитаGitНаОшибки(Контекст, ТекстЛога, НедопустимыеСтроки, Исключения, СтандартнаяОбработка);
	Если СтандартнаяОбработка Тогда
		ТекстЛогаВРег = ВРег(СтрЗаменить(ТекстЛога, " ", ""));
		Для Каждого ДопустимаяСтрокаВЛоге Из Исключения Цикл
			ТекстЛогаВРег = СтрЗаменить(ТекстЛогаВРег, ВРег(СтрЗаменить(ДопустимаяСтрокаВЛоге, " ", "")), "");
		КонецЦикла;
		Для Каждого НедопустимаяСтрокаВЛоге Из НедопустимыеСтроки Цикл
			Если СтрНайти(ТекстЛогаВРег, ВРег(СтрЗаменить(НедопустимаяСтрокаВЛоге, " ", ""))) > 0 Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В ходе коммита версии %1 в логе Git найден текст ошибки ""%2"". Лог:%3'"),
					Контекст.Код,
					НедопустимаяСтрокаВЛоге,
					Символы.ПС + ТекстЛога);
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Отправка коммитов в удаленный репозиторий.
	Если ЗначениеЗаполнено(Контекст.АдресРепозиторияGit)
		И ЗначениеЗаполнено(Контекст.ВерсияВGit) Тогда
		ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
		ДобавлятьМетки = ?(Контекст.ДобавлятьМеткиСВерсиейКонфигурации, "--tags", "");
		
		ТекстКоманды = "git push --progress %ДобавлятьМетки% -u origin %ИмяВетки%";
		Если Контекст.Свойство("ИмяФайлаЛога") И ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
			ТекстКоманды = ТекстКоманды + " >> ""%ФайлЛога%"" 2>&1";
			ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ФайлЛога%", Контекст.ИмяФайлаЛога);
		КонецЕсли;
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ИмяВетки%", Контекст.ИмяВетки);
		
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ДобавлятьМетки%", ДобавлятьМетки);
		
		ЗаписатьВЛог(Контекст, 3, "ru='Отправка коммитов на сервер Git: Начало'");
		
		КодВозврата = Неопределено;
		ЗапуститьПриложение(?(ЭтоWindowsСервер, "cmd /C ", "bash -c ")
			+ ТекстКоманды, Контекст.ЛокальныйКаталогGit, Истина, КодВозврата);
		Успех = (КодВозврата = Неопределено Или КодВозврата = 0);
		ТекстЛога = СтрШаблон("ru='Отправка коммитов на сервер Git: Завершение. Код возврата: %1.'",
			?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
		ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога);
		
		Если Не Успех Тогда
			ВызватьИсключениеПриОбработкеВерсии(Контекст);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

// Добавляет метку с версией конфигурации, если в следующем коммите меняется номер версии. 
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
// Возвращаемое значение:
// 	Булево - Истина, если действия выполнены успешно, Ложь - если необходимо прервать дальнейшую обработку.
Функция ДобавитьМеткуСНомеромСборки(Контекст, МеткаСВерсией)
	
	ЭтоWindowsСервер = ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер();
	
	ПутьВременныхФайлов = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Контекст.КаталогВременныхФайлов);
	ПутьФайлаПроверкиМетки = ПутьВременныхФайлов + "taginfo.txt";
	
	// Проверка существования метки с версией
	ТекстКоманды = "git tag -l ""%МеткаСВерсией%"" > ""%ПутьФайлаПроверкиМетки%"" 2>&1";
	ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ПутьФайлаПроверкиМетки%", ПутьФайлаПроверкиМетки);
	ТекстКоманды = СтрЗаменить(ТекстКоманды, "%МеткаСВерсией%", МеткаСВерсией);
	
	ЗаписатьВЛог(Контекст, 3, СтрШаблон("ru='Проверка наличия метки ''%1'': Начало'", МеткаСВерсией));
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(?(ЭтоWindowsСервер, "cmd /C ", "bash -c ")
		+ ТекстКоманды, Контекст.ЛокальныйКаталогGit, Истина, КодВозврата);
	Успех = (КодВозврата = Неопределено Или КодВозврата = 0);
	ТекстЛога = СтрШаблон("ru='Проверка существования метки ''%1'': Завершение. Код возврата: %2.'",
		МеткаСВерсией, ?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
	ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Если Не Успех Тогда
		ВызватьИсключениеПриОбработкеВерсии(Контекст);
	КонецЕсли;
	
	Текст = СокрЛП(СтроковыеФункции.СтрокаИзФайла(ПутьФайлаПроверкиМетки));
	Если Текст <> "" Тогда
		ЗаписатьВЛог(Контекст, 3, СтрШаблон("ru='Метка с номером ''%1'' уже существует.'", МеткаСВерсией));
		Возврат Истина
	КонецЕсли;
	
	// Добавление метки
	ЗаписатьВЛог(Контекст, 3, СтрШаблон("ru='Добавление метки ''%1'': Начало'", МеткаСВерсией));
	
	ТекстКоманды = "git tag -a ""%МеткаСВерсией%"" -m ""%МеткаСВерсией%""";
	Если Контекст.Свойство("ИмяФайлаЛога") И ЗначениеЗаполнено(Контекст.ИмяФайлаЛога) Тогда
		ТекстКоманды = ТекстКоманды + " >> ""%ФайлЛога%"" 2>&1";
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%ФайлЛога%", Контекст.ИмяФайлаЛога);
	КонецЕсли;
	ТекстКоманды = СтрЗаменить(ТекстКоманды, "%МеткаСВерсией%", МеткаСВерсией);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(?(ЭтоWindowsСервер, "cmd /C ", "bash -c ")
		+ ТекстКоманды, Контекст.ЛокальныйКаталогGit, Истина, КодВозврата);
	Успех = (КодВозврата = Неопределено Или КодВозврата = 0);
	ТекстЛога = СтрШаблон("ru='Добавление метки ''%1'': Завершение. Код возврата: %2.'",
		МеткаСВерсией, ?(КодВозврата = Неопределено, "Неопределено", КодВозврата));
	ЗаписатьВЛог(Контекст, ?(Успех, 3, 2), ТекстЛога);
	
	Если Не Успех Тогда
		ВызватьИсключениеПриОбработкеВерсии(Контекст);
	КонецЕсли;
	
	Возврат Истина
	
КонецФункции

// Возвращает текст комментария для коммита в репозиторий.
//   Для переопределения см. КонвертацияХранилищаПереопределяемый.ПриПодготовкеКомментарияGit.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
// Возвращаемое значение:
//   Строка - Текст комментария.
//
Функция КомментарийКоммитаGit(Контекст)
	Комментарий = Контекст.Комментарий;
	
	СтандартнаяОбработка = Истина;
	
	Настройки = Новый Структура;
	Настройки.Вставить("УдалятьЛидирующиеСлеши", Истина);
	Настройки.Вставить("ДобавлятьИнформациюОВерсии", Истина);
	Настройки.Вставить("ДобавлятьИнформациюОПользователе", Истина);
	Настройки.Вставить("ДобавлятьИнформациюОбАвторе", Истина);
	
	КонвертацияХранилищаПереопределяемый.ПриПодготовкеТекстаКомментарияGit(Контекст, Комментарий, Настройки, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ПриСтандартнойОбработкеТекстаКомментарияGit(Контекст, Комментарий, Настройки);
	КонецЕсли;
	
	Возврат Комментарий;
КонецФункции

// Готовит текст комментария для коммита в git.
//   См. КонвертацияХранилищаПереопределяемый.ПриПодготовкеКомментарияGit.
//
// Параметры:
//   Контекст - Структура
//   Комментарий - Строка
//   Настройки - Структура
//
Процедура ПриСтандартнойОбработкеТекстаКомментарияGit(Контекст, Комментарий, Настройки) Экспорт
	Комментарий = СокрЛП(Комментарий);
	
	// Удаление стандартных префиксов комментариев.
	Если Настройки.УдалятьЛидирующиеСлеши Тогда
		Комментарий = СтроковыеФункции.УдалитьЛидирующиеСлеши(Комментарий);
	КонецЕсли;
	
	Подвал = Новый Массив;
	
	// Стандартный подвал.
	Если Настройки.ДобавлятьИнформациюОВерсии Тогда
		Если ЗначениеЗаполнено(Контекст.ВерсияКонфигурации) Тогда
			Текст = СтрШаблон(
				НСтр("ru = 'Версия %1, коммит %2 от %3'"),
				Строка(Контекст.ВерсияКонфигурации),
				Формат(Контекст.Код, "ЧДЦ=; ЧГ=0"),
				Формат(Контекст.ДатаСоздания, "ДФ='yyyy-MM-dd HH:mm:ss'"));
		Иначе
			Текст = СтрШаблон(
				НСтр("ru = 'Коммит %1 от %2'"),
				Формат(Контекст.Код, "ЧДЦ=; ЧГ=0"),
				Формат(Контекст.ДатаСоздания, "ДФ='yyyy-MM-dd HH:mm:ss'"));
		КонецЕсли;
		Если Настройки.ДобавлятьИнформациюОПользователе И ЗначениеЗаполнено(Контекст.Пользователь) Тогда
			Текст = Текст +", " + Контекст.Пользователь;
		КонецЕсли;
		Подвал.Добавить(Текст + ".");
	КонецЕсли;
	
	// Информация о коммиттере и авторе.
	Если Настройки.ДобавлятьИнформациюОбАвторе И Контекст.ЕстьАвтор Тогда
		Подвал.Добавить(СтрШаблон(НСтр("ru = 'Автор изменений: %1.'"), Контекст.Автор));
	КонецЕсли;
	
	Если Подвал.Количество() > 0 Тогда
		ДетализацияКомментария = СтрСоединить(Подвал, Символы.ПС);
		Если ПустаяСтрока(Комментарий) Тогда
			Комментарий = ДетализацияКомментария;
		Иначе
			Комментарий = Комментарий + Символы.ПС + "----------" + Символы.ПС + ДетализацияКомментария;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПредставлениеПользователяДляКомментарияGit(Контекст, ЭтоКоммитер) Экспорт
	Если ЭтоКоммитер Тогда
		Имя1С = Контекст.Пользователь;
		Email = Контекст.ПользовательEMail;
		ИмяGit = Контекст.ПользовательИмяGit;
	Иначе
		Имя1С = Контекст.Автор;
		Email = Контекст.АвторEmail;
		ИмяGit = Контекст.АвторИмяGit;
	КонецЕсли;
	Если ЗначениеЗаполнено(Email) Тогда
		Возврат СтрШаблон("%1 (%2 <%3>)", Имя1С, ИмяGit, Email);
	Иначе
		Возврат Имя1С;
	КонецЕсли;
КонецФункции

// Формирует полный путь к каталогу файлов конфигурации версии внутри каталога проекта
// 
// Параметры:
// 	ПараметрыВерсии - Структура - Параметры версии
// Возвращаемое значение:
// 	Строка - путь к каталогу файлов конфигурации версии
Функция КаталогИсходниковEDT(ПараметрыВерсии)
	Возврат ОбщегоНазначения.ПолноеИмяКаталога(ПараметрыВерсии.КаталогВременныхФайлов, Истина, Ложь)
		+ "p" + ПолучитьРазделительПути() + "src";
КонецФункции

// Зачитывает результат из файла результатов пакетной операции Конфигуратора
// 
// Параметры:
// 	ФайлРезультатов - Строка - Имя файла результатов пакетной операции
// Возвращаемое значение:
// 	Число - Возвращается 0, если результат успешный (0 ошибок), 99999 если файл результата пустой, 
//  возвращается 100000 если ошибка чтения файла или в файле содержатся не числовые символы, N произвольное 
//  число, означающее наличие ошибок
Функция ПрочитатьФайлРезультата(ФайлРезультатов)
	
	Результат = 1;
	ФайлРезультата = Новый ТекстовыйДокумент();
	Попытка
		ФайлРезультата.Прочитать(ФайлРезультатов);
		ТекстРезультата = ФайлРезультата.ПолучитьТекст();
		Если ПустаяСтрока(ТекстРезультата) Тогда
			Результат = 99999;
		ИначеЕсли СокрЛП(ТекстРезультата) = "0" Тогда
			Результат = 0;
		Иначе
			Результат = Число(ТекстРезультата);
		КонецЕсли;
		
	Исключение
		Результат = 100000;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Копирует файлы рекурсивно
// 
// Параметры:
// 	Приемник - Строка
// 	Источник - Строка
Процедура СкопироватьФайлыРекурсивно(Источник, Приемник)

	Файлы = НайтиФайлы(Источник, "*");
	Для Каждого Файл Из Файлы Цикл
		ИмяПриемника = ОбщегоНазначения.ДобавитьКонечныйРазделительПути(Приемник)
			+ Файл.Имя;
		Если Файл.ЭтоКаталог() Тогда
			СоздатьКаталог(ИмяПриемника);
			СкопироватьФайлыРекурсивно(Файл.ПолноеИмя, ИмяПриемника);
		ИначеЕсли Файл.ЭтоФайл() Тогда
			КопироватьФайл(Файл.ПолноеИмя, ИмяПриемника);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Возвращает считанную из файла таблицу индексов
// 
// Параметры:
// 	ИмяФайлаИндексов - Строка - Полный путь к файлу индексов
// Возвращаемое значение:
// 	См. СозадатьТаблицуИндексов
Функция ПрочитатьТаблицуИндексов(ИмяФайлаИндексов)
	
	ТаблицаИндексов = СозадатьТаблицуИндексов();
	
	Файл = Новый Файл(ИмяФайлаИндексов);
	Если Не Файл.Существует() Тогда
		Возврат ТаблицаИндексов;
	КонецЕсли;
	
	Файл = Новый ЧтениеТекста();
	Файл.Открыть(ИмяФайлаИндексов, КодировкаТекста.UTF8);
	
	СледующаяСтрока = Файл.ПрочитатьСтроку(Символы.ПС);
	
	Пока СледующаяСтрока <> Неопределено Цикл
		
		ТекущаяСтрока = СледующаяСтрока;
		СледующаяСтрока = Файл.ПрочитатьСтроку(Символы.ПС);
		
		Если НЕ ПустаяСтрока(ТекущаяСтрока) Тогда
			МассивСтрок = СтрРазделить(ТекущаяСтрока, ":");
			Если МассивСтрок.Количество() = 4 Тогда
				UUID = МассивСтрок[0];
				ХешПолногоИмени = МассивСтрок[1];
				Попытка
					Уровень = Число(МассивСтрок[2]);
				Исключение
					Продолжить;
				КонецПопытки;
				ПолноеИмя = МассивСтрок[3];
				Если Уровень = 0 ИЛИ ПустаяСтрока(UUID) ИЛИ ПустаяСтрока(ХешПолногоИмени) ИЛИ ПустаяСтрока(ПолноеИмя) Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ТаблицаИндексов.Добавить();
				НоваяСтрока.UUID = UUID;
				НоваяСтрока.ХешПолногоИмени = ХешПолногоИмени;
				НоваяСтрока.Уровень = Уровень;
				НоваяСтрока.ПолноеИмя = ПолноеИмя;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Файл.Закрыть();
	
	Возврат ТаблицаИндексов;
	
КонецФункции

// Создает таблицу индексов структуры метаданных
// 
// Возвращаемое значение:
// 	ТаблицаЗначений - Таблица индексов:
// * UUID - Строка
// * ХешПолногоИмени - Строка
// * Уровень - Число
// * ПолноеИмя - Строка
Функция СозадатьТаблицуИндексов()
	
	КС = Новый КвалификаторыСтроки(240);
	ОписаниеТипаСтроки240 = Новый ОписаниеТипов("Строка", , КС);
	
	КС = Новый КвалификаторыСтроки(32);
	ОписаниеТипаСтроки32 = Новый ОписаниеТипов("Строка", , КС);
	
	ТаблицаИндексов = Новый ТаблицаЗначений();
	
	ТаблицаИндексов.Колонки.Добавить("UUID", ОписаниеТипаСтроки240);
	ТаблицаИндексов.Колонки.Добавить("ХешПолногоИмени", ОписаниеТипаСтроки32);
	ТаблицаИндексов.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
	ТаблицаИндексов.Колонки.Добавить("ПолноеИмя", Новый ОписаниеТипов("Строка"));
	
	Возврат ТаблицаИндексов;
	
КонецФункции

// Сохраняет табилцу индексов
// 
// Параметры:
// 	Таблица - См. СозадатьТаблицуИндексов
// 	ИмяФайлаИндексов - Строка - имя файла индексов
Процедура ЗаписатьТаблицуИндексов(Таблица, ИмяФайлаИндексов)
	
	Файл = Новый ЗаписьТекста();
	Файл.Открыть(ИмяФайлаИндексов, КодировкаТекста.UTF8);

	Таблица.Сортировать("Уровень, ПолноеИмя");
	
	Для Каждого СтрокаТЧ Из Таблица Цикл
		
		МассивСтрок = Новый Массив();
		МассивСтрок.Добавить(СтрокаТЧ.UUID);
		МассивСтрок.Добавить(СтрокаТЧ.ХешПолногоИмени);
		МассивСтрок.Добавить(Строка(СтрокаТЧ.Уровень));
		МассивСтрок.Добавить(СтрокаТЧ.ПолноеИмя);

		СтрокаИндекса = СтрСоединить(МассивСтрок, ":");
		Файл.ЗаписатьСтроку(СтрокаИндекса, Символы.ПС);
		
	КонецЦикла;
	
	Файл.Закрыть();
	
КонецПроцедуры

Процедура СкопироватьКаталогЦеликом(Знач КаталогПриемник, Знач КаталогИсточник)
	КаталогВыгруженныхРасширенныхФайловВыгрузки = КаталогИсточник;
	ПозицияВСтрокеРабочегоКаталога = СтрДлина(КаталогВыгруженныхРасширенныхФайловВыгрузки) + 1;
	
	КаталогРасширенныхФайловВыгрузки = КаталогПриемник;
	СоздатьКаталог(КаталогРасширенныхФайловВыгрузки);
	
	НайденныеРасширенныеФайлыКорня = НайтиФайлы(КаталогВыгруженныхРасширенныхФайловВыгрузки, "*.*", Истина);
	Для Каждого РасширенныйФайлКорняИсточник Из НайденныеРасширенныеФайлыКорня Цикл
		ИтоговоеИмя = КаталогРасширенныхФайловВыгрузки + Сред(РасширенныйФайлКорняИсточник.ПолноеИмя, 
			ПозицияВСтрокеРабочегоКаталога);
			
		Если РасширенныйФайлКорняИсточник.ЭтоКаталог() Тогда
			СоздатьКаталог(ИтоговоеИмя);
		Иначе
			КопироватьФайл(РасширенныйФайлКорняИсточник.ПолноеИмя, ИтоговоеИмя);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Выгружает объекты конфигурации по списку в каталог с указанным суффиксом.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//   ИменаОбъектовМетаданных - Строка
//   Суффикс - Строка - Постфикс каталога. Не должен содержать запрещенных для файлов символов
//
// Возвращаемое значение:
//   Строка - Каталог выгрузки
//
Функция ВыгрузитьОбъектыВКаталог(Контекст, ИменаОбъектовМетаданных, Суффикс)
	Контекст2 = ОбщегоНазначения.СкопироватьСтруктуру(Контекст);
	Контекст2.КаталогВыгрузкиВXML = Контекст.КаталогВременныхФайлов + "dump_" + Суффикс + ПолучитьРазделительПути();
	
	ФайлСписка = Контекст.КаталогВременныхФайлов + "export_object_" + Суффикс + ".txt";
	СтроковыеФункции.СтрокаВФайл(ИменаОбъектовМетаданных, ФайлСписка, КодировкаТекста.UTF8);
	
	ОбщегоНазначения.УдалитьФайлИлиКаталог(Контекст2.КаталогВыгрузкиВXML);
	ВыгрузитьКонфигурациюВФайлы(Контекст2, Ложь, ФайлСписка, Ложь);
	
	Возврат Контекст2.КаталогВыгрузкиВXML;
КонецФункции

#Область Лог

// Записывает событие в журнале регистрации и в файле лога.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//       * Ссылка - Произвольный - Объект базы данных в контексте которого выполняется действие.
//       * Состояние - Строка, ПеречислениеСсылка.СостоянияВерсии - Используется для определения имени события.
//       * ИмяФайлаЛога - Строка - Файл лога, в который необходимо записать событие.
//   Уровень - Число, УровеньЖурналаРегистрации - Уровень критичности события.
//       1 соответствует уровню УровеньЖурналаРегистрации.Ошибка.
//       2 соответствует уровню УровеньЖурналаРегистрации.Предупреждение.
//       3 соответствует уровню УровеньЖурналаРегистрации.Информация.
//       4 соответствует уровню УровеньЖурналаРегистрации.Примечание.
//   Текст - Строка, ИнформацияОбОшибке - Текст или информация об ошибке для записи в журнал.
//   ИмяСобытия - Строка, Неопределено - Тип события.
//   Процент - Число, Неопределено - Количество процентов текущего фонового задания. Если заполнено,
//       то вызвается ДлительныеОперации.СообщитьПрогресс(Процент, Текст).
//
Процедура ЗаписатьВЛог(Контекст, Уровень, Текст, Знач ИмяСобытия = Неопределено, Знач Процент = Неопределено)
	Значения = ОбщегоНазначения.ЗначенияСвойств(Контекст, "ИмяФайлаЛога, Состояние, Ссылка, Владелец");
	Если ИмяСобытия = Неопределено Тогда
		ИмяСобытия = ИмяСобытияВерсииДляЖурнала(Значения);
	КонецЕсли;
	Ссылка = ?(ЗначениеЗаполнено(Значения.Ссылка), Значения.Ссылка, Значения.Владелец);
	ОбщегоНазначения.ЗаписатьВЛог(Значения.ИмяФайлаЛога, Уровень, ИмяСобытия, Текст, Ссылка, Процент);
КонецПроцедуры

// Возвращает имя события для записи в журнал регистрации или лог.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяСобытияВерсииДляЖурнала(Контекст) Экспорт
	Если ЗначениеЗаполнено(Контекст.Состояние) Тогда
		Возврат СтрШаблон("ru='Конвертация хранилища. %1'", Строка(Контекст.Состояние));
	Иначе
		Возврат "ru='Конвертация хранилища'";
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецОбласти
