#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(МассивСсылок, ПараметрыВыполненияКоманды)
	ОбработкаКомандыНаСервере(МассивСсылок);
	Для Каждого Ссылка Из МассивСсылок Цикл
		ОповеститьОбИзменении(Ссылка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОбработкаКомандыНаСервере(МассивСсылок)
	ПустоеСостояние = Перечисления.СостоянияВерсии.ПустаяСсылка();
	Возврат Справочники.ВерсииХранилища.УстановитьСостояние(МассивСсылок, ПустоеСостояние, Истина);
КонецФункции

#КонецОбласти