///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец", Владелец) Тогда
		
		Элементы.Владелец.Видимость = Ложь;
		КлючНазначенияИспользования = "Владелец";
		КлючСохраненияПоложенияОкна = "Владелец";
		Элементы.ПометитьВсеНаУдаление.Видимость = Истина;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = Ложь;
		Список.КомпоновщикНастроек.Настройки.Структура.Очистить();
		Список.КомпоновщикНастроек.Настройки.Структура.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
		
	Иначе
		
		Элементы.ПометитьВсеНаУдаление.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Параметры.РежимВыбора Тогда
		
		Элементы.Список.РежимВыбора = Истина;
		КлючНазначенияИспользования = "РежимВыбора";
		КлючСохраненияПоложенияОкна = "РежимВыбора";
		
	КонецЕсли;
	
	Если Элементы.Состав.Видимость Тогда
		Состав.Параметры.УстановитьЗначениеПараметра("Ссылки", Справочники.ВерсииХранилища.ПустаяСсылка());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Состав.Видимость Тогда
		Состав.Параметры.УстановитьЗначениеПараметра("Ссылки", Элементы.Список.ВыделенныеСтроки);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСостояниеПолученCF(Команда)
	
	УстановитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, "ПолученCF");
	ОповеститьОбИзмененииВыделенныеСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеВыгруженаВXML(Команда)
	
	УстановитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, "ВыгруженаВXML");
	ОповеститьОбИзмененииВыделенныеСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеЗагруженаВEDT(Команда)
	
	УстановитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, "ЗагруженаВEDT");
	ОповеститьОбИзмененииВыделенныеСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеПомещенаВGit(Команда)
	
	ТекстВопроса = НСтр("ru = 'Изменения по версиям не будут отражены в репозитории.
						|Вы уверены, что необходимо установить состояние ""Версия помещена""?'");
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("УстановитьСостояниеПомещенаВGitЗавершение", ЭтотОбъект, Неопределено);
	
	Кнопки = Новый СписокЗначений();
	Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Уверен, установить ""Версия помещена""'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьСостояние(Команда)
	
	УстановитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, "ПустаяСсылка");
	ОповеститьОбИзмененииВыделенныеСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсеНаУдаление(Команда)
	ПометитьВсеНаУдалениеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УстановитьСостояниеНаСервере(Знач ВыделенныеСтроки, Знач Состояние)
	Количество = ВыделенныеСтроки.Количество();
	Если Не ЗначениеЗаполнено(Состояние) Или Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ВозниклаОшибка", Ложь);
	СтруктураРеквизитов.Вставить("ВыгруженыТолькоИзменения", Ложь);
	СтруктураРеквизитов.Вставить("КоличествоОшибок", 0);
	СтруктураРеквизитов.Вставить("ТекстОшибки", "");
	
	ДопСвойства = Новый Структура("ОчищатьКаталогВерсииВТекущемСеансе", Ложь);
	
	Если Состояние = "ПустаяСсылка" Тогда
		СтруктураРеквизитов.Вставить("Состояние", Перечисления.СостоянияВерсии.ПустаяСсылка());
		СтруктураРеквизитов.Вставить("ТребуетсяПолнаяВыгрузка", Истина);
	Иначе
		СтруктураРеквизитов.Вставить("Состояние", Перечисления.СостоянияВерсии[Состояние]);
	КонецЕсли;
	
	Для Каждого Ссылка Из ВыделенныеСтроки Цикл
		Справочники.ВерсииХранилища.УстановитьЗначенияРеквизитов(Ссылка, СтруктураРеквизитов, ДопСвойства);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииВыделенныеСтроки()

	Для Каждого Ссылка Из Элементы.Список.ВыделенныеСтроки Цикл
		ОповеститьОбИзменении(Ссылка);
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеПомещенаВGitЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, "ПомещенаВGit");
	ОповеститьОбИзмененииВыделенныеСтроки();
	
КонецПроцедуры

&НаСервере
Процедура ПометитьВсеНаУдалениеНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВерсииХранилища.Ссылка КАК Ссылка,
	|	ВерсииХранилища.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВерсииХранилища.ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.УстановитьПометкуУдаления(Не Объект.ПометкаУдаления);
	КонецЦикла;
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

