///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец", Владелец) Тогда
		
		Элементы.Владелец.Видимость = Ложь;
		КлючНазначенияИспользования = "Владелец";
		КлючСохраненияПоложенияОкна = "Владелец";
		Элементы.ПометитьВсеНаУдаление.Видимость = Истина;
		Элементы.СнятьСоВсехПометкиНаУдаление.Видимость = Истина;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = Ложь;
		Список.КомпоновщикНастроек.Настройки.Структура.Очистить();
		Список.КомпоновщикНастроек.Настройки.Структура.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
		
	Иначе
		
		Элементы.ПометитьВсеНаУдаление.Видимость = Ложь;
		Элементы.СнятьСоВсехПометкиНаУдаление.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Параметры.РежимВыбора Тогда
		
		Элементы.Список.РежимВыбора = Истина;
		КлючНазначенияИспользования = "РежимВыбора";
		КлючСохраненияПоложенияОкна = "РежимВыбора";
		
	КонецЕсли;
	
	Если Элементы.Состав.Видимость Тогда
		Состав.Параметры.УстановитьЗначениеПараметра("Ссылки", Справочники.ВерсииХранилища.ПустаяСсылка());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Состав.Видимость Тогда
		Состав.Параметры.УстановитьЗначениеПараметра("Ссылки", Элементы.Список.ВыделенныеСтроки);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПометитьВсеНаУдаление(Команда)
	УстановитьПометкуУдаления(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьСоВсехПометкиНаУдаление(Команда)
	УстановитьПометкуУдаления(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПометкуУдаления(Пометка)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВерсииХранилища.Ссылка КАК Ссылка,
	|	ВерсииХранилища.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВерсииХранилища.ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

