///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Сокращает строку до нужной длины, при этом обрезанная часть хешируется,
// обеспечивая уникальность строки. Проверяет длину строки на входе и, в случае
// превышения максимальной длины, преобразует ее конец по алгоритму MD5 в
// уникальную строку из 32 символов.
//
// Параметры:
//  Строка            - Строка - исходная строка произвольной длины.
//  МаксимальнаяДлина - Число  - требуемое максимальное количество символов в строке,
//                               минимальное значение: 32.
// 
// Возвращаемое значение:
//   Строка - строка, не превышающая максимальную длину.
//
Функция СократитьСтрокуКонтрольнойСуммой(Строка, МаксимальнаяДлина) Экспорт
	Если МаксимальнаяДлина < 32 Тогда
		ВызватьИсключение НСтр("ru = 'Параметр МаксимальнаяДлина не может быть меньше 32.'");
	КонецЕсли;
	Результат = Строка;
	Если СтрДлина(Строка) > МаксимальнаяДлина Тогда
		Результат = Лев(Строка, МаксимальнаяДлина - 32);
		ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
		ХешированиеДанных.Добавить(Сред(Строка, МаксимальнаяДлина - 32 + 1));
		Результат = Результат + СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "");
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция СтрЛев(Знач Строка, Знач Разделитель, СтрокаПослеРазделителя = Неопределено) Экспорт
	Позиция = Найти(Строка, Разделитель);
	Если Позиция = 0 Тогда
		СтрокаДоРазделителя = Строка;
		СтрокаПослеРазделителя = "";
	Иначе
		СтрокаДоРазделителя = Лев(Строка, Позиция - 1);
		СтрокаПослеРазделителя = Сред(Строка, Позиция + СтрДлина(Разделитель));
	КонецЕсли;
	Возврат СтрокаДоРазделителя;
КонецФункции

Функция СтрПрав(Знач Строка, Знач Разделитель, СтрокаДоРазделителя = Неопределено) Экспорт
	Позиция = СтрНайти(Строка, Разделитель, НаправлениеПоиска.СКонца);
	Если Позиция = 0 Тогда
		СтрокаДоРазделителя = "";
		СтрокаПослеРазделителя = Строка;
	Иначе
		СтрокаДоРазделителя = Лев(Строка, Позиция - 1);
		СтрокаПослеРазделителя = Сред(Строка, Позиция + СтрДлина(Разделитель));
	КонецЕсли;
	Возврат СтрокаПослеРазделителя;
КонецФункции

// Убирает из строки символы табуляции, обычные пробелы и неразрывные пробелы.
Функция УбратьПробелы(Строка) Экспорт
	Возврат УбратьСимволы(Строка, "	  ");
КонецФункции

// Убирает из строки указанные символы.
Функция УбратьСимволы(Строка, НаборСимволов) Экспорт
	Возврат СтрСоединить(СтрРазделить(Строка, НаборСимволов, Ложь), "");
КонецФункции

Функция УдалитьЛидирующиеСлеши(Знач Строка) Экспорт
	Строка = СтрЗаменить(Строка, Символы.ПС + "// ", Символы.ПС);
	Строка = СтрЗаменить(Строка, Символы.ПС + "//", Символы.ПС);
	Строка = СокрЛП(Строка);
	Если СтрНачинаетсяС(Строка, "//") Тогда
		Строка = СокрЛ(Сред(Строка, 3));
	КонецЕсли;
	Возврат Строка;
КонецФункции

Функция СтрокаВЧисло(Знач Строка) Экспорт
	ОписаниеТипов = Новый ОписаниеТипов("Число");
	Строка = УбратьПробелы(Строка);
	Результат = ОписаниеТипов.ПривестиЗначение(Строка);
	Если Результат = 0 И Не СтрНачинаетсяС(Строка, "0") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Результат;
КонецФункции

#Область Файлы

Функция СтрокаИзФайла(ПолноеИмяФайла, Кодировка = Неопределено) Экспорт
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Не Файл.Существует() Тогда
		Возврат "";
	КонецЕсли;
	Если Кодировка = Неопределено Тогда
		ФайловыйПоток = ФайловыеПотоки.ОткрытьДляЧтения(ПолноеИмяФайла);
		Кодировка = ОбщегоНазначения.КодировкаBOM(ФайловыйПоток);
		Если Не ЗначениеЗаполнено(Кодировка)
			И СтрСравнить(Прав(ПолноеИмяФайла, 3), "xml") = 0
			И Файл.Размер() > 10 Тогда
			Кодировка = ОбщегоНазначения.КодировкаXML(ФайловыйПоток);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Кодировка) Тогда
			Кодировка = "UTF-8";
		КонецЕсли;
	КонецЕсли;
	ЧтениеТекста = Новый ЧтениеТекста(ПолноеИмяФайла, Кодировка, , , Ложь);
	Текст = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	Возврат Текст;
КонецФункции

Функция СтрокаВФайл(Текст, ПолноеИмяФайла, Кодировка = "UTF-8", Дописывать = Ложь, ЗаписатьBOM = Истина) Экспорт
	Файл = Новый Файл(ПолноеИмяФайла);
	Режим = РежимОткрытияФайла.ОткрытьИлиСоздать;
	Если Не ОбщегоНазначения.КаталогСуществует(Файл.Путь) Тогда
		СоздатьКаталог(Файл.Путь);
	ИначеЕсли Дописывать И Файл.Существует() Тогда
		Режим = РежимОткрытияФайла.Дописать;
	КонецЕсли;
	Поток = Новый ФайловыйПоток(Файл.ПолноеИмя, Режим);
	ЗаписьТекста = Новый ЗаписьТекста(Поток, Кодировка, , , ЗаписатьBOM);
	ЗаписьТекста.Записать(Текст);
	ЗаписьТекста.Закрыть();
	Возврат Истина;
КонецФункции

#КонецОбласти

#КонецОбласти


