///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция СтрЛев(Знач Строка, Знач Разделитель, СтрокаПослеРазделителя = Неопределено) Экспорт
	Позиция = Найти(Строка, Разделитель);
	Если Позиция = 0 Тогда
		СтрокаДоРазделителя = Строка;
		СтрокаПослеРазделителя = "";
	Иначе
		СтрокаДоРазделителя = Лев(Строка, Позиция - 1);
		СтрокаПослеРазделителя = Сред(Строка, Позиция + СтрДлина(Разделитель));
	КонецЕсли;
	Возврат СтрокаДоРазделителя;
КонецФункции

Функция СтрПрав(Знач Строка, Знач Разделитель, СтрокаДоРазделителя = Неопределено) Экспорт
	Позиция = СтрНайти(Строка, Разделитель, НаправлениеПоиска.СКонца);
	Если Позиция = 0 Тогда
		СтрокаДоРазделителя = "";
		СтрокаПослеРазделителя = Строка;
	Иначе
		СтрокаДоРазделителя = Лев(Строка, Позиция - 1);
		СтрокаПослеРазделителя = Сред(Строка, Позиция + СтрДлина(Разделитель));
	КонецЕсли;
	Возврат СтрокаПослеРазделителя;
КонецФункции

// Убирает из строки символы табуляции, обычные пробелы и неразрывные пробелы.
Функция УбратьПробелы(Строка) Экспорт
	Возврат УбратьСимволы(Строка, "	  ");
КонецФункции

// Убирает из строки указанные символы.
Функция УбратьСимволы(Строка, НаборСимволов) Экспорт
	Возврат СтрСоединить(СтрРазделить(Строка, НаборСимволов, Ложь), "");
КонецФункции

#Область Файлы

Функция СтрокаИзФайла(ПолноеИмяФайла, Кодировка = Неопределено) Экспорт
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Не Файл.Существует() Тогда
		Возврат "";
	КонецЕсли;
	Если Кодировка = Неопределено Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
		Кодировка = ОбщегоНазначения.КодировкаДвоичныхДанных(ДвоичныеДанные);
		Если Кодировка = Неопределено Тогда
			Кодировка = "UTF-8";
		КонецЕсли;
	КонецЕсли;
	ЧтениеТекста = Новый ЧтениеТекста(ПолноеИмяФайла, Кодировка, , , Ложь);
	Текст = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	Возврат Текст;
КонецФункции

Функция СтрокаВФайл(Текст, ПолноеИмяФайла, Кодировка = "UTF-8") Экспорт
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Не ОбщегоНазначения.КаталогСуществует(Файл.Путь) Тогда
		СоздатьКаталог(Файл.Путь);
	КонецЕсли;
	ЗаписьТекста = Новый ЗаписьТекста(ПолноеИмяФайла, Кодировка);
	ЗаписьТекста.Записать(Текст);
	ЗаписьТекста.Закрыть();
	Возврат Истина;
КонецФункции

Функция ЧтениеТекстаИзДвоичныхДанных(ДвоичныеДанные, Кодировка) Экспорт
	БуферДвоичныхДанных = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанные);
	ПотокВПамяти = Новый ПотокВПамяти(БуферДвоичныхДанных);
	ЧтениеТекста = Новый ЧтениеТекста(ПотокВПамяти, Кодировка);
	Возврат ЧтениеТекста;
КонецФункции

#КонецОбласти

#КонецОбласти


