///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает префикс для имен файлов в зависимости от состояния версии.
//
// Параметры:
//   Состояние - ПеречислениеСсылка.СостоянияВерсии
//
// Возвращаемое значение:
//   Строка - Префикс.
//
Функция ПрефиксИмениФайла(Состояние) Экспорт
	Если Состояние = ПолучаетсяCF
		Или Состояние = ПолученCF Тогда
		Возврат "ПолучениеCF";
	ИначеЕсли Состояние = ВыгружаетсяВXML
		Или Состояние = ВыгруженаВXML Тогда
		Возврат "ВыгрузкаВXML";
	ИначеЕсли Состояние = ЗагружаетсяВEDT
		Или Состояние = ЗагруженаВEDT Тогда
		Возврат "ЗагрузкаВEDT";
	ИначеЕсли Состояние = ПомещаетсяВGit
		Или Состояние = ПомещенаВGit Тогда
		Возврат "";
	Иначе
		Возврат "ПустоеСостояние";
	КонецЕсли;
КонецФункции

Функция СостоянияПриНачалеОпераций() Экспорт
	Результат = Новый Массив;
	Результат.Добавить(ПолучаетсяCF);
	Результат.Добавить(ВыгружаетсяВXML);
	Результат.Добавить(ЗагружаетсяВEDT);
	Результат.Добавить(ПомещаетсяВGit);
	Возврат Результат;
КонецФункции

#КонецОбласти
