///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// @strict-types

#Область ПрограммныйИнтерфейс

// Возникает при ошибке импорта выгрузки XML в EDT.
//   Позволяет "на лету" исправить ошибки в выгрузке XML и повторить операцию импорта.
//   Пример см. в одноименной процедуре модуля КонвертацияХранилища.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//   ТекстОшибокИмпортаEDT - Строка - Лог импорта в EDT.
//   ПовторитьИмпорт - Булево - По умолчанию: Ложь.
//       Если Истина, то операция импорта в EDT будет повторно выполнена в этом же сеансе.
//       Рекомендуется устанавливать в Истина в случае, если удалось устранить хотя бы одну проблему импорта в EDT.
//       Если Ложь, то у версии будет включен флажок ВозниклаОшибка. Сборщик мусора очистит каталог и сбросит состояние
//       до "ПолученCF". Далее очередь "подхватит" эту версию, сделает полную выгрузку в XML и загрузит в EDT.
//
Процедура ПриОшибкеИмпортаВEDT(Контекст, ТекстОшибокИмпортаEDT, ПовторитьИмпорт) Экспорт
	
	
КонецПроцедуры

// Возникает перед коммитом. Позволяет установить метку коммита.
//   Например, можно по ключевым словам в комментарии определять необходимость добавления метки.
//   Если после стандартной обработки метка осталось пустой, то она установлена не будет.
//
// Параметры:
//   Контекст - Структура -
//       Реквизиты версии помещаемой в Git. См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//   РеквизитыПредыдущейВерсии - Структура -
//       Реквизиты последней версии помещенной в Git. См. Справочники.ВерсииХранилища.ПараметрыВерсии.
//   Метка - Строка - По умолчанию пустая строка.
//       Метка (тег) коммита.
//   СтандартнаяОбработка - Булево - По умолчанию Истина.
//       Если Истина и у хранилища включен флажок ДобавлятьМеткиСВерсиейКонфигурации,
//       и номер версии конфигурации отличаются от номера версии предыдущей конфигурации,
//       то метка буде заполнена в формате "v<НомерВерсииКонфигурации>".
//       Если Ложь, то метка не заполняется.
//
Процедура ПриОпределенииМеткиКоммита(Контекст, РеквизитыПредыдущейВерсии, Метка, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Возникает после коммита до отправки изменений в удаленный репозиторий.
//   Позволяет изменить список недопустимых строк, которые проверяются в логе git'а.
//
// Параметры:
//   Контекст - Структура - См. КонвертацияХранилища.КонтекстРаботыСВерсией.
//   Лог - Строка - Лог коммита в локальный репозиторий Git.
//   НедопустимыеСтроки - Массив из Строка - Недопустимые строки в логе git'а. Массив передается предзаполненным.
//       При стандартной обработке Лог будет проверен на отсутствие недопустимых строк.
//   Исключения - Массив из Строка - Допустимые строки (исключения из недопустимых строк). Передается предзаполненным.
//       При стандартной обработке перед проверкой Лога из него будут удалены все исключения (допустимые строки).
//   СтандартнаяОбработка - Булево - По умолачанию Истина. Проверить Лог на недопустимые строки.
//       Если Ложь, то проверка лога не осуществляется.
//
Процедура ПриПроверкеЛогаКоммитаGitНаОшибки(Контекст, Лог, НедопустимыеСтроки, Исключения, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

#КонецОбласти
