#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПереключитьКонстантуКонвертацияОстановлена(Команда)
	ПереключитьКонстантуКонвертацияОстановленаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПереключитьКонстантуКонвертацияОстановленаНаСервере()
	Константы.КонвертацияОстановлена.Установить(Не Константы.КонвертацияОстановлена.Получить());
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()
	КонвертацияОстановлена = Константы.КонвертацияОстановлена.Получить();
	Элементы.КнопкаРазрешитьКонвертацию.Пометка = Не КонвертацияОстановлена;
	Элементы.КнопкаРазрешитьКонвертацию.Отображение = ?(КонвертацияОстановлена, ОтображениеКнопки.Картинка, ОтображениеКнопки.КартинкаИТекст);
	Элементы.КнопкаОстановитьКонвертацию.Пометка = КонвертацияОстановлена;
	Элементы.КнопкаОстановитьКонвертацию.Отображение = ?(КонвертацияОстановлена, ОтображениеКнопки.КартинкаИТекст, ОтображениеКнопки.Картинка);
КонецПроцедуры

#КонецОбласти
