#Область ПрограммныйИнтерфейс

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать КонвертацияХранилища.ОбработатьОчередь.
Процедура ОбработатьОчередь(Очередь) Экспорт
	КонвертацияХранилища.ОбработатьОчередь(Очередь);
КонецПроцедуры

// Устарела. Следует использовать КонвертацияХранилища.ЗапуститьОбработкуОчередиВФоне.
Процедура ЗапуститьОбработкуОчередиВФоне(Очередь) Экспорт
	КонвертацияХранилища.ЗапуститьОбработкуОчередиВФоне(Очередь);
КонецПроцедуры

#КонецОбласти

#КонецОбласти
